{"recipe_name":"Sloppy Bulgogi","ingredients":"0.5 cup rice vinegar, 0.5 cup water, 2 tablespoons raw cane sugar, 1 teaspoon sriracha sauce, 1 small cucumber, thinly sliced, 0.5 small red onion, sliced into petals, 1 pound lean ground beef, 0.66666668653488 cup reduced-sodium soy sauce, 0.5 cup brown sugar, 3 green onions, chopped, 2 teaspoons sesame oil, 1 tablespoon sriracha sauce, 1 teaspoon garlic puree, 1 teaspoon ginger paste, 6 sesame seed burger buns","instructions":"Bring rice vinegar, water, sugar, and sriracha to a boil in a small saucepan over medium heat. Cook until sugar has dissolved, about 2 minutes. Place cucumber and red onion in a flat-bottomed dish and pour vinegar mixture over the top. Set aside to pickle as you prepare the bulgogi., Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until no longer pink, about 5 minutes. Drain and discard grease; return beef to skillet. Add soy sauce, brown sugar, green onions, sesame oil, sriracha, garlic, and ginger. Cook, stirring occasionally, until sauce begins to thicken, about 8 minutes., Serve bulgogi mixture on hamburger buns topped with the pickled cucumbers and onions.","step_instructions":"1. Bring rice vinegar, water, sugar, and sriracha to a boil in a small saucepan over medium heat. Cook until sugar has dissolved, about 2 minutes. Place cucumber and red onion in a flat-bottomed dish and pour vinegar mixture over the top. Set aside to pickle as you prepare the bulgogi.\n2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until no longer pink, about 5 minutes. Drain and discard grease; return beef to skillet. Add soy sauce, brown sugar, green onions, sesame oil, sriracha, garlic, and ginger. Cook, stirring occasionally, until sauce begins to thicken, about 8 minutes.\n3. Serve bulgogi mixture on hamburger buns topped with the pickled cucumbers and onions.","whole_recipe":"Recipe Name: Sloppy Bulgogi, \nIngredients: 0.5 cup rice vinegar, 0.5 cup water, 2 tablespoons raw cane sugar, 1 teaspoon sriracha sauce, 1 small cucumber, thinly sliced, 0.5 small red onion, sliced into petals, 1 pound lean ground beef, 0.66666668653488 cup reduced-sodium soy sauce, 0.5 cup brown sugar, 3 green onions, chopped, 2 teaspoons sesame oil, 1 tablespoon sriracha sauce, 1 teaspoon garlic puree, 1 teaspoon ginger paste, 6 sesame seed burger buns, \nCooking Instructions: 1. Bring rice vinegar, water, sugar, and sriracha to a boil in a small saucepan over medium heat. Cook until sugar has dissolved, about 2 minutes. Place cucumber and red onion in a flat-bottomed dish and pour vinegar mixture over the top. Set aside to pickle as you prepare the bulgogi.\n2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until no longer pink, about 5 minutes. Drain and discard grease; return beef to skillet. Add soy sauce, brown sugar, green onions, sesame oil, sriracha, garlic, and ginger. Cook, stirring occasionally, until sauce begins to thicken, about 8 minutes.\n3. Serve bulgogi mixture on hamburger buns topped with the pickled cucumbers and onions., "}
{"recipe_name":"Korean-Style Bulgogi Beef Tacos","ingredients":"2 pounds rib-eye steaks, 0.5 yellow onion, cut into chunks, 0.5 Asian pear, peeled and coarsely chopped, 4 cloves garlic, peeled, 1 (1\/2 inch) piece ginger root, peeled, 0.25 cup sake, 0.25 cup soy sauce, 0.25 cup dark brown sugar, 1 tablespoon sesame oil, 1 teaspoon ground black pepper, 1 tablespoon rice vinegar, 1 tablespoon white sugar, 1 tablespoon minced garlic, 2 teaspoons gochugaru (Korean red pepper flakes), or to taste, 1 teaspoon sesame oil, 1 teaspoon salt, 5 small cucumbers, cut into 1\/8-inch slices, 2 green onions, thinly sliced, 1 tablespoon canola oil, 1 teaspoon toasted sesame seeds, 12 (6 inch) white corn tortillas, 1 avocado, thinly sliced, 5 green onions, thinly sliced on the diagonal, 0.5 cup chopped fresh cilantro, 2 tablespoons gochujang (Korean hot pepper paste), or to taste","instructions":"Trim excess fat from beef and slice very thinly across the grain. Transfer beef to a container., Place onion, pear, garlic, ginger, and sake in a blender or food processor. Blend until smooth and creamy. Add soy sauce, brown sugar, sesame oil, and black pepper. Pulse until marinade is well mixed., Pour marinade over beef. Gently massage beef for a minute or two. Cover and refrigerate for at least 1 hour or overnight., Mix vinegar, sugar, garlic, gochugaru, sesame oil, and salt together in a large bowl. Add cucumbers and green onions and mix gently by hand. Refrigerate for at least 30 minutes., Remove beef from refrigerator about 20 minutes before cooking., Heat canola oil in a cast iron pan over high heat. Cook beef in batches, one layer at a time, stirring until nicely browned, about 3 minutes. Avoid overcrowding beef, or it will end up steaming instead of browning. Transfer to a serving plate and sprinkle with sesame seeds., Heat tortillas in another skillet, about 1 minute. Transfer to a serving platter and cover to keep warm. Serve beef bulgogi with the tortillas, cucumber salad, and avocado, green onions, and cilantro as garnishes. Drizzle gochujang over tacos, mixing it with a little water if too thick.","step_instructions":"1. Trim excess fat from beef and slice very thinly across the grain. Transfer beef to a container.\n2. Place onion, pear, garlic, ginger, and sake in a blender or food processor. Blend until smooth and creamy. Add soy sauce, brown sugar, sesame oil, and black pepper. Pulse until marinade is well mixed.\n3. Pour marinade over beef. Gently massage beef for a minute or two. Cover and refrigerate for at least 1 hour or overnight.\n4. Mix vinegar, sugar, garlic, gochugaru, sesame oil, and salt together in a large bowl. Add cucumbers and green onions and mix gently by hand. Refrigerate for at least 30 minutes.\n5. Remove beef from refrigerator about 20 minutes before cooking.\n6. Heat canola oil in a cast iron pan over high heat. Cook beef in batches, one layer at a time, stirring until nicely browned, about 3 minutes. Avoid overcrowding beef, or it will end up steaming instead of browning. Transfer to a serving plate and sprinkle with sesame seeds.\n7. Heat tortillas in another skillet, about 1 minute. Transfer to a serving platter and cover to keep warm. Serve beef bulgogi with the tortillas, cucumber salad, and avocado, green onions, and cilantro as garnishes. Drizzle gochujang over tacos, mixing it with a little water if too thick.","whole_recipe":"Recipe Name: Korean-Style Bulgogi Beef Tacos, \nIngredients: 2 pounds rib-eye steaks, 0.5 yellow onion, cut into chunks, 0.5 Asian pear, peeled and coarsely chopped, 4 cloves garlic, peeled, 1 (1\/2 inch) piece ginger root, peeled, 0.25 cup sake, 0.25 cup soy sauce, 0.25 cup dark brown sugar, 1 tablespoon sesame oil, 1 teaspoon ground black pepper, 1 tablespoon rice vinegar, 1 tablespoon white sugar, 1 tablespoon minced garlic, 2 teaspoons gochugaru (Korean red pepper flakes), or to taste, 1 teaspoon sesame oil, 1 teaspoon salt, 5 small cucumbers, cut into 1\/8-inch slices, 2 green onions, thinly sliced, 1 tablespoon canola oil, 1 teaspoon toasted sesame seeds, 12 (6 inch) white corn tortillas, 1 avocado, thinly sliced, 5 green onions, thinly sliced on the diagonal, 0.5 cup chopped fresh cilantro, 2 tablespoons gochujang (Korean hot pepper paste), or to taste, \nCooking Instructions: 1. Trim excess fat from beef and slice very thinly across the grain. Transfer beef to a container.\n2. Place onion, pear, garlic, ginger, and sake in a blender or food processor. Blend until smooth and creamy. Add soy sauce, brown sugar, sesame oil, and black pepper. Pulse until marinade is well mixed.\n3. Pour marinade over beef. Gently massage beef for a minute or two. Cover and refrigerate for at least 1 hour or overnight.\n4. Mix vinegar, sugar, garlic, gochugaru, sesame oil, and salt together in a large bowl. Add cucumbers and green onions and mix gently by hand. Refrigerate for at least 30 minutes.\n5. Remove beef from refrigerator about 20 minutes before cooking.\n6. Heat canola oil in a cast iron pan over high heat. Cook beef in batches, one layer at a time, stirring until nicely browned, about 3 minutes. Avoid overcrowding beef, or it will end up steaming instead of browning. Transfer to a serving plate and sprinkle with sesame seeds.\n7. Heat tortillas in another skillet, about 1 minute. Transfer to a serving platter and cover to keep warm. Serve beef bulgogi with the tortillas, cucumber salad, and avocado, green onions, and cilantro as garnishes. Drizzle gochujang over tacos, mixing it with a little water if too thick., "}
{"recipe_name":"Ramen Burger","ingredients":"2 (3 ounce) packages instant ramen noodles, flavor packet discarded, 2 large eggs, salt and ground black pepper to taste, 0.75 pound lean ground beef, 1 tablespoon soy sauce, 1 teaspoon sesame oil, 3 tablespoons vegetable oil, divided, 3 slices American cheese, 0.25 cup ketchup, 2 tablespoons chile-garlic sauce (such as Sriracha), 1.5 cups arugula, 3 large eggs","instructions":"Bring a pot of water to a boil; add ramen noodles. Boil, stirring occasionally, until noodles are tender, about 3 minutes. Drain. Allow noodles to cool slightly., Beat 2 eggs in a bowl; season with salt and pepper. Stir noodles into eggs until evenly coated. Divide noodles into 6 burger-size ramekins or bowls. Place a sheet of plastic wrap directly over noodles and stack another bowl on top to flatten noodles. Refrigerate until firm, about 20 minutes., Mix beef, soy sauce, and sesame oil in a bowl. Divide beef mixture into three equal portions and shape into patties., Heat about 1 tablespoon vegetable oil in a large skillet over medium-high heat. Invert each ramen bowl, gently tapping the bottom of the bowl until ramen loosens, careful to maintain bun shape., Fry each ramen bun, without moving noodles, in hot oil until golden brown, about 3 minutes. Flip each bun and continue frying until crisp, 3 to 5 minutes more. Ramen bun should be crispy on one side and slightly softer on the other. Transfer buns to large plate with the crispy side up., Heat about 1 tablespoon vegetable oil in the same skillet used to fry ramen over medium heat. Cook beef patties until burgers are lightly pink in the center, 3 to 5 minute per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Arrange a slice of American cheese over each burger and continue to cook until melted, about 1 minute more., Mix ketchup and chile-garlic sauce in a small bowl; spread mixture over the crispy side of each ramen bun. Divide arugula over 3 ramen buns. Place burgers over arugula., Heat about 1 teaspoon oil in a small skillet over medium-high heat; fry remaining eggs one at a time, adding more oil as needed, until yolk is almost firm, about 1 minutes per side. Place egg over patty and top with remaining bun.","step_instructions":"1. Bring a pot of water to a boil; add ramen noodles. Boil, stirring occasionally, until noodles are tender, about 3 minutes. Drain. Allow noodles to cool slightly.\n2. Beat 2 eggs in a bowl; season with salt and pepper. Stir noodles into eggs until evenly coated. Divide noodles into 6 burger-size ramekins or bowls. Place a sheet of plastic wrap directly over noodles and stack another bowl on top to flatten noodles. Refrigerate until firm, about 20 minutes.\n3. Mix beef, soy sauce, and sesame oil in a bowl. Divide beef mixture into three equal portions and shape into patties.\n4. Heat about 1 tablespoon vegetable oil in a large skillet over medium-high heat. Invert each ramen bowl, gently tapping the bottom of the bowl until ramen loosens, careful to maintain bun shape.\n5. Fry each ramen bun, without moving noodles, in hot oil until golden brown, about 3 minutes. Flip each bun and continue frying until crisp, 3 to 5 minutes more. Ramen bun should be crispy on one side and slightly softer on the other. Transfer buns to large plate with the crispy side up.\n6. Heat about 1 tablespoon vegetable oil in the same skillet used to fry ramen over medium heat. Cook beef patties until burgers are lightly pink in the center, 3 to 5 minute per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Arrange a slice of American cheese over each burger and continue to cook until melted, about 1 minute more.\n7. Mix ketchup and chile-garlic sauce in a small bowl; spread mixture over the crispy side of each ramen bun. Divide arugula over 3 ramen buns. Place burgers over arugula.\n8. Heat about 1 teaspoon oil in a small skillet over medium-high heat; fry remaining eggs one at a time, adding more oil as needed, until yolk is almost firm, about 1 minutes per side. Place egg over patty and top with remaining bun.","whole_recipe":"Recipe Name: Ramen Burger, \nIngredients: 2 (3 ounce) packages instant ramen noodles, flavor packet discarded, 2 large eggs, salt and ground black pepper to taste, 0.75 pound lean ground beef, 1 tablespoon soy sauce, 1 teaspoon sesame oil, 3 tablespoons vegetable oil, divided, 3 slices American cheese, 0.25 cup ketchup, 2 tablespoons chile-garlic sauce (such as Sriracha), 1.5 cups arugula, 3 large eggs, \nCooking Instructions: 1. Bring a pot of water to a boil; add ramen noodles. Boil, stirring occasionally, until noodles are tender, about 3 minutes. Drain. Allow noodles to cool slightly.\n2. Beat 2 eggs in a bowl; season with salt and pepper. Stir noodles into eggs until evenly coated. Divide noodles into 6 burger-size ramekins or bowls. Place a sheet of plastic wrap directly over noodles and stack another bowl on top to flatten noodles. Refrigerate until firm, about 20 minutes.\n3. Mix beef, soy sauce, and sesame oil in a bowl. Divide beef mixture into three equal portions and shape into patties.\n4. Heat about 1 tablespoon vegetable oil in a large skillet over medium-high heat. Invert each ramen bowl, gently tapping the bottom of the bowl until ramen loosens, careful to maintain bun shape.\n5. Fry each ramen bun, without moving noodles, in hot oil until golden brown, about 3 minutes. Flip each bun and continue frying until crisp, 3 to 5 minutes more. Ramen bun should be crispy on one side and slightly softer on the other. Transfer buns to large plate with the crispy side up.\n6. Heat about 1 tablespoon vegetable oil in the same skillet used to fry ramen over medium heat. Cook beef patties until burgers are lightly pink in the center, 3 to 5 minute per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Arrange a slice of American cheese over each burger and continue to cook until melted, about 1 minute more.\n7. Mix ketchup and chile-garlic sauce in a small bowl; spread mixture over the crispy side of each ramen bun. Divide arugula over 3 ramen buns. Place burgers over arugula.\n8. Heat about 1 teaspoon oil in a small skillet over medium-high heat; fry remaining eggs one at a time, adding more oil as needed, until yolk is almost firm, about 1 minutes per side. Place egg over patty and top with remaining bun., "}
{"recipe_name":"Breaded Hamburgers","ingredients":"1 pound ground beef, 0.25 teaspoon salt, or to taste, 0.5 teaspoon ground black pepper, or to taste, 0.5 teaspoon garlic powder, or to taste, 2 teaspoons Worcestershire sauce, 2 eggs, 1.5 cups bread crumbs, 0.25 cup vegetable oil for frying, 1 small onion, sliced into rings","instructions":"Preheat the oven to 350 degrees F (175 degrees C)., Whisk eggs together in a small bowl. Place bread crumbs on a plate. In a medium bowl, mix together the ground beef, salt, pepper, garlic powder, and Worcestershire sauce. Form into 4 patties. Dip burger patties into egg, then press into bread crumbs to coat., Heat oil in a large skillet over medium-high heat. Brown the breaded hamburgers on each side, about 2 minutes per side., Place onion rings in the bottom of a baking dish or casserole dish. Pour in just enough water to cover the bottom, but not cover the onion. Carefully place burgers on top of the onions in the baking dish without touching the water., Bake for 25 to 30 minutes in the preheated oven, until burgers are well done.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Whisk eggs together in a small bowl. Place bread crumbs on a plate. In a medium bowl, mix together the ground beef, salt, pepper, garlic powder, and Worcestershire sauce. Form into 4 patties. Dip burger patties into egg, then press into bread crumbs to coat.\n3. Heat oil in a large skillet over medium-high heat. Brown the breaded hamburgers on each side, about 2 minutes per side.\n4. Place onion rings in the bottom of a baking dish or casserole dish. Pour in just enough water to cover the bottom, but not cover the onion. Carefully place burgers on top of the onions in the baking dish without touching the water.\n5. Bake for 25 to 30 minutes in the preheated oven, until burgers are well done.","whole_recipe":"Recipe Name: Breaded Hamburgers, \nIngredients: 1 pound ground beef, 0.25 teaspoon salt, or to taste, 0.5 teaspoon ground black pepper, or to taste, 0.5 teaspoon garlic powder, or to taste, 2 teaspoons Worcestershire sauce, 2 eggs, 1.5 cups bread crumbs, 0.25 cup vegetable oil for frying, 1 small onion, sliced into rings, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Whisk eggs together in a small bowl. Place bread crumbs on a plate. In a medium bowl, mix together the ground beef, salt, pepper, garlic powder, and Worcestershire sauce. Form into 4 patties. Dip burger patties into egg, then press into bread crumbs to coat.\n3. Heat oil in a large skillet over medium-high heat. Brown the breaded hamburgers on each side, about 2 minutes per side.\n4. Place onion rings in the bottom of a baking dish or casserole dish. Pour in just enough water to cover the bottom, but not cover the onion. Carefully place burgers on top of the onions in the baking dish without touching the water.\n5. Bake for 25 to 30 minutes in the preheated oven, until burgers are well done., "}
{"recipe_name":"My Husband's Favorite Baked Burgers","ingredients":"1 pound lean ground beef, 0.5 cup seasoned bread crumbs, 0.25 cup ketchup, 4 tablespoons Worcestershire sauce, 1 tablespoon garlic powder, 1 tablespoon onion powder, 0.5 teaspoon mustard powder, salt and ground black pepper to taste","instructions":"Preheat the oven to 400 degrees F (200 degrees C)., Combine ground beef, bread crumbs, ketchup, Worcestershire sauce, garlic powder, onion powder, mustard powder, salt, and black pepper in a bowl until well mixed. Form into 4 patties and place on a baking sheet., Bake in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Serve immediately.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C).\n2. Combine ground beef, bread crumbs, ketchup, Worcestershire sauce, garlic powder, onion powder, mustard powder, salt, and black pepper in a bowl until well mixed. Form into 4 patties and place on a baking sheet.\n3. Bake in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Serve immediately.","whole_recipe":"Recipe Name: My Husband's Favorite Baked Burgers, \nIngredients: 1 pound lean ground beef, 0.5 cup seasoned bread crumbs, 0.25 cup ketchup, 4 tablespoons Worcestershire sauce, 1 tablespoon garlic powder, 1 tablespoon onion powder, 0.5 teaspoon mustard powder, salt and ground black pepper to taste, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C).\n2. Combine ground beef, bread crumbs, ketchup, Worcestershire sauce, garlic powder, onion powder, mustard powder, salt, and black pepper in a bowl until well mixed. Form into 4 patties and place on a baking sheet.\n3. Bake in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Serve immediately., "}
{"recipe_name":"Easy Sausage Strata","ingredients":"cooking spray, 1 pound pork sausage, 6 (1 ounce) slices bread, cubed, 2 cups shredded Cheddar cheese, 2 cups milk, 6 large eggs, 1 teaspoon salt, 1 teaspoon ground dry mustard","instructions":"Lightly grease a 7x11-inch baking dish with cooking spray; set aside., Heat a large, deep skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain., Layer bread cubes, cooked sausage, and cheese in the prepared baking dish. Beat together milk, eggs, salt, and mustard in a medium bowl. Pour over bread mixture. Cover and refrigerate for 8 hours to overnight., Preheat the oven to 350 degrees F (175 degrees C)., While the oven is heating, let casserole sit at room temperature for at least 30 minutes before baking., Bake casserole in the preheated oven until a knife inserted into the center comes out clean, 50 to 60 minutes. Let casserole stand for 10 minutes before serving.","step_instructions":"1. Lightly grease a 7x11-inch baking dish with cooking spray; set aside.\n2. Heat a large, deep skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain.\n3. Layer bread cubes, cooked sausage, and cheese in the prepared baking dish. Beat together milk, eggs, salt, and mustard in a medium bowl. Pour over bread mixture. Cover and refrigerate for 8 hours to overnight.\n4. Preheat the oven to 350 degrees F (175 degrees C).\n5. While the oven is heating, let casserole sit at room temperature for at least 30 minutes before baking.\n6. Bake casserole in the preheated oven until a knife inserted into the center comes out clean, 50 to 60 minutes. Let casserole stand for 10 minutes before serving.","whole_recipe":"Recipe Name: Easy Sausage Strata, \nIngredients: cooking spray, 1 pound pork sausage, 6 (1 ounce) slices bread, cubed, 2 cups shredded Cheddar cheese, 2 cups milk, 6 large eggs, 1 teaspoon salt, 1 teaspoon ground dry mustard, \nCooking Instructions: 1. Lightly grease a 7x11-inch baking dish with cooking spray; set aside.\n2. Heat a large, deep skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain.\n3. Layer bread cubes, cooked sausage, and cheese in the prepared baking dish. Beat together milk, eggs, salt, and mustard in a medium bowl. Pour over bread mixture. Cover and refrigerate for 8 hours to overnight.\n4. Preheat the oven to 350 degrees F (175 degrees C).\n5. While the oven is heating, let casserole sit at room temperature for at least 30 minutes before baking.\n6. Bake casserole in the preheated oven until a knife inserted into the center comes out clean, 50 to 60 minutes. Let casserole stand for 10 minutes before serving., "}
{"recipe_name":"Apple Raisin French Toast Strata","ingredients":"1 (1 pound) loaf cinnamon raisin bread, cubed, 1 (8 ounce) package cream cheese, diced, 1 cup diced peeled apples, 8 eggs, 2.5 cups half-and-half cream, 6 tablespoons butter, melted, 0.25 cup maple syrup","instructions":"Coat a 9x13 inch baking dish with cooking spray. Arrange 1\/2 of the cubed raisin bread in the bottom of the dish. Sprinkle the cream cheese evenly over the bread, and top with the apples. If you like extra raisins, add them now. Top with remaining bread., In a large bowl, beat the eggs with the cream, butter, and maple syrup. Pour over the bread mixture. Cover with plastic wrap, and press down so that all bread pieces are soaked. Refrigerate at least 2 hours., Preheat oven to 325 degrees F (165 degrees C)., Bake 45 minutes in the preheated oven. Let stand for 10 minutes before serving.","step_instructions":"1. Coat a 9x13 inch baking dish with cooking spray. Arrange 1\/2 of the cubed raisin bread in the bottom of the dish. Sprinkle the cream cheese evenly over the bread, and top with the apples. If you like extra raisins, add them now. Top with remaining bread.\n2. In a large bowl, beat the eggs with the cream, butter, and maple syrup. Pour over the bread mixture. Cover with plastic wrap, and press down so that all bread pieces are soaked. Refrigerate at least 2 hours.\n3. Preheat oven to 325 degrees F (165 degrees C).\n4. Bake 45 minutes in the preheated oven. Let stand for 10 minutes before serving.","whole_recipe":"Recipe Name: Apple Raisin French Toast Strata, \nIngredients: 1 (1 pound) loaf cinnamon raisin bread, cubed, 1 (8 ounce) package cream cheese, diced, 1 cup diced peeled apples, 8 eggs, 2.5 cups half-and-half cream, 6 tablespoons butter, melted, 0.25 cup maple syrup, \nCooking Instructions: 1. Coat a 9x13 inch baking dish with cooking spray. Arrange 1\/2 of the cubed raisin bread in the bottom of the dish. Sprinkle the cream cheese evenly over the bread, and top with the apples. If you like extra raisins, add them now. Top with remaining bread.\n2. In a large bowl, beat the eggs with the cream, butter, and maple syrup. Pour over the bread mixture. Cover with plastic wrap, and press down so that all bread pieces are soaked. Refrigerate at least 2 hours.\n3. Preheat oven to 325 degrees F (165 degrees C).\n4. Bake 45 minutes in the preheated oven. Let stand for 10 minutes before serving., "}
{"recipe_name":"Blue Cheese Burgers","ingredients":"3 pounds lean ground beef, 0.5 cup minced fresh chives, 4 ounces blue cheese, crumbled, 1.5 teaspoons salt, 1 teaspoon Worcestershire sauce, 1 teaspoon coarsely ground black pepper, 1 teaspoon dry mustard, 0.25 teaspoon hot pepper sauce, 12 hamburger buns, split","instructions":"Mix ground beef, chives, blue cheese, salt, Worcestershire sauce, pepper, mustard, and hot pepper sauce together in a large bowl until well combined. Cover and refrigerate for 2 hours., When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate., Remove beef mixture from the refrigerator; form into 12 patties., Cook patties on the preheated grill until an instant-read thermometer inserted into the center reads at least 160 degrees F (71 degrees C), about 5 minutes per side. Serve on hamburger buns.","step_instructions":"1. Mix ground beef, chives, blue cheese, salt, Worcestershire sauce, pepper, mustard, and hot pepper sauce together in a large bowl until well combined. Cover and refrigerate for 2 hours.\n2. When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate.\n3. Remove beef mixture from the refrigerator; form into 12 patties.\n4. Cook patties on the preheated grill until an instant-read thermometer inserted into the center reads at least 160 degrees F (71 degrees C), about 5 minutes per side. Serve on hamburger buns.","whole_recipe":"Recipe Name: Blue Cheese Burgers, \nIngredients: 3 pounds lean ground beef, 0.5 cup minced fresh chives, 4 ounces blue cheese, crumbled, 1.5 teaspoons salt, 1 teaspoon Worcestershire sauce, 1 teaspoon coarsely ground black pepper, 1 teaspoon dry mustard, 0.25 teaspoon hot pepper sauce, 12 hamburger buns, split, \nCooking Instructions: 1. Mix ground beef, chives, blue cheese, salt, Worcestershire sauce, pepper, mustard, and hot pepper sauce together in a large bowl until well combined. Cover and refrigerate for 2 hours.\n2. When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate.\n3. Remove beef mixture from the refrigerator; form into 12 patties.\n4. Cook patties on the preheated grill until an instant-read thermometer inserted into the center reads at least 160 degrees F (71 degrees C), about 5 minutes per side. Serve on hamburger buns., "}
{"recipe_name":"Orzo and Broccoli Salad (No Mayo)","ingredients":"1.5 cups uncooked orzo pasta, 1 bunch fresh broccoli, cut into florets, 0.25 cup olive oil, 3 tablespoons pine nuts, 0.5 teaspoon crushed red pepper flakes, 0.75 cup sliced black olives, 0.5 cup grated Parmesan cheese, 0.25 cup chopped fresh basil, 3.5 ounces crumbled feta cheese, salt and ground black pepper to taste","instructions":"Bring a large pot of lightly salted water to a boil. Add orzo and cook for 8 minutes. Add broccoli florets to the pot and cook until tender, 2 more minutes. Drain and transfer to a large bowl., Heat olive oil in a skillet over medium-low heat. Add pine nuts and cook until browned, about 3 minutes. Add red pepper flakes; cook and stir until aromatic, about 30 seconds. Remove from the heat and pour over the orzo., Toss orzo until coated with oil mixture. Add olives, Parmesan cheese, basil, and feta cheese. Toss again and season with salt and pepper.","step_instructions":"1. Bring a large pot of lightly salted water to a boil. Add orzo and cook for 8 minutes. Add broccoli florets to the pot and cook until tender, 2 more minutes. Drain and transfer to a large bowl.\n2. Heat olive oil in a skillet over medium-low heat. Add pine nuts and cook until browned, about 3 minutes. Add red pepper flakes; cook and stir until aromatic, about 30 seconds. Remove from the heat and pour over the orzo.\n3. Toss orzo until coated with oil mixture. Add olives, Parmesan cheese, basil, and feta cheese. Toss again and season with salt and pepper.","whole_recipe":"Recipe Name: Orzo and Broccoli Salad (No Mayo), \nIngredients: 1.5 cups uncooked orzo pasta, 1 bunch fresh broccoli, cut into florets, 0.25 cup olive oil, 3 tablespoons pine nuts, 0.5 teaspoon crushed red pepper flakes, 0.75 cup sliced black olives, 0.5 cup grated Parmesan cheese, 0.25 cup chopped fresh basil, 3.5 ounces crumbled feta cheese, salt and ground black pepper to taste, \nCooking Instructions: 1. Bring a large pot of lightly salted water to a boil. Add orzo and cook for 8 minutes. Add broccoli florets to the pot and cook until tender, 2 more minutes. Drain and transfer to a large bowl.\n2. Heat olive oil in a skillet over medium-low heat. Add pine nuts and cook until browned, about 3 minutes. Add red pepper flakes; cook and stir until aromatic, about 30 seconds. Remove from the heat and pour over the orzo.\n3. Toss orzo until coated with oil mixture. Add olives, Parmesan cheese, basil, and feta cheese. Toss again and season with salt and pepper., "}
{"recipe_name":"Egg and Sausage Casserole","ingredients":"1 pound pork sausage, 8 eggs, beaten, 2 cups shredded mozzarella cheese, 2 cups shredded Cheddar cheese, 1 teaspoon dried oregano, 1 (8 ounce) package refrigerated crescent roll dough","instructions":"Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a 9x13-inch baking dish., Cook sausage in a large, deep skillet over medium-high heat, until evenly browned, 7 to 9 minutes. Drain and crumble into small pieces., Mix beaten eggs, mozzarella, Cheddar, and oregano together in a large bowl., Line the bottom of the prepared baking dish with crescent roll dough, then sprinkle crumbled sausage over top. Pour egg mixture over sausage., Bake in the preheated oven until a knife inserted into the center comes out clean, 25 to 30 minutes.","step_instructions":"1. Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a 9x13-inch baking dish.\n2. Cook sausage in a large, deep skillet over medium-high heat, until evenly browned, 7 to 9 minutes. Drain and crumble into small pieces.\n3. Mix beaten eggs, mozzarella, Cheddar, and oregano together in a large bowl.\n4. Line the bottom of the prepared baking dish with crescent roll dough, then sprinkle crumbled sausage over top. Pour egg mixture over sausage.\n5. Bake in the preheated oven until a knife inserted into the center comes out clean, 25 to 30 minutes.","whole_recipe":"Recipe Name: Egg and Sausage Casserole, \nIngredients: 1 pound pork sausage, 8 eggs, beaten, 2 cups shredded mozzarella cheese, 2 cups shredded Cheddar cheese, 1 teaspoon dried oregano, 1 (8 ounce) package refrigerated crescent roll dough, \nCooking Instructions: 1. Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a 9x13-inch baking dish.\n2. Cook sausage in a large, deep skillet over medium-high heat, until evenly browned, 7 to 9 minutes. Drain and crumble into small pieces.\n3. Mix beaten eggs, mozzarella, Cheddar, and oregano together in a large bowl.\n4. Line the bottom of the prepared baking dish with crescent roll dough, then sprinkle crumbled sausage over top. Pour egg mixture over sausage.\n5. Bake in the preheated oven until a knife inserted into the center comes out clean, 25 to 30 minutes., "}
{"recipe_name":"Sweet Potato Breakfast Casserole","ingredients":"1 (8 ounce) package vegetarian sausage links (such as Morningstar Farms®), 0.5 cup water, or more as needed, 4 cups shredded sweet potatoes, 0.25 cup butter, melted, 1.5 (8 ounce) packages shredded, reduced-fat mild Cheddar-mozzarella cheese blend, 0.5 cup finely chopped onion, 1 cup finely sliced fresh spinach leaves, 1 (16 ounce) container low-fat small curd cottage cheese, 8 jumbo eggs","instructions":"Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish., Place sausage in a large skillet and pour in about 1\/4 inch of water; cook sausage over medium heat until water evaporates and sausages are evenly browned, 10 to 15 minutes. Crumble cooked sausages into a bowl., Mix sweet potatoes and butter together in a bowl; evenly spread into the bottom of the prepared 9x13-inch dish., Stir Cheddar-mozzarella cheese blend, onion, spinach, cottage cheese, eggs, and crumbled sausage together in a large bowl; spoon over sweet potato layer., Bake casserole in the preheated oven until a toothpick inserted in the center comes out clean and eggs are set, about 1 hour. Cool 5 minutes before serving.","step_instructions":"1. Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.\n2. Place sausage in a large skillet and pour in about 1\/4 inch of water; cook sausage over medium heat until water evaporates and sausages are evenly browned, 10 to 15 minutes. Crumble cooked sausages into a bowl.\n3. Mix sweet potatoes and butter together in a bowl; evenly spread into the bottom of the prepared 9x13-inch dish.\n4. Stir Cheddar-mozzarella cheese blend, onion, spinach, cottage cheese, eggs, and crumbled sausage together in a large bowl; spoon over sweet potato layer.\n5. Bake casserole in the preheated oven until a toothpick inserted in the center comes out clean and eggs are set, about 1 hour. Cool 5 minutes before serving.","whole_recipe":"Recipe Name: Sweet Potato Breakfast Casserole, \nIngredients: 1 (8 ounce) package vegetarian sausage links (such as Morningstar Farms®), 0.5 cup water, or more as needed, 4 cups shredded sweet potatoes, 0.25 cup butter, melted, 1.5 (8 ounce) packages shredded, reduced-fat mild Cheddar-mozzarella cheese blend, 0.5 cup finely chopped onion, 1 cup finely sliced fresh spinach leaves, 1 (16 ounce) container low-fat small curd cottage cheese, 8 jumbo eggs, \nCooking Instructions: 1. Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.\n2. Place sausage in a large skillet and pour in about 1\/4 inch of water; cook sausage over medium heat until water evaporates and sausages are evenly browned, 10 to 15 minutes. Crumble cooked sausages into a bowl.\n3. Mix sweet potatoes and butter together in a bowl; evenly spread into the bottom of the prepared 9x13-inch dish.\n4. Stir Cheddar-mozzarella cheese blend, onion, spinach, cottage cheese, eggs, and crumbled sausage together in a large bowl; spoon over sweet potato layer.\n5. Bake casserole in the preheated oven until a toothpick inserted in the center comes out clean and eggs are set, about 1 hour. Cool 5 minutes before serving., "}
{"recipe_name":"Spinach and Mushroom Egg Casserole","ingredients":"1 teaspoon butter, 10 eggs, 1 (16 ounce) package cottage cheese, 1 (16 ounce) package shredded Monterey Jack cheese, 0.5 cup butter, melted, 0.5 cup all-purpose flour, 1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry, 2 (4.5 ounce) cans sliced mushrooms, drained, 1 teaspoon baking powder, 0.5 teaspoon salt","instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with 1 teaspoon butter., Whisk eggs in a large bowl. Add cottage cheese, Monterey Jack cheese, 1\/2 cup melted butter, flour, spinach, mushrooms, baking powder, and salt; mix. Pour egg mixture into prepared baking dish., Bake in the preheated oven until eggs are set and a knife inserted into the center comes out clean, about 35 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with 1 teaspoon butter.\n2. Whisk eggs in a large bowl. Add cottage cheese, Monterey Jack cheese, 1\/2 cup melted butter, flour, spinach, mushrooms, baking powder, and salt; mix. Pour egg mixture into prepared baking dish.\n3. Bake in the preheated oven until eggs are set and a knife inserted into the center comes out clean, about 35 minutes.","whole_recipe":"Recipe Name: Spinach and Mushroom Egg Casserole, \nIngredients: 1 teaspoon butter, 10 eggs, 1 (16 ounce) package cottage cheese, 1 (16 ounce) package shredded Monterey Jack cheese, 0.5 cup butter, melted, 0.5 cup all-purpose flour, 1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry, 2 (4.5 ounce) cans sliced mushrooms, drained, 1 teaspoon baking powder, 0.5 teaspoon salt, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with 1 teaspoon butter.\n2. Whisk eggs in a large bowl. Add cottage cheese, Monterey Jack cheese, 1\/2 cup melted butter, flour, spinach, mushrooms, baking powder, and salt; mix. Pour egg mixture into prepared baking dish.\n3. Bake in the preheated oven until eggs are set and a knife inserted into the center comes out clean, about 35 minutes., "}
{"recipe_name":"Mom's Zucchini Bread","ingredients":"3 cups all-purpose flour, 1 teaspoon salt, 1 teaspoon baking powder, 1 teaspoon baking soda, 1 tablespoon ground cinnamon, 3 large eggs, 1 cup vegetable oil, 2.25 cups white sugar, 3 teaspoons vanilla extract, 2 cups grated zucchini, 1 cup chopped walnuts","instructions":"Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 8x4-inch pans., Sift flour, salt, baking powder, baking soda, and cinnamon together in a large bowl., Beat eggs, oil, sugar, and vanilla together in a separate large bowl with an electric mixer until combined; add flour mixture and beat well. Stir in zucchini and walnuts until well combined. Pour batter into the prepared pans., Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 to 60 minutes. Cool in the pans on a wire rack for 20 minutes. Run a table knife around the edges to loosen. Invert carefully onto a wire rack and let cool completely.","step_instructions":"1. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 8x4-inch pans.\n2. Sift flour, salt, baking powder, baking soda, and cinnamon together in a large bowl.\n3. Beat eggs, oil, sugar, and vanilla together in a separate large bowl with an electric mixer until combined; add flour mixture and beat well. Stir in zucchini and walnuts until well combined. Pour batter into the prepared pans.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 to 60 minutes. Cool in the pans on a wire rack for 20 minutes. Run a table knife around the edges to loosen. Invert carefully onto a wire rack and let cool completely.","whole_recipe":"Recipe Name: Mom's Zucchini Bread, \nIngredients: 3 cups all-purpose flour, 1 teaspoon salt, 1 teaspoon baking powder, 1 teaspoon baking soda, 1 tablespoon ground cinnamon, 3 large eggs, 1 cup vegetable oil, 2.25 cups white sugar, 3 teaspoons vanilla extract, 2 cups grated zucchini, 1 cup chopped walnuts, \nCooking Instructions: 1. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 8x4-inch pans.\n2. Sift flour, salt, baking powder, baking soda, and cinnamon together in a large bowl.\n3. Beat eggs, oil, sugar, and vanilla together in a separate large bowl with an electric mixer until combined; add flour mixture and beat well. Stir in zucchini and walnuts until well combined. Pour batter into the prepared pans.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 to 60 minutes. Cool in the pans on a wire rack for 20 minutes. Run a table knife around the edges to loosen. Invert carefully onto a wire rack and let cool completely., "}
{"recipe_name":"Breakfast Pizza I","ingredients":"1 pound ground breakfast sausage, 1 (8 ounce) package refrigerated crescent rolls, 1 cup frozen hash brown potatoes, thawed, 1 cup shredded Cheddar cheese, 5 eggs, 0.25 cup milk, 0.5 teaspoon salt, 0.125 teaspoon ground black pepper, 0.25 cup grated Parmesan cheese","instructions":"Place sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Preheat oven to 375 degrees F (190 degrees C)., Brown sausage and drain. Separate crescent roll dough into 8 triangles. Place in an ungreased 12 inch pizza pan with points toward the center. Press together to form a crust. Bottom of crust should be sealed and outside edge should be slightly raised. Spoon sausage over crust. Sprinkle with hash browns and top with cheddar cheese., Beat together eggs, milk, salt and pepper; pour over crust. Sprinkle with parmesan cheese., Bake in preheated oven until eggs are set, about 25 to 30 minutes.","step_instructions":"1. Place sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Preheat oven to 375 degrees F (190 degrees C).\n2. Brown sausage and drain. Separate crescent roll dough into 8 triangles. Place in an ungreased 12 inch pizza pan with points toward the center. Press together to form a crust. Bottom of crust should be sealed and outside edge should be slightly raised. Spoon sausage over crust. Sprinkle with hash browns and top with cheddar cheese.\n3. Beat together eggs, milk, salt and pepper; pour over crust. Sprinkle with parmesan cheese.\n4. Bake in preheated oven until eggs are set, about 25 to 30 minutes.","whole_recipe":"Recipe Name: Breakfast Pizza I, \nIngredients: 1 pound ground breakfast sausage, 1 (8 ounce) package refrigerated crescent rolls, 1 cup frozen hash brown potatoes, thawed, 1 cup shredded Cheddar cheese, 5 eggs, 0.25 cup milk, 0.5 teaspoon salt, 0.125 teaspoon ground black pepper, 0.25 cup grated Parmesan cheese, \nCooking Instructions: 1. Place sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Preheat oven to 375 degrees F (190 degrees C).\n2. Brown sausage and drain. Separate crescent roll dough into 8 triangles. Place in an ungreased 12 inch pizza pan with points toward the center. Press together to form a crust. Bottom of crust should be sealed and outside edge should be slightly raised. Spoon sausage over crust. Sprinkle with hash browns and top with cheddar cheese.\n3. Beat together eggs, milk, salt and pepper; pour over crust. Sprinkle with parmesan cheese.\n4. Bake in preheated oven until eggs are set, about 25 to 30 minutes., "}
{"recipe_name":"Corned Beef Roast","ingredients":"1 (5 1\/2 pound) corned beef brisket with spice packet, 7 small potatoes, peeled and diced, 4 medium carrots, peeled and diced, 1 medium onion, diced, 3 cloves garlic, chopped","instructions":"Preheat the oven to 300 degrees F (150 degrees C)., Place corned beef brisket in the center of a roasting pan. Arrange potatoes and carrots around the sides, then scatter onion and garlic over top. Sprinkle seasoning packet over beef, then pour in water until potatoes are almost covered. Cover with a lid or heavy aluminum foil., Roast in the preheated oven until corned beef is so tender it can be flaked apart with a fork, about 5 to 6 hours.","step_instructions":"1. Preheat the oven to 300 degrees F (150 degrees C).\n2. Place corned beef brisket in the center of a roasting pan. Arrange potatoes and carrots around the sides, then scatter onion and garlic over top. Sprinkle seasoning packet over beef, then pour in water until potatoes are almost covered. Cover with a lid or heavy aluminum foil.\n3. Roast in the preheated oven until corned beef is so tender it can be flaked apart with a fork, about 5 to 6 hours.","whole_recipe":"Recipe Name: Corned Beef Roast, \nIngredients: 1 (5 1\/2 pound) corned beef brisket with spice packet, 7 small potatoes, peeled and diced, 4 medium carrots, peeled and diced, 1 medium onion, diced, 3 cloves garlic, chopped, \nCooking Instructions: 1. Preheat the oven to 300 degrees F (150 degrees C).\n2. Place corned beef brisket in the center of a roasting pan. Arrange potatoes and carrots around the sides, then scatter onion and garlic over top. Sprinkle seasoning packet over beef, then pour in water until potatoes are almost covered. Cover with a lid or heavy aluminum foil.\n3. Roast in the preheated oven until corned beef is so tender it can be flaked apart with a fork, about 5 to 6 hours., "}
{"recipe_name":"Vegan Ube-Blueberry Ice Cream","ingredients":"1 (14 ounce) can coconut cream, chilled, 1 (14.5 ounce) package frozen ube (purple yam), 1.5 cups frozen blueberries, 1 tablespoon light agave syrup","instructions":"Pour coconut cream into a high-speed blender (such as Vitamix®). Add ube, blueberries, and agave syrup. Cover and blend for about 1 minute, starting at Variable 1 and slowly increasing to the highest speed. Use the tamper to press the ingredients toward the blades., Serve immediately for a soft-serve consistency. Store in the freezer for a firmer consistency.","step_instructions":"1. Pour coconut cream into a high-speed blender (such as Vitamix®). Add ube, blueberries, and agave syrup. Cover and blend for about 1 minute, starting at Variable 1 and slowly increasing to the highest speed. Use the tamper to press the ingredients toward the blades.\n2. Serve immediately for a soft-serve consistency. Store in the freezer for a firmer consistency.","whole_recipe":"Recipe Name: Vegan Ube-Blueberry Ice Cream, \nIngredients: 1 (14 ounce) can coconut cream, chilled, 1 (14.5 ounce) package frozen ube (purple yam), 1.5 cups frozen blueberries, 1 tablespoon light agave syrup, \nCooking Instructions: 1. Pour coconut cream into a high-speed blender (such as Vitamix®). Add ube, blueberries, and agave syrup. Cover and blend for about 1 minute, starting at Variable 1 and slowly increasing to the highest speed. Use the tamper to press the ingredients toward the blades.\n2. Serve immediately for a soft-serve consistency. Store in the freezer for a firmer consistency., "}
{"recipe_name":"Avocado Stuffed Yams","ingredients":"4 (8 ounce) yams, 1 medium red bell pepper, seeded and diced, 2 avocados - peeled, pitted, and mashed, 0.25 cup chopped fresh cilantro, 0.25 cup olive oil, 2 green onions, sliced, 0.5 teaspoon ground cumin, 3 tablespoons lime juice, salt and ground black pepper to taste, 1 cup shredded Cheddar cheese","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Place yams on a baking sheet., Bake yams for 40 minutes, or until tender, turning occasionally. Set aside., In a medium bowl, mix together the red pepper, avocado, cilantro, olive oil, green onions, cumin and lime juice., Cut yams in half lengthwise, and fluff the centers with a fork. Top with the avocado stuffing. Season with salt and pepper, and top with shredded Cheddar cheese.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Place yams on a baking sheet.\n2. Bake yams for 40 minutes, or until tender, turning occasionally. Set aside.\n3. In a medium bowl, mix together the red pepper, avocado, cilantro, olive oil, green onions, cumin and lime juice.\n4. Cut yams in half lengthwise, and fluff the centers with a fork. Top with the avocado stuffing. Season with salt and pepper, and top with shredded Cheddar cheese.","whole_recipe":"Recipe Name: Avocado Stuffed Yams, \nIngredients: 4 (8 ounce) yams, 1 medium red bell pepper, seeded and diced, 2 avocados - peeled, pitted, and mashed, 0.25 cup chopped fresh cilantro, 0.25 cup olive oil, 2 green onions, sliced, 0.5 teaspoon ground cumin, 3 tablespoons lime juice, salt and ground black pepper to taste, 1 cup shredded Cheddar cheese, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Place yams on a baking sheet.\n2. Bake yams for 40 minutes, or until tender, turning occasionally. Set aside.\n3. In a medium bowl, mix together the red pepper, avocado, cilantro, olive oil, green onions, cumin and lime juice.\n4. Cut yams in half lengthwise, and fluff the centers with a fork. Top with the avocado stuffing. Season with salt and pepper, and top with shredded Cheddar cheese., "}
{"recipe_name":"Stove Top Pot Roast","ingredients":"2 tablespoons vegetable oil, 1 (3 pound) beef chuck roast, 4 cups water, or as needed, 4 stalks celery, chopped, 4 cloves garlic, crushed, 1 red onion, chopped, 1 tablespoon dried basil, salt and pepper to taste, 6 turnips, peeled and cut into chunks, 6 medium red potatoes, quartered, 6 carrots, peeled and cut into chunks","instructions":"Heat oil in a large pot or Dutch oven over medium-high heat; add roast and quickly brown on all sides., Add enough water to the pot to cover roast; add celery, garlic, onion, basil, salt, and pepper. Bring to a boil; reduce heat to low and simmer for 2 hours and 15 minutes, adding additional water if needed to keep the roast covered., Add turnips and potatoes; simmer for an additional 15 minutes., Add carrots; simmer for 30 minutes, or until roast can be pulled apart with a fork., Season to taste with salt and pepper if needed before serving.","step_instructions":"1. Heat oil in a large pot or Dutch oven over medium-high heat; add roast and quickly brown on all sides.\n2. Add enough water to the pot to cover roast; add celery, garlic, onion, basil, salt, and pepper. Bring to a boil; reduce heat to low and simmer for 2 hours and 15 minutes, adding additional water if needed to keep the roast covered.\n3. Add turnips and potatoes; simmer for an additional 15 minutes.\n4. Add carrots; simmer for 30 minutes, or until roast can be pulled apart with a fork.\n5. Season to taste with salt and pepper if needed before serving.","whole_recipe":"Recipe Name: Stove Top Pot Roast, \nIngredients: 2 tablespoons vegetable oil, 1 (3 pound) beef chuck roast, 4 cups water, or as needed, 4 stalks celery, chopped, 4 cloves garlic, crushed, 1 red onion, chopped, 1 tablespoon dried basil, salt and pepper to taste, 6 turnips, peeled and cut into chunks, 6 medium red potatoes, quartered, 6 carrots, peeled and cut into chunks, \nCooking Instructions: 1. Heat oil in a large pot or Dutch oven over medium-high heat; add roast and quickly brown on all sides.\n2. Add enough water to the pot to cover roast; add celery, garlic, onion, basil, salt, and pepper. Bring to a boil; reduce heat to low and simmer for 2 hours and 15 minutes, adding additional water if needed to keep the roast covered.\n3. Add turnips and potatoes; simmer for an additional 15 minutes.\n4. Add carrots; simmer for 30 minutes, or until roast can be pulled apart with a fork.\n5. Season to taste with salt and pepper if needed before serving., "}
{"recipe_name":"Never Kiss a Yammy","ingredients":"4 sweet potatoes, 0.5 cup orange juice, 0.66666668653488 cup light brown sugar, 0.25 cup margarine, softened, 0.5 teaspoon freshly grated orange peel, 0.25 teaspoon ground cinnamon","instructions":"Preheat an oven to 425 degrees F (220 degrees C). Cover a cookie sheet with aluminum foil., Scrub the sweet potatoes, prick them deeply in several places with a fork, and place them on the lined cookie sheet., Bake the potatoes in the preheated oven until tender, about 45 minutes. Allow them to cool until they can be handled, about 15 minutes. Scoop out the sweet potato flesh into a large bowl and mash well. Stir in orange juice, brown sugar, margarine, orange peel, and cinnamon. If you prefer the sweet potatoes to be very smooth, you can mix them with an electric mixer. Spread the potatoes in a microwave-safe dish., Microwave on HIGH until heated through, about 5 minutes.","step_instructions":"1. Preheat an oven to 425 degrees F (220 degrees C). Cover a cookie sheet with aluminum foil.\n2. Scrub the sweet potatoes, prick them deeply in several places with a fork, and place them on the lined cookie sheet.\n3. Bake the potatoes in the preheated oven until tender, about 45 minutes. Allow them to cool until they can be handled, about 15 minutes. Scoop out the sweet potato flesh into a large bowl and mash well. Stir in orange juice, brown sugar, margarine, orange peel, and cinnamon. If you prefer the sweet potatoes to be very smooth, you can mix them with an electric mixer. Spread the potatoes in a microwave-safe dish.\n4. Microwave on HIGH until heated through, about 5 minutes.","whole_recipe":"Recipe Name: Never Kiss a Yammy, \nIngredients: 4 sweet potatoes, 0.5 cup orange juice, 0.66666668653488 cup light brown sugar, 0.25 cup margarine, softened, 0.5 teaspoon freshly grated orange peel, 0.25 teaspoon ground cinnamon, \nCooking Instructions: 1. Preheat an oven to 425 degrees F (220 degrees C). Cover a cookie sheet with aluminum foil.\n2. Scrub the sweet potatoes, prick them deeply in several places with a fork, and place them on the lined cookie sheet.\n3. Bake the potatoes in the preheated oven until tender, about 45 minutes. Allow them to cool until they can be handled, about 15 minutes. Scoop out the sweet potato flesh into a large bowl and mash well. Stir in orange juice, brown sugar, margarine, orange peel, and cinnamon. If you prefer the sweet potatoes to be very smooth, you can mix them with an electric mixer. Spread the potatoes in a microwave-safe dish.\n4. Microwave on HIGH until heated through, about 5 minutes., "}
{"recipe_name":"Pork Steak and Candied Yam Bake","ingredients":"cooking spray, 6 (1\/2 inch thick) boneless pork chops, salt and ground black pepper to taste, 2 tablespoons vegetable oil, 6 tablespoons brown sugar, not packed, 0.66666668653488 cup butter, 1 cup apricot preserves, 0.75 teaspoon ground cinnamon, 0.75 teaspoon ground nutmeg, 0.25 teaspoon ground ginger, 1.5 teaspoons vanilla extract, 0.25 cup chopped pecans, 2 (15 ounce) cans cut yams, drained (reserve liquid)","instructions":"Preheat the oven to 375 degrees F (190 degrees C)., Line a 9x13-inch baking dish with aluminum foil and spray with cooking spray., Season pork chops with salt and black pepper., Heat vegetable oil in a large skillet over medium heat. Cook pork chops until browned on both sides, 7 to 10 minutes. Drain pork chops on a paper towel-lined plate., Heat brown sugar, butter, apricot preserves, cinnamon, nutmeg, ginger, vanilla extract, and pecans in a saucepan over medium-low heat until sugar has dissolved and sauce is thickened, about 5 minutes. Season with salt and pepper. If sauce because too thick, stir in reserved yam liquid., Stir in yams until well coated., Transfer pork chops to the prepared baking dish., Spoon yam mixture on top of the pork chops., Bake in the preheated oven until pork chops no longer pink in the center, 30 to 45 minutes. Allow pork chops to rest for 10 minutes before serving.","step_instructions":"1. Preheat the oven to 375 degrees F (190 degrees C).\n2. Line a 9x13-inch baking dish with aluminum foil and spray with cooking spray.\n3. Season pork chops with salt and black pepper.\n4. Heat vegetable oil in a large skillet over medium heat. Cook pork chops until browned on both sides, 7 to 10 minutes. Drain pork chops on a paper towel-lined plate.\n5. Heat brown sugar, butter, apricot preserves, cinnamon, nutmeg, ginger, vanilla extract, and pecans in a saucepan over medium-low heat until sugar has dissolved and sauce is thickened, about 5 minutes. Season with salt and pepper. If sauce because too thick, stir in reserved yam liquid.\n6. Stir in yams until well coated.\n7. Transfer pork chops to the prepared baking dish.\n8. Spoon yam mixture on top of the pork chops.\n9. Bake in the preheated oven until pork chops no longer pink in the center, 30 to 45 minutes. Allow pork chops to rest for 10 minutes before serving.","whole_recipe":"Recipe Name: Pork Steak and Candied Yam Bake, \nIngredients: cooking spray, 6 (1\/2 inch thick) boneless pork chops, salt and ground black pepper to taste, 2 tablespoons vegetable oil, 6 tablespoons brown sugar, not packed, 0.66666668653488 cup butter, 1 cup apricot preserves, 0.75 teaspoon ground cinnamon, 0.75 teaspoon ground nutmeg, 0.25 teaspoon ground ginger, 1.5 teaspoons vanilla extract, 0.25 cup chopped pecans, 2 (15 ounce) cans cut yams, drained (reserve liquid), \nCooking Instructions: 1. Preheat the oven to 375 degrees F (190 degrees C).\n2. Line a 9x13-inch baking dish with aluminum foil and spray with cooking spray.\n3. Season pork chops with salt and black pepper.\n4. Heat vegetable oil in a large skillet over medium heat. Cook pork chops until browned on both sides, 7 to 10 minutes. Drain pork chops on a paper towel-lined plate.\n5. Heat brown sugar, butter, apricot preserves, cinnamon, nutmeg, ginger, vanilla extract, and pecans in a saucepan over medium-low heat until sugar has dissolved and sauce is thickened, about 5 minutes. Season with salt and pepper. If sauce because too thick, stir in reserved yam liquid.\n6. Stir in yams until well coated.\n7. Transfer pork chops to the prepared baking dish.\n8. Spoon yam mixture on top of the pork chops.\n9. Bake in the preheated oven until pork chops no longer pink in the center, 30 to 45 minutes. Allow pork chops to rest for 10 minutes before serving., "}
{"recipe_name":"Island Yam Bake","ingredients":"2.5 pounds yams, peeled and cubed, 1 cup pineapple and orange juice blend, 2 tablespoons softened butter, 0.5 cup (packed) dark brown sugar, 0.5 cup chopped macadamia nuts","instructions":"Place yams into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two., Preheat oven to 325 degrees F (165 degrees C)., Return yams to the cooking pot, and mash with juice until smooth. Pack mashed yams into a 3 quart casserole dish, dot with butter, then sprinkle with brown sugar and nuts. Loosely cover with aluminum foil., Bake in preheated oven until hot and bubbly, 35 to 40 minutes.","step_instructions":"1. Place yams into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\n2. Preheat oven to 325 degrees F (165 degrees C).\n3. Return yams to the cooking pot, and mash with juice until smooth. Pack mashed yams into a 3 quart casserole dish, dot with butter, then sprinkle with brown sugar and nuts. Loosely cover with aluminum foil.\n4. Bake in preheated oven until hot and bubbly, 35 to 40 minutes.","whole_recipe":"Recipe Name: Island Yam Bake, \nIngredients: 2.5 pounds yams, peeled and cubed, 1 cup pineapple and orange juice blend, 2 tablespoons softened butter, 0.5 cup (packed) dark brown sugar, 0.5 cup chopped macadamia nuts, \nCooking Instructions: 1. Place yams into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\n2. Preheat oven to 325 degrees F (165 degrees C).\n3. Return yams to the cooking pot, and mash with juice until smooth. Pack mashed yams into a 3 quart casserole dish, dot with butter, then sprinkle with brown sugar and nuts. Loosely cover with aluminum foil.\n4. Bake in preheated oven until hot and bubbly, 35 to 40 minutes., "}
{"recipe_name":"Quinoa Salad with Roasted Yams","ingredients":"1.5 cups diced yams, 3 cups water, 2 cups quinoa, soaked and rinsed, 4 Persian cucumbers - peeled, trimmed, and cut into 1\/4-inch cubes, 1 cup chopped Italian parsley, 0.25 cup extra-virgin olive oil, 0.25 cup 1\/4-inch cubed onion, 1 lemon, juiced, 2 tablespoons red wine vinegar, salt and ground black pepper to taste, 5 endive spears to garnish","instructions":"Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; add yams., Bake in the preheated oven until yams are tender and wrinkled at the edges, about 20 minutes. Cool to room temperature, about 15 minutes, Bring water to a boil in a large saucepan. Add quinoa, stirring once; return to boil. Cook uncovered until water is absorbed, 10 to 12 minutes. Strain, shaking the sieve well to remove all moisture. Transfer to a mixing bowl., Stir cucumbers, yams, parsley, olive oil, onion, lemon juice, red wine vinegar, salt, and pepper into the quinoa. Garnish with endive spears.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; add yams.\n2. Bake in the preheated oven until yams are tender and wrinkled at the edges, about 20 minutes. Cool to room temperature, about 15 minutes\n3. Bring water to a boil in a large saucepan. Add quinoa, stirring once; return to boil. Cook uncovered until water is absorbed, 10 to 12 minutes. Strain, shaking the sieve well to remove all moisture. Transfer to a mixing bowl.\n4. Stir cucumbers, yams, parsley, olive oil, onion, lemon juice, red wine vinegar, salt, and pepper into the quinoa. Garnish with endive spears.","whole_recipe":"Recipe Name: Quinoa Salad with Roasted Yams, \nIngredients: 1.5 cups diced yams, 3 cups water, 2 cups quinoa, soaked and rinsed, 4 Persian cucumbers - peeled, trimmed, and cut into 1\/4-inch cubes, 1 cup chopped Italian parsley, 0.25 cup extra-virgin olive oil, 0.25 cup 1\/4-inch cubed onion, 1 lemon, juiced, 2 tablespoons red wine vinegar, salt and ground black pepper to taste, 5 endive spears to garnish, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; add yams.\n2. Bake in the preheated oven until yams are tender and wrinkled at the edges, about 20 minutes. Cool to room temperature, about 15 minutes\n3. Bring water to a boil in a large saucepan. Add quinoa, stirring once; return to boil. Cook uncovered until water is absorbed, 10 to 12 minutes. Strain, shaking the sieve well to remove all moisture. Transfer to a mixing bowl.\n4. Stir cucumbers, yams, parsley, olive oil, onion, lemon juice, red wine vinegar, salt, and pepper into the quinoa. Garnish with endive spears., "}
{"recipe_name":"Falafel Hash","ingredients":"3 tablespoons extra-virgin olive oil, 1 onion, chopped, 8 mushrooms, halved and sliced, 4 garlic cloves, minced, 1 yam, peeled and cubed, 2 teaspoons ground cumin, 2 teaspoons ground coriander, 1 teaspoon onion (nigella) seeds, 1 teaspoon black mustard seeds, 1 teaspoon chile powder, 1 teaspoon paprika, 1 teaspoon ground turmeric, 0.5 head cauliflower, chopped, 1 (15 ounce) can chickpeas, drained, 0.5 teaspoon salt, ground black pepper to taste, 0.75 cup vegetable stock, 1 tablespoon tomato paste, 3 cups fresh spinach, coarsely chopped, 1 bunch fresh parsley, finely chopped, 1 lemon, juiced, 1 lime, juiced","instructions":"Heat oil in a large flat-sided skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add mushrooms and garlic; cook and stir until softened, about 2 minutes. Add yam and cook for 2 minutes., Stir cumin, coriander, onion seeds, black mustard seeds, chile powder, paprika, and turmeric into the skillet; cook and stir until evenly distributed, about 2 minutes. Add cauliflower, chickpeas, salt, and black pepper; stir until combined., Mix vegetable stock and tomato paste together in a small bowl; pour into the skillet. Cover and cook until yam is tender, about 15 minutes. Stir in spinach, parsley, lemon juice, and lime juice and cook until flavors combine, about 1 minute.","step_instructions":"1. Heat oil in a large flat-sided skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add mushrooms and garlic; cook and stir until softened, about 2 minutes. Add yam and cook for 2 minutes.\n2. Stir cumin, coriander, onion seeds, black mustard seeds, chile powder, paprika, and turmeric into the skillet; cook and stir until evenly distributed, about 2 minutes. Add cauliflower, chickpeas, salt, and black pepper; stir until combined.\n3. Mix vegetable stock and tomato paste together in a small bowl; pour into the skillet. Cover and cook until yam is tender, about 15 minutes. Stir in spinach, parsley, lemon juice, and lime juice and cook until flavors combine, about 1 minute.","whole_recipe":"Recipe Name: Falafel Hash, \nIngredients: 3 tablespoons extra-virgin olive oil, 1 onion, chopped, 8 mushrooms, halved and sliced, 4 garlic cloves, minced, 1 yam, peeled and cubed, 2 teaspoons ground cumin, 2 teaspoons ground coriander, 1 teaspoon onion (nigella) seeds, 1 teaspoon black mustard seeds, 1 teaspoon chile powder, 1 teaspoon paprika, 1 teaspoon ground turmeric, 0.5 head cauliflower, chopped, 1 (15 ounce) can chickpeas, drained, 0.5 teaspoon salt, ground black pepper to taste, 0.75 cup vegetable stock, 1 tablespoon tomato paste, 3 cups fresh spinach, coarsely chopped, 1 bunch fresh parsley, finely chopped, 1 lemon, juiced, 1 lime, juiced, \nCooking Instructions: 1. Heat oil in a large flat-sided skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add mushrooms and garlic; cook and stir until softened, about 2 minutes. Add yam and cook for 2 minutes.\n2. Stir cumin, coriander, onion seeds, black mustard seeds, chile powder, paprika, and turmeric into the skillet; cook and stir until evenly distributed, about 2 minutes. Add cauliflower, chickpeas, salt, and black pepper; stir until combined.\n3. Mix vegetable stock and tomato paste together in a small bowl; pour into the skillet. Cover and cook until yam is tender, about 15 minutes. Stir in spinach, parsley, lemon juice, and lime juice and cook until flavors combine, about 1 minute., "}
{"recipe_name":"Apple Yam Casserole","ingredients":"3 sweet potatoes, peeled and cubed, 2 Granny Smith apples - peeled, cored and sliced, 0.5 cup packed brown sugar, 0.5 cup water, 0.25 teaspoon ground cinnamon, 0.5 cup raisins, 2 tablespoons butter, 0.25 teaspoon salt, 3 tablespoons all-purpose flour, 3 slices lemon, thinly sliced","instructions":"Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish., In the casserole dish, alternately layer the sweet potatoes and apples., In a medium saucepan over medium heat, mix together brown sugar, 1\/3 cup water, cinnamon, raisins, butter and salt. Cook 5 minutes., In a small bowl, stir together remaining water and flour. Combine with the brown sugar mixture. Pour over the sweet potatoes and apples. Place the lemon slices on top., Bake covered in the preheated oven 20 minutes. Uncover and continue baking 20 minutes, or until the sweet potatoes and apples are tender.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish.\n2. In the casserole dish, alternately layer the sweet potatoes and apples.\n3. In a medium saucepan over medium heat, mix together brown sugar, 1\/3 cup water, cinnamon, raisins, butter and salt. Cook 5 minutes.\n4. In a small bowl, stir together remaining water and flour. Combine with the brown sugar mixture. Pour over the sweet potatoes and apples. Place the lemon slices on top.\n5. Bake covered in the preheated oven 20 minutes. Uncover and continue baking 20 minutes, or until the sweet potatoes and apples are tender.","whole_recipe":"Recipe Name: Apple Yam Casserole, \nIngredients: 3 sweet potatoes, peeled and cubed, 2 Granny Smith apples - peeled, cored and sliced, 0.5 cup packed brown sugar, 0.5 cup water, 0.25 teaspoon ground cinnamon, 0.5 cup raisins, 2 tablespoons butter, 0.25 teaspoon salt, 3 tablespoons all-purpose flour, 3 slices lemon, thinly sliced, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish.\n2. In the casserole dish, alternately layer the sweet potatoes and apples.\n3. In a medium saucepan over medium heat, mix together brown sugar, 1\/3 cup water, cinnamon, raisins, butter and salt. Cook 5 minutes.\n4. In a small bowl, stir together remaining water and flour. Combine with the brown sugar mixture. Pour over the sweet potatoes and apples. Place the lemon slices on top.\n5. Bake covered in the preheated oven 20 minutes. Uncover and continue baking 20 minutes, or until the sweet potatoes and apples are tender., "}
{"recipe_name":"Purple Sweet Potato Whole Wheat Bun","ingredients":"2.25 cups bread flour, 1.5 cups cooked and mashed purple sweet potatoes, 0.75 cup whole wheat flour, 0.75 cup cake flour, 2 eggs, 6 tablespoons brown sugar, 0.33333334326744 cup water, or more as needed, 5.5 tablespoons butter, melted, 2 tablespoons milk powder, 2.5 teaspoons instant dry yeast, 0.5 teaspoon salt","instructions":"Mix bread flour, sweet potatoes, whole wheat flour, cake flour, eggs, brown sugar, water, butter, milk powder, yeast, and salt together in a bowl until dough holds together, adding more water if dough is too dry. Transfer dough to a floured surface and knead until smooth and elastic, 6 to 8 minutes., Place dough in an oiled bowl and cover with plastic wrap or a damp towel. Place bowl in a warm place and let sit until doubled in size, about 1 hour., Punch dough down and cut into 16 pieces, rolling them into balls. Place dough balls on oiled baking sheets, cover, and let rise until doubled in size, about 40 minutes., Preheat oven to 350 degrees F (175 degrees C). Remove cover from dough., Bake in the preheated oven until golden brown on top, 12 to 15 minutes.","step_instructions":"1. Mix bread flour, sweet potatoes, whole wheat flour, cake flour, eggs, brown sugar, water, butter, milk powder, yeast, and salt together in a bowl until dough holds together, adding more water if dough is too dry. Transfer dough to a floured surface and knead until smooth and elastic, 6 to 8 minutes.\n2. Place dough in an oiled bowl and cover with plastic wrap or a damp towel. Place bowl in a warm place and let sit until doubled in size, about 1 hour.\n3. Punch dough down and cut into 16 pieces, rolling them into balls. Place dough balls on oiled baking sheets, cover, and let rise until doubled in size, about 40 minutes.\n4. Preheat oven to 350 degrees F (175 degrees C). Remove cover from dough.\n5. Bake in the preheated oven until golden brown on top, 12 to 15 minutes.","whole_recipe":"Recipe Name: Purple Sweet Potato Whole Wheat Bun, \nIngredients: 2.25 cups bread flour, 1.5 cups cooked and mashed purple sweet potatoes, 0.75 cup whole wheat flour, 0.75 cup cake flour, 2 eggs, 6 tablespoons brown sugar, 0.33333334326744 cup water, or more as needed, 5.5 tablespoons butter, melted, 2 tablespoons milk powder, 2.5 teaspoons instant dry yeast, 0.5 teaspoon salt, \nCooking Instructions: 1. Mix bread flour, sweet potatoes, whole wheat flour, cake flour, eggs, brown sugar, water, butter, milk powder, yeast, and salt together in a bowl until dough holds together, adding more water if dough is too dry. Transfer dough to a floured surface and knead until smooth and elastic, 6 to 8 minutes.\n2. Place dough in an oiled bowl and cover with plastic wrap or a damp towel. Place bowl in a warm place and let sit until doubled in size, about 1 hour.\n3. Punch dough down and cut into 16 pieces, rolling them into balls. Place dough balls on oiled baking sheets, cover, and let rise until doubled in size, about 40 minutes.\n4. Preheat oven to 350 degrees F (175 degrees C). Remove cover from dough.\n5. Bake in the preheated oven until golden brown on top, 12 to 15 minutes., "}
{"recipe_name":"Yam Casserole","ingredients":"1 (29 ounce) can yams, drained and mashed, 0.25 cup melted butter, 0.5 cup white sugar, 0.5 cup evaporated milk, 2 eggs, beaten, 0.5 teaspoon nutmeg, 0.5 teaspoon ground cinnamon, 1 teaspoon vanilla extract, 0.25 cup butter, softened, 0.5 cup brown sugar, 0.5 cup chopped walnuts, 1 cup sugar frosted corn flake cereal","instructions":"Preheat oven to 350 degrees F (175 degrees C)., In a large bowl combine yams, melted butter, white sugar, evaporated milk, eggs, nutmeg, cinnamon and vanilla extract. Mix well and transfer to a 9x9 inch casserole dish., In a medium bowl cream butter with brown sugar. Stir in walnuts and frosted cereal. Spread on top of yam mixture., Bake in preheated oven for 35 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C).\n2. In a large bowl combine yams, melted butter, white sugar, evaporated milk, eggs, nutmeg, cinnamon and vanilla extract. Mix well and transfer to a 9x9 inch casserole dish.\n3. In a medium bowl cream butter with brown sugar. Stir in walnuts and frosted cereal. Spread on top of yam mixture.\n4. Bake in preheated oven for 35 minutes.","whole_recipe":"Recipe Name: Yam Casserole, \nIngredients: 1 (29 ounce) can yams, drained and mashed, 0.25 cup melted butter, 0.5 cup white sugar, 0.5 cup evaporated milk, 2 eggs, beaten, 0.5 teaspoon nutmeg, 0.5 teaspoon ground cinnamon, 1 teaspoon vanilla extract, 0.25 cup butter, softened, 0.5 cup brown sugar, 0.5 cup chopped walnuts, 1 cup sugar frosted corn flake cereal, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C).\n2. In a large bowl combine yams, melted butter, white sugar, evaporated milk, eggs, nutmeg, cinnamon and vanilla extract. Mix well and transfer to a 9x9 inch casserole dish.\n3. In a medium bowl cream butter with brown sugar. Stir in walnuts and frosted cereal. Spread on top of yam mixture.\n4. Bake in preheated oven for 35 minutes., "}
{"recipe_name":"Chipotle Garnet Yams","ingredients":"4 large garnet yams, 2 chipotle chiles in adobo sauce, finely chopped, 0.25 cup softened butter, 0.25 cup brown sugar, 0.25 cup heavy cream, or as needed, salt and freshly ground black pepper to taste","instructions":"Preheat an oven to 350 degrees F (175 degrees C)., Place yams onto a baking sheet, and bake in the preheated oven until very soft, about 1 hour. Once done, allow to cool, then peel and place into a mixing bowl. Mash the chipotle chiles into a paste, and add to the potatoes along with the butter, brown sugar, and heavy cream. Mash until smooth, then season to taste with salt and pepper. Spread the potatoes into a shallow baking dish., Bake in the preheated oven until heated through, 20 to 25 minutes.","step_instructions":"1. Preheat an oven to 350 degrees F (175 degrees C).\n2. Place yams onto a baking sheet, and bake in the preheated oven until very soft, about 1 hour. Once done, allow to cool, then peel and place into a mixing bowl. Mash the chipotle chiles into a paste, and add to the potatoes along with the butter, brown sugar, and heavy cream. Mash until smooth, then season to taste with salt and pepper. Spread the potatoes into a shallow baking dish.\n3. Bake in the preheated oven until heated through, 20 to 25 minutes.","whole_recipe":"Recipe Name: Chipotle Garnet Yams, \nIngredients: 4 large garnet yams, 2 chipotle chiles in adobo sauce, finely chopped, 0.25 cup softened butter, 0.25 cup brown sugar, 0.25 cup heavy cream, or as needed, salt and freshly ground black pepper to taste, \nCooking Instructions: 1. Preheat an oven to 350 degrees F (175 degrees C).\n2. Place yams onto a baking sheet, and bake in the preheated oven until very soft, about 1 hour. Once done, allow to cool, then peel and place into a mixing bowl. Mash the chipotle chiles into a paste, and add to the potatoes along with the butter, brown sugar, and heavy cream. Mash until smooth, then season to taste with salt and pepper. Spread the potatoes into a shallow baking dish.\n3. Bake in the preheated oven until heated through, 20 to 25 minutes., "}
{"recipe_name":"Instant Pot Shepherd's Pie with Potatoes and Yams","ingredients":"1 cup low-sodium chicken broth, 1 large yam, chopped, 1 large russet potato, chopped, 1 teaspoon Himalayan pink salt, 0.5 cup milk, 3 tablespoons butter, 1 tablespoon vegetable oil, 0.5 onion, chopped, 2 cloves garlic, mashed, 1.125 pounds ground beef, salt and ground black pepper to taste, 6 mushrooms, sliced, 1 cup frozen corn, 1 cup frozen green peas, 1 crown broccoli, diced, 1 carrot, chopped, 1 stalk celery, chopped, 1 (.87 ounce) package low-sodium gravy mix, 1 tablespoon water, or as needed, 0.5 cup shredded Cheddar cheese","instructions":"Pour chicken broth into a multi-functional electric pressure cooker. Place a steamer rack into the pot. Add yam and potato; sprinkle pink salt on top. Close and lock the lid. Turn the valve to Seal. Select high pressure according to manufacturer's instructions; set timer for 8 minutes. Allow 10 to 15 minutes for pressure to build., Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Remove yam, potato, and rack. Strain liquid into a glass measuring cup and reserve. Return yam and potato to pot. Add milk and butter; mash using a potato masher until smooth. Scrape mashed potato topping into a bowl using a silicone spatula., Preheat the oven to 350 degrees F (175 degrees C)., Select Saute function on the pressure cooker. Heat oil on high mode. Add onion and garlic; saute until slightly tender, 1 to 2 minutes. Add ground beef, salt, and pepper. Cook and stir until filling is well combined, 2 to 3 minutes. Add mushrooms; saute until starting to soften, about 1 minute., Stir corn, peas, broccoli, carrot, and celery into the pot with the filling. Pour in reserved potato liquid. Close and lock the lid. Set pot to Manual function. Select low pressure according to manufacturer's instructions; set timer for 3 minutes. Allow 5 to 10 minutes for pressure to build., Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Strain out excess liquid and discard; return filling to pot. Set pot to Saute mode., Dissolve gravy mix in just enough water to dissolve the powder; add to the filling in the pot. Cook and stir until gravy thickens, about 2 minutes. Transfer filling to a baking dish and cover with the mashed topping. Sprinkle Cheddar cheese on top., Bake in the preheated oven until cheese is melted, about 10 minutes., Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Broil shepherd's pie until top is browned, 3 to 5 minutes. Let sit for 5 minutes before serving.","step_instructions":"1. Pour chicken broth into a multi-functional electric pressure cooker. Place a steamer rack into the pot. Add yam and potato; sprinkle pink salt on top. Close and lock the lid. Turn the valve to Seal. Select high pressure according to manufacturer's instructions; set timer for 8 minutes. Allow 10 to 15 minutes for pressure to build.\n2. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Remove yam, potato, and rack. Strain liquid into a glass measuring cup and reserve. Return yam and potato to pot. Add milk and butter; mash using a potato masher until smooth. Scrape mashed potato topping into a bowl using a silicone spatula.\n3. Preheat the oven to 350 degrees F (175 degrees C).\n4. Select Saute function on the pressure cooker. Heat oil on high mode. Add onion and garlic; saute until slightly tender, 1 to 2 minutes. Add ground beef, salt, and pepper. Cook and stir until filling is well combined, 2 to 3 minutes. Add mushrooms; saute until starting to soften, about 1 minute.\n5. Stir corn, peas, broccoli, carrot, and celery into the pot with the filling. Pour in reserved potato liquid. Close and lock the lid. Set pot to Manual function. Select low pressure according to manufacturer's instructions; set timer for 3 minutes. Allow 5 to 10 minutes for pressure to build.\n6. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Strain out excess liquid and discard; return filling to pot. Set pot to Saute mode.\n7. Dissolve gravy mix in just enough water to dissolve the powder; add to the filling in the pot. Cook and stir until gravy thickens, about 2 minutes. Transfer filling to a baking dish and cover with the mashed topping. Sprinkle Cheddar cheese on top.\n8. Bake in the preheated oven until cheese is melted, about 10 minutes.\n9. Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Broil shepherd's pie until top is browned, 3 to 5 minutes. Let sit for 5 minutes before serving.","whole_recipe":"Recipe Name: Instant Pot Shepherd's Pie with Potatoes and Yams, \nIngredients: 1 cup low-sodium chicken broth, 1 large yam, chopped, 1 large russet potato, chopped, 1 teaspoon Himalayan pink salt, 0.5 cup milk, 3 tablespoons butter, 1 tablespoon vegetable oil, 0.5 onion, chopped, 2 cloves garlic, mashed, 1.125 pounds ground beef, salt and ground black pepper to taste, 6 mushrooms, sliced, 1 cup frozen corn, 1 cup frozen green peas, 1 crown broccoli, diced, 1 carrot, chopped, 1 stalk celery, chopped, 1 (.87 ounce) package low-sodium gravy mix, 1 tablespoon water, or as needed, 0.5 cup shredded Cheddar cheese, \nCooking Instructions: 1. Pour chicken broth into a multi-functional electric pressure cooker. Place a steamer rack into the pot. Add yam and potato; sprinkle pink salt on top. Close and lock the lid. Turn the valve to Seal. Select high pressure according to manufacturer's instructions; set timer for 8 minutes. Allow 10 to 15 minutes for pressure to build.\n2. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Remove yam, potato, and rack. Strain liquid into a glass measuring cup and reserve. Return yam and potato to pot. Add milk and butter; mash using a potato masher until smooth. Scrape mashed potato topping into a bowl using a silicone spatula.\n3. Preheat the oven to 350 degrees F (175 degrees C).\n4. Select Saute function on the pressure cooker. Heat oil on high mode. Add onion and garlic; saute until slightly tender, 1 to 2 minutes. Add ground beef, salt, and pepper. Cook and stir until filling is well combined, 2 to 3 minutes. Add mushrooms; saute until starting to soften, about 1 minute.\n5. Stir corn, peas, broccoli, carrot, and celery into the pot with the filling. Pour in reserved potato liquid. Close and lock the lid. Set pot to Manual function. Select low pressure according to manufacturer's instructions; set timer for 3 minutes. Allow 5 to 10 minutes for pressure to build.\n6. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove lid. Strain out excess liquid and discard; return filling to pot. Set pot to Saute mode.\n7. Dissolve gravy mix in just enough water to dissolve the powder; add to the filling in the pot. Cook and stir until gravy thickens, about 2 minutes. Transfer filling to a baking dish and cover with the mashed topping. Sprinkle Cheddar cheese on top.\n8. Bake in the preheated oven until cheese is melted, about 10 minutes.\n9. Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Broil shepherd's pie until top is browned, 3 to 5 minutes. Let sit for 5 minutes before serving., "}
{"recipe_name":"Coconut, Yam, and Leek Soup","ingredients":"1 tablespoon coconut oil, 2 yams, peeled and cubed, 1 large carrot, sliced 1\/4-inch thick, 1 large leek, thinly sliced, 1 clove garlic, minced, 2 teaspoons ground cumin, 1 teaspoon ground coriander, 1 Meyer lemon, juiced, 1 (32 fluid ounce) container vegetable broth, 1 (14 ounce) can coconut milk, 1 pinch kosher salt to taste, 1 cup chopped fresh spinach, or more to taste","instructions":"Heat coconut oil in a large pot over medium-high heat. Add yams; stir to coat with oil. Cook until lightly browned, about 2 minutes per side. Add carrot; cook and stir for 1 minute. Stir in leek and garlic; cook until fragrant, about 1 minute. Add cumin and coriander; stir until evenly distributed., Pour lemon juice, vegetable broth, and coconut milk into the pot; stir to combine. Bring soup to a gentle boil; reduce heat and simmer, covered, until carrots are tender, about 15 minutes. Season with salt., Ladle soup into serving bowls and garnish with fresh spinach.","step_instructions":"1. Heat coconut oil in a large pot over medium-high heat. Add yams; stir to coat with oil. Cook until lightly browned, about 2 minutes per side. Add carrot; cook and stir for 1 minute. Stir in leek and garlic; cook until fragrant, about 1 minute. Add cumin and coriander; stir until evenly distributed.\n2. Pour lemon juice, vegetable broth, and coconut milk into the pot; stir to combine. Bring soup to a gentle boil; reduce heat and simmer, covered, until carrots are tender, about 15 minutes. Season with salt.\n3. Ladle soup into serving bowls and garnish with fresh spinach.","whole_recipe":"Recipe Name: Coconut, Yam, and Leek Soup, \nIngredients: 1 tablespoon coconut oil, 2 yams, peeled and cubed, 1 large carrot, sliced 1\/4-inch thick, 1 large leek, thinly sliced, 1 clove garlic, minced, 2 teaspoons ground cumin, 1 teaspoon ground coriander, 1 Meyer lemon, juiced, 1 (32 fluid ounce) container vegetable broth, 1 (14 ounce) can coconut milk, 1 pinch kosher salt to taste, 1 cup chopped fresh spinach, or more to taste, \nCooking Instructions: 1. Heat coconut oil in a large pot over medium-high heat. Add yams; stir to coat with oil. Cook until lightly browned, about 2 minutes per side. Add carrot; cook and stir for 1 minute. Stir in leek and garlic; cook until fragrant, about 1 minute. Add cumin and coriander; stir until evenly distributed.\n2. Pour lemon juice, vegetable broth, and coconut milk into the pot; stir to combine. Bring soup to a gentle boil; reduce heat and simmer, covered, until carrots are tender, about 15 minutes. Season with salt.\n3. Ladle soup into serving bowls and garnish with fresh spinach., "}
{"recipe_name":"Louisiana Yam-Apple Medley","ingredients":"2 (16 ounce) cans sliced yams, undrained, 1 (20 ounce) can sliced apples, undrained, 0.5 cup chopped pecans, 0.25 cup packed brown sugar, 0.5 teaspoon ground cinnamon, 2 tablespoons margarine, melted","instructions":"Preheat an oven to 375 degrees F (190 degrees C)., Mix the yams and apples, and place into the bottom of a 2-quart casserole dish. Stir the pecans, sugar, and cinnamon together in a bowl; scatter over the yams and apples. Drizzle the margarine over the mixture., Bake in the preheated oven until the topping begins to brown, basting 1 or 2 times while cooking, about 20 minutes.","step_instructions":"1. Preheat an oven to 375 degrees F (190 degrees C).\n2. Mix the yams and apples, and place into the bottom of a 2-quart casserole dish. Stir the pecans, sugar, and cinnamon together in a bowl; scatter over the yams and apples. Drizzle the margarine over the mixture.\n3. Bake in the preheated oven until the topping begins to brown, basting 1 or 2 times while cooking, about 20 minutes.","whole_recipe":"Recipe Name: Louisiana Yam-Apple Medley, \nIngredients: 2 (16 ounce) cans sliced yams, undrained, 1 (20 ounce) can sliced apples, undrained, 0.5 cup chopped pecans, 0.25 cup packed brown sugar, 0.5 teaspoon ground cinnamon, 2 tablespoons margarine, melted, \nCooking Instructions: 1. Preheat an oven to 375 degrees F (190 degrees C).\n2. Mix the yams and apples, and place into the bottom of a 2-quart casserole dish. Stir the pecans, sugar, and cinnamon together in a bowl; scatter over the yams and apples. Drizzle the margarine over the mixture.\n3. Bake in the preheated oven until the topping begins to brown, basting 1 or 2 times while cooking, about 20 minutes., "}
{"recipe_name":"Powerhouse African Yam Stew","ingredients":"2 cups yellow split peas, 5 yams, peeled and diced, 3 sweet onion (such as Vidalia®), chopped, 1 cup red lentils, water to cover, 3 cloves garlic, minced, 1 tablespoon minced ginger, 0.5 cup peanut butter, 0.5 cup lemon juice, 2 tablespoons soy sauce, 1 (19 ounce) can chickpeas, drained, 2 cups frozen spinach, salt to taste","instructions":"Place split peas in a large container and cover with several inches of cool water; let soak for 1 hour., Combine drained split peas, yams, onions, and red lentils in a large pot. Pour in enough water to cover by 1 inch. Stir in garlic and ginger. Bring to a boil; skim foam off the top with a slotted spoon. Simmer until yams are very tender, about 1 hour 30 minutes., Mash split peas, yams, and lentils with a potato masher. Stir peanut butter, lemon juice, and soy sauce into the soup. Add chickpeas and frozen spinach; cook until warmed through, 8 to 10 minutes. Season with salt.","step_instructions":"1. Place split peas in a large container and cover with several inches of cool water; let soak for 1 hour.\n2. Combine drained split peas, yams, onions, and red lentils in a large pot. Pour in enough water to cover by 1 inch. Stir in garlic and ginger. Bring to a boil; skim foam off the top with a slotted spoon. Simmer until yams are very tender, about 1 hour 30 minutes.\n3. Mash split peas, yams, and lentils with a potato masher. Stir peanut butter, lemon juice, and soy sauce into the soup. Add chickpeas and frozen spinach; cook until warmed through, 8 to 10 minutes. Season with salt.","whole_recipe":"Recipe Name: Powerhouse African Yam Stew, \nIngredients: 2 cups yellow split peas, 5 yams, peeled and diced, 3 sweet onion (such as Vidalia®), chopped, 1 cup red lentils, water to cover, 3 cloves garlic, minced, 1 tablespoon minced ginger, 0.5 cup peanut butter, 0.5 cup lemon juice, 2 tablespoons soy sauce, 1 (19 ounce) can chickpeas, drained, 2 cups frozen spinach, salt to taste, \nCooking Instructions: 1. Place split peas in a large container and cover with several inches of cool water; let soak for 1 hour.\n2. Combine drained split peas, yams, onions, and red lentils in a large pot. Pour in enough water to cover by 1 inch. Stir in garlic and ginger. Bring to a boil; skim foam off the top with a slotted spoon. Simmer until yams are very tender, about 1 hour 30 minutes.\n3. Mash split peas, yams, and lentils with a potato masher. Stir peanut butter, lemon juice, and soy sauce into the soup. Add chickpeas and frozen spinach; cook until warmed through, 8 to 10 minutes. Season with salt., "}
{"recipe_name":"Finnish Pulla","ingredients":"2 cups milk, 0.5 cup warm water (110 degrees F\/45 degrees C), 1 (.25 ounce) package active dry yeast, 1 cup white sugar, 4 large eggs, beaten, 1 teaspoon salt, 1 teaspoon ground cardamom, 9 cups all-purpose flour, 0.5 cup butter, melted, 1 large egg, 1 tablespoon water, 2 tablespoons white sugar","instructions":"Warm milk in a small saucepan over medium heat until it bubbles, then remove from heat. Let cool until lukewarm., Stir together warm water and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes., Stir lukewarm milk, sugar, 4 beaten eggs, salt, and cardamom into yeast mixture. Beat in 2 cups flour until combined. Add 3 cups flour and beat until dough is smooth and elastic. Add melted butter; beat until glossy. Mix in remaining flour until dough is stiff., Transfer dough to a floured surface, cover with an inverted mixing bowl, and let rest for 15 minutes., Knead dough until smooth and satiny, then place in a lightly greased mixing bowl and turn dough to coat. Cover with a dish towel; let rise in a warm place until doubled, about 1 hour. Punch down dough; let rise again until almost doubled, about 1 hour., Preheat the oven to 400 degrees F (205 degrees C). Grease 2 baking sheets., Turn dough out again onto a floured surface and divide into 3 equal pieces. Divide each piece into thirds. Roll each piece into a 12- to 16-inch strip. Braid 3 strips into a loaf to get 3 large, braided loaves. Lift loaves onto the prepared baking sheets. Cover with a dish towel and let rise for 20 minutes., Beat together 1 egg and water in a small bowl. Brush over loaves and sprinkle with sugar., Bake in the preheated oven until the top is golden brown, 25 to 30 minutes. Check occasionally because the bottoms of loaves can burn quickly.","step_instructions":"1. Warm milk in a small saucepan over medium heat until it bubbles, then remove from heat. Let cool until lukewarm.\n2. Stir together warm water and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.\n3. Stir lukewarm milk, sugar, 4 beaten eggs, salt, and cardamom into yeast mixture. Beat in 2 cups flour until combined. Add 3 cups flour and beat until dough is smooth and elastic. Add melted butter; beat until glossy. Mix in remaining flour until dough is stiff.\n4. Transfer dough to a floured surface, cover with an inverted mixing bowl, and let rest for 15 minutes.\n5. Knead dough until smooth and satiny, then place in a lightly greased mixing bowl and turn dough to coat. Cover with a dish towel; let rise in a warm place until doubled, about 1 hour. Punch down dough; let rise again until almost doubled, about 1 hour.\n6. Preheat the oven to 400 degrees F (205 degrees C). Grease 2 baking sheets.\n7. Turn dough out again onto a floured surface and divide into 3 equal pieces. Divide each piece into thirds. Roll each piece into a 12- to 16-inch strip. Braid 3 strips into a loaf to get 3 large, braided loaves. Lift loaves onto the prepared baking sheets. Cover with a dish towel and let rise for 20 minutes.\n8. Beat together 1 egg and water in a small bowl. Brush over loaves and sprinkle with sugar.\n9. Bake in the preheated oven until the top is golden brown, 25 to 30 minutes. Check occasionally because the bottoms of loaves can burn quickly.","whole_recipe":"Recipe Name: Finnish Pulla, \nIngredients: 2 cups milk, 0.5 cup warm water (110 degrees F\/45 degrees C), 1 (.25 ounce) package active dry yeast, 1 cup white sugar, 4 large eggs, beaten, 1 teaspoon salt, 1 teaspoon ground cardamom, 9 cups all-purpose flour, 0.5 cup butter, melted, 1 large egg, 1 tablespoon water, 2 tablespoons white sugar, \nCooking Instructions: 1. Warm milk in a small saucepan over medium heat until it bubbles, then remove from heat. Let cool until lukewarm.\n2. Stir together warm water and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.\n3. Stir lukewarm milk, sugar, 4 beaten eggs, salt, and cardamom into yeast mixture. Beat in 2 cups flour until combined. Add 3 cups flour and beat until dough is smooth and elastic. Add melted butter; beat until glossy. Mix in remaining flour until dough is stiff.\n4. Transfer dough to a floured surface, cover with an inverted mixing bowl, and let rest for 15 minutes.\n5. Knead dough until smooth and satiny, then place in a lightly greased mixing bowl and turn dough to coat. Cover with a dish towel; let rise in a warm place until doubled, about 1 hour. Punch down dough; let rise again until almost doubled, about 1 hour.\n6. Preheat the oven to 400 degrees F (205 degrees C). Grease 2 baking sheets.\n7. Turn dough out again onto a floured surface and divide into 3 equal pieces. Divide each piece into thirds. Roll each piece into a 12- to 16-inch strip. Braid 3 strips into a loaf to get 3 large, braided loaves. Lift loaves onto the prepared baking sheets. Cover with a dish towel and let rise for 20 minutes.\n8. Beat together 1 egg and water in a small bowl. Brush over loaves and sprinkle with sugar.\n9. Bake in the preheated oven until the top is golden brown, 25 to 30 minutes. Check occasionally because the bottoms of loaves can burn quickly., "}
{"recipe_name":"Mom's Baking Powder Biscuits","ingredients":"2 cups all-purpose flour, plus more for dusting, 2.5 teaspoons baking powder, 0.75 teaspoon salt, 5 tablespoons shortening, 0.75 cup milk, 1 tablespoon melted shortening, or as needed","instructions":"Preheat the oven to 450 degrees F (230 degrees C)., Mix flour, baking powder, and salt in a bowl. Add shortening and cut into flour until incorporated into little pieces. Add milk a little at a time and mix until dough forms a ball., Roll out dough on a floured board to 1\/2- to 1\/4-inch thick. Cut out biscuits to desired size and dip in melted shortening. Place biscuits on an ungreased baking sheet., Bake in the preheated oven for 12 to 15 minutes.","step_instructions":"1. Preheat the oven to 450 degrees F (230 degrees C).\n2. Mix flour, baking powder, and salt in a bowl. Add shortening and cut into flour until incorporated into little pieces. Add milk a little at a time and mix until dough forms a ball.\n3. Roll out dough on a floured board to 1\/2- to 1\/4-inch thick. Cut out biscuits to desired size and dip in melted shortening. Place biscuits on an ungreased baking sheet.\n4. Bake in the preheated oven for 12 to 15 minutes.","whole_recipe":"Recipe Name: Mom's Baking Powder Biscuits, \nIngredients: 2 cups all-purpose flour, plus more for dusting, 2.5 teaspoons baking powder, 0.75 teaspoon salt, 5 tablespoons shortening, 0.75 cup milk, 1 tablespoon melted shortening, or as needed, \nCooking Instructions: 1. Preheat the oven to 450 degrees F (230 degrees C).\n2. Mix flour, baking powder, and salt in a bowl. Add shortening and cut into flour until incorporated into little pieces. Add milk a little at a time and mix until dough forms a ball.\n3. Roll out dough on a floured board to 1\/2- to 1\/4-inch thick. Cut out biscuits to desired size and dip in melted shortening. Place biscuits on an ungreased baking sheet.\n4. Bake in the preheated oven for 12 to 15 minutes., "}
{"recipe_name":"Bread Machine Bagels","ingredients":"1 cup warm water (110 degrees F\/45 degrees C), 3 cups bread flour, 2 tablespoons white sugar, 1.5 teaspoons salt, 2.25 teaspoons active dry yeast, 1 tablespoon cornmeal, 3 tablespoons white sugar, 1 large egg white, beaten, 3 tablespoons poppy seeds","instructions":"Place water, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes., Place dough onto a lightly floured surface and let rest for 10 to 15 minutes.., Cut dough into nine equal pieces. Roll each piece into a small ball and flatten into a circle. Poke a hole in the middle of each circle with your thumb. Poke your thumb through the hole and twirl each circle a bit to enlarge the hole and to even out dough around the hole. Place back onto the floured surface, cover with a clean cloth, and let rest for 10 minutes., While dough is resting, bring 3 quarts water to a boil in a large pot. Preheat the oven to 375 degrees F (190 degrees C). Sprinkle cornmeal onto an ungreased baking sheet., Stir sugar into boiling water. Working in batches, carefully transfer two bagels at a time to the boiling water and boil for 1 minute, turning halfway through. Drain briefly on a clean towel, then arrange on the prepared baking sheet. Brush with egg white and sprinkle with poppy seeds., When all bagels have been boiled and topped with poppy seeds, bake in the preheated oven until golden brown, 20 to 25 minutes.","step_instructions":"1. Place water, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes.\n2. Place dough onto a lightly floured surface and let rest for 10 to 15 minutes..\n3. Cut dough into nine equal pieces. Roll each piece into a small ball and flatten into a circle. Poke a hole in the middle of each circle with your thumb. Poke your thumb through the hole and twirl each circle a bit to enlarge the hole and to even out dough around the hole. Place back onto the floured surface, cover with a clean cloth, and let rest for 10 minutes.\n4. While dough is resting, bring 3 quarts water to a boil in a large pot. Preheat the oven to 375 degrees F (190 degrees C). Sprinkle cornmeal onto an ungreased baking sheet.\n5. Stir sugar into boiling water. Working in batches, carefully transfer two bagels at a time to the boiling water and boil for 1 minute, turning halfway through. Drain briefly on a clean towel, then arrange on the prepared baking sheet. Brush with egg white and sprinkle with poppy seeds.\n6. When all bagels have been boiled and topped with poppy seeds, bake in the preheated oven until golden brown, 20 to 25 minutes.","whole_recipe":"Recipe Name: Bread Machine Bagels, \nIngredients: 1 cup warm water (110 degrees F\/45 degrees C), 3 cups bread flour, 2 tablespoons white sugar, 1.5 teaspoons salt, 2.25 teaspoons active dry yeast, 1 tablespoon cornmeal, 3 tablespoons white sugar, 1 large egg white, beaten, 3 tablespoons poppy seeds, \nCooking Instructions: 1. Place water, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes.\n2. Place dough onto a lightly floured surface and let rest for 10 to 15 minutes..\n3. Cut dough into nine equal pieces. Roll each piece into a small ball and flatten into a circle. Poke a hole in the middle of each circle with your thumb. Poke your thumb through the hole and twirl each circle a bit to enlarge the hole and to even out dough around the hole. Place back onto the floured surface, cover with a clean cloth, and let rest for 10 minutes.\n4. While dough is resting, bring 3 quarts water to a boil in a large pot. Preheat the oven to 375 degrees F (190 degrees C). Sprinkle cornmeal onto an ungreased baking sheet.\n5. Stir sugar into boiling water. Working in batches, carefully transfer two bagels at a time to the boiling water and boil for 1 minute, turning halfway through. Drain briefly on a clean towel, then arrange on the prepared baking sheet. Brush with egg white and sprinkle with poppy seeds.\n6. When all bagels have been boiled and topped with poppy seeds, bake in the preheated oven until golden brown, 20 to 25 minutes., "}
{"recipe_name":"Simple Banana Bread","ingredients":"cooking spray, 2 cups all-purpose flour, 1 teaspoon baking powder, 0.5 teaspoon salt, 4 ripe bananas, mashed, 2 large eggs, 0.66666668653488 cup white sugar, 0.5 cup chopped walnuts","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x4-inch loaf pan and set aside., Sift together flour, baking powder, and salt in a large bowl. Set aside., Mash bananas in another bowl and stir in eggs and sugar., Stir the flour mixture into the banana mixture just to combine, then fold in walnuts. Pour the batter into the prepared pan., Bake in the preheated oven until a toothpick inserted into the center of the bread comes out clean, 55 to 65 minutes., Remove from the oven and cool on a rack for 10 minutes, then remove from the pan and cool completely. Slice and serve.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x4-inch loaf pan and set aside.\n2. Sift together flour, baking powder, and salt in a large bowl. Set aside.\n3. Mash bananas in another bowl and stir in eggs and sugar.\n4. Stir the flour mixture into the banana mixture just to combine, then fold in walnuts. Pour the batter into the prepared pan.\n5. Bake in the preheated oven until a toothpick inserted into the center of the bread comes out clean, 55 to 65 minutes.\n6. Remove from the oven and cool on a rack for 10 minutes, then remove from the pan and cool completely. Slice and serve.","whole_recipe":"Recipe Name: Simple Banana Bread, \nIngredients: cooking spray, 2 cups all-purpose flour, 1 teaspoon baking powder, 0.5 teaspoon salt, 4 ripe bananas, mashed, 2 large eggs, 0.66666668653488 cup white sugar, 0.5 cup chopped walnuts, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x4-inch loaf pan and set aside.\n2. Sift together flour, baking powder, and salt in a large bowl. Set aside.\n3. Mash bananas in another bowl and stir in eggs and sugar.\n4. Stir the flour mixture into the banana mixture just to combine, then fold in walnuts. Pour the batter into the prepared pan.\n5. Bake in the preheated oven until a toothpick inserted into the center of the bread comes out clean, 55 to 65 minutes.\n6. Remove from the oven and cool on a rack for 10 minutes, then remove from the pan and cool completely. Slice and serve., "}
{"recipe_name":"Cinnamon Swirl Bread for the Bread Machine","ingredients":"1 cup milk, 2 large eggs, 0.25 cup unsalted butter, softened, 4 cups bread flour, 0.25 cup white sugar, 1 teaspoon salt, 1.5 teaspoons active dry yeast, 0.5 cup chopped walnuts, 0.5 cup packed brown sugar, 2 teaspoons ground cinnamon, 2 tablespoons unsalted butter, softened, 2 teaspoons sifted confectioners' sugar, divided","instructions":"Place milk, eggs, butter, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run the Dough cycle, about 90 minutes., Transfer dough to a floured work surface. Punch dough to deflate and let rest for 10 minutes., Meanwhile, make the filling: Mix walnuts, brown sugar, and cinnamon together in a bowl., Divide dough in half; roll each half into a 9x14-inch rectangle. Spread each rectangle with 1 tablespoon butter and sprinkle with 1\/2 of the walnut mixture. Starting at the shorter end, roll each rectangle over filling and pinch seams to close., Grease two 9x5-inch loaf pans. Fit the rolled loaves into the loaf pans with the seams facing down. Cover and let rise until nearly doubled in volume, about 30 minutes., Preheat the oven to 350 degrees F (175 degrees C)., Bake in the preheated oven until tops are golden brown and loaves sound hollow when tapped, about 30 minutes, covering with foil the last 10 minutes if they brown too quickly., Remove from the oven and let cool in the pans for 10 minutes before removing to a wire rack to finish cooling. Dust loaves with confectioners' sugar.","step_instructions":"1. Place milk, eggs, butter, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run the Dough cycle, about 90 minutes.\n2. Transfer dough to a floured work surface. Punch dough to deflate and let rest for 10 minutes.\n3. Meanwhile, make the filling: Mix walnuts, brown sugar, and cinnamon together in a bowl.\n4. Divide dough in half; roll each half into a 9x14-inch rectangle. Spread each rectangle with 1 tablespoon butter and sprinkle with 1\/2 of the walnut mixture. Starting at the shorter end, roll each rectangle over filling and pinch seams to close.\n5. Grease two 9x5-inch loaf pans. Fit the rolled loaves into the loaf pans with the seams facing down. Cover and let rise until nearly doubled in volume, about 30 minutes.\n6. Preheat the oven to 350 degrees F (175 degrees C).\n7. Bake in the preheated oven until tops are golden brown and loaves sound hollow when tapped, about 30 minutes, covering with foil the last 10 minutes if they brown too quickly.\n8. Remove from the oven and let cool in the pans for 10 minutes before removing to a wire rack to finish cooling. Dust loaves with confectioners' sugar.","whole_recipe":"Recipe Name: Cinnamon Swirl Bread for the Bread Machine, \nIngredients: 1 cup milk, 2 large eggs, 0.25 cup unsalted butter, softened, 4 cups bread flour, 0.25 cup white sugar, 1 teaspoon salt, 1.5 teaspoons active dry yeast, 0.5 cup chopped walnuts, 0.5 cup packed brown sugar, 2 teaspoons ground cinnamon, 2 tablespoons unsalted butter, softened, 2 teaspoons sifted confectioners' sugar, divided, \nCooking Instructions: 1. Place milk, eggs, butter, flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run the Dough cycle, about 90 minutes.\n2. Transfer dough to a floured work surface. Punch dough to deflate and let rest for 10 minutes.\n3. Meanwhile, make the filling: Mix walnuts, brown sugar, and cinnamon together in a bowl.\n4. Divide dough in half; roll each half into a 9x14-inch rectangle. Spread each rectangle with 1 tablespoon butter and sprinkle with 1\/2 of the walnut mixture. Starting at the shorter end, roll each rectangle over filling and pinch seams to close.\n5. Grease two 9x5-inch loaf pans. Fit the rolled loaves into the loaf pans with the seams facing down. Cover and let rise until nearly doubled in volume, about 30 minutes.\n6. Preheat the oven to 350 degrees F (175 degrees C).\n7. Bake in the preheated oven until tops are golden brown and loaves sound hollow when tapped, about 30 minutes, covering with foil the last 10 minutes if they brown too quickly.\n8. Remove from the oven and let cool in the pans for 10 minutes before removing to a wire rack to finish cooling. Dust loaves with confectioners' sugar., "}
{"recipe_name":"Banana Loaf","ingredients":"1 cup white sugar, 0.5 cup butter, 2 large eggs, 3 ripe bananas, mashed, 2 cups all-purpose flour, 1 teaspoon baking soda, 1 teaspoon baking powder, 0.5 teaspoon salt, 0.5 cup chopped walnuts","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan., Cream sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy. Add eggs, one at a time, beating well after each addition. Mix in mashed bananas. Sift together flour, baking soda, baking powder, and salt in a separate bowl; beat into banana mixture just until combined. Fold in nuts. Pour batter into the prepared pan., Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 1 hour.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\n2. Cream sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy. Add eggs, one at a time, beating well after each addition. Mix in mashed bananas. Sift together flour, baking soda, baking powder, and salt in a separate bowl; beat into banana mixture just until combined. Fold in nuts. Pour batter into the prepared pan.\n3. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 1 hour.","whole_recipe":"Recipe Name: Banana Loaf, \nIngredients: 1 cup white sugar, 0.5 cup butter, 2 large eggs, 3 ripe bananas, mashed, 2 cups all-purpose flour, 1 teaspoon baking soda, 1 teaspoon baking powder, 0.5 teaspoon salt, 0.5 cup chopped walnuts, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\n2. Cream sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy. Add eggs, one at a time, beating well after each addition. Mix in mashed bananas. Sift together flour, baking soda, baking powder, and salt in a separate bowl; beat into banana mixture just until combined. Fold in nuts. Pour batter into the prepared pan.\n3. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 1 hour., "}
{"recipe_name":"Chef John's Dutch Babies","ingredients":"3 large large eggs, room temperature, 0.66666668653488 cup milk, room temperature, 0.5 cup packed all-purpose flour, 0.25 teaspoon vanilla extract, 0.25 teaspoon salt, 3 tablespoons clarified butter, 1 tablespoon butter, 0.5 Meyer lemon, juiced, 1 tablespoon confectioners' sugar, or to taste","instructions":"Preheat the oven to 425 degrees F (220 degrees C)., Blend eggs, milk, flour, vanilla, and salt together in a blender until batter is smooth., Melt clarified butter in a 10-inch cast iron skillet over high heat until bubbling; pour batter into the center of the skillet., Bake in the preheated oven until puffed and golden, 20 to 25 minutes. Brush with 1 tablespoon butter, drizzle lemon juice over the top, and dust with confectioners' sugar.","step_instructions":"1. Preheat the oven to 425 degrees F (220 degrees C).\n2. Blend eggs, milk, flour, vanilla, and salt together in a blender until batter is smooth.\n3. Melt clarified butter in a 10-inch cast iron skillet over high heat until bubbling; pour batter into the center of the skillet.\n4. Bake in the preheated oven until puffed and golden, 20 to 25 minutes. Brush with 1 tablespoon butter, drizzle lemon juice over the top, and dust with confectioners' sugar.","whole_recipe":"Recipe Name: Chef John's Dutch Babies, \nIngredients: 3 large large eggs, room temperature, 0.66666668653488 cup milk, room temperature, 0.5 cup packed all-purpose flour, 0.25 teaspoon vanilla extract, 0.25 teaspoon salt, 3 tablespoons clarified butter, 1 tablespoon butter, 0.5 Meyer lemon, juiced, 1 tablespoon confectioners' sugar, or to taste, \nCooking Instructions: 1. Preheat the oven to 425 degrees F (220 degrees C).\n2. Blend eggs, milk, flour, vanilla, and salt together in a blender until batter is smooth.\n3. Melt clarified butter in a 10-inch cast iron skillet over high heat until bubbling; pour batter into the center of the skillet.\n4. Bake in the preheated oven until puffed and golden, 20 to 25 minutes. Brush with 1 tablespoon butter, drizzle lemon juice over the top, and dust with confectioners' sugar., "}
{"recipe_name":"Chef John's Cheese Blintzes","ingredients":"1 cup milk, 1 cup all-purpose flour, 0.25 cup cold water, 3 large eggs, 2 tablespoons vegetable oil, 1 tablespoon white sugar, 0.5 teaspoon salt, 0.25 teaspoon vanilla extract, cooking spray, 1 tablespoon butter, or as needed, 1.5 cups ricotta cheese, strained if wet, 0.5 cup cream cheese, at room temperature, 1 large egg, 3 tablespoons powdered sugar, divided, or more as needed, 1 medium lemon, zested, 1 pinch salt","instructions":"Gather all ingredients., Make the batter: Combine milk, flour, water, eggs, oil, sugar, salt, and vanilla in a blender. Blend until completely smooth, 1 or 2 minutes, scraping down the sides as needed. Let batter sit at room temperature for 30 minutes., Meanwhile, make the filling: Whisk ricotta cheese, cream cheese, egg, 2 tablespoons powdered sugar, lemon zest, and salt together in a mixing bowl until thoroughly combined. Cover and refrigerate until needed., When batter has rested, heat a 10-inch, nonstick skillet over medium-high heat. Spray with cooking spray and pour in about 1\/4 cup batter., Immediately swirl batter around to coat the bottom of the skillet. Cook until the surface looks dry, about 1 minute., Flip crêpe and briefly cook the other side, about 30 seconds. Transfer to a plate. Repeat to cook and stack remaining crêpes., Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a baking dish., Spoon 3 to 4 tablespoons filling onto each crêpe, about 1 inch from the edge nearest you. Fold the edge over filling and flatten slightly., Fold in both sides, then roll crêpe into a small filled rectangle (blintz), ending with the seam on the bottom., Melt butter in a large skillet over medium heat. Working in batches, cook several blintzes at a time until golden brown, turning gently, about 1 minute per side. Transfer to the prepared baking dish., Bake in the preheated oven to firm up the filling, about 12 minutes., Cool blintzes for 10 minutes, then dust lightly with remaining powdered sugar and serve.","step_instructions":"1. Gather all ingredients.\n2. Make the batter: Combine milk, flour, water, eggs, oil, sugar, salt, and vanilla in a blender. Blend until completely smooth, 1 or 2 minutes, scraping down the sides as needed. Let batter sit at room temperature for 30 minutes.\n3. Meanwhile, make the filling: Whisk ricotta cheese, cream cheese, egg, 2 tablespoons powdered sugar, lemon zest, and salt together in a mixing bowl until thoroughly combined. Cover and refrigerate until needed.\n4. When batter has rested, heat a 10-inch, nonstick skillet over medium-high heat. Spray with cooking spray and pour in about 1\/4 cup batter.\n5. Immediately swirl batter around to coat the bottom of the skillet. Cook until the surface looks dry, about 1 minute.\n6. Flip crêpe and briefly cook the other side, about 30 seconds. Transfer to a plate. Repeat to cook and stack remaining crêpes.\n7. Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a baking dish.\n8. Spoon 3 to 4 tablespoons filling onto each crêpe, about 1 inch from the edge nearest you. Fold the edge over filling and flatten slightly.\n9. Fold in both sides, then roll crêpe into a small filled rectangle (blintz), ending with the seam on the bottom.\n10. Melt butter in a large skillet over medium heat. Working in batches, cook several blintzes at a time until golden brown, turning gently, about 1 minute per side. Transfer to the prepared baking dish.\n11. Bake in the preheated oven to firm up the filling, about 12 minutes.\n12. Cool blintzes for 10 minutes, then dust lightly with remaining powdered sugar and serve.","whole_recipe":"Recipe Name: Chef John's Cheese Blintzes, \nIngredients: 1 cup milk, 1 cup all-purpose flour, 0.25 cup cold water, 3 large eggs, 2 tablespoons vegetable oil, 1 tablespoon white sugar, 0.5 teaspoon salt, 0.25 teaspoon vanilla extract, cooking spray, 1 tablespoon butter, or as needed, 1.5 cups ricotta cheese, strained if wet, 0.5 cup cream cheese, at room temperature, 1 large egg, 3 tablespoons powdered sugar, divided, or more as needed, 1 medium lemon, zested, 1 pinch salt, \nCooking Instructions: 1. Gather all ingredients.\n2. Make the batter: Combine milk, flour, water, eggs, oil, sugar, salt, and vanilla in a blender. Blend until completely smooth, 1 or 2 minutes, scraping down the sides as needed. Let batter sit at room temperature for 30 minutes.\n3. Meanwhile, make the filling: Whisk ricotta cheese, cream cheese, egg, 2 tablespoons powdered sugar, lemon zest, and salt together in a mixing bowl until thoroughly combined. Cover and refrigerate until needed.\n4. When batter has rested, heat a 10-inch, nonstick skillet over medium-high heat. Spray with cooking spray and pour in about 1\/4 cup batter.\n5. Immediately swirl batter around to coat the bottom of the skillet. Cook until the surface looks dry, about 1 minute.\n6. Flip crêpe and briefly cook the other side, about 30 seconds. Transfer to a plate. Repeat to cook and stack remaining crêpes.\n7. Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a baking dish.\n8. Spoon 3 to 4 tablespoons filling onto each crêpe, about 1 inch from the edge nearest you. Fold the edge over filling and flatten slightly.\n9. Fold in both sides, then roll crêpe into a small filled rectangle (blintz), ending with the seam on the bottom.\n10. Melt butter in a large skillet over medium heat. Working in batches, cook several blintzes at a time until golden brown, turning gently, about 1 minute per side. Transfer to the prepared baking dish.\n11. Bake in the preheated oven to firm up the filling, about 12 minutes.\n12. Cool blintzes for 10 minutes, then dust lightly with remaining powdered sugar and serve., "}
{"recipe_name":"World's Best Scones! From Scotland to the Savoy to the U.S.","ingredients":"1.75 cups all-purpose flour, 4 teaspoons baking powder, 0.25 cup white sugar, 0.125 teaspoon salt, 5 tablespoons unsalted butter, 0.5 cup dried currants, 0.5 cup milk, 0.25 cup sour cream, 1 egg, 1 tablespoon milk","instructions":"Preheat the oven to 400 degrees F (200 degrees C). Grease a baking sheet., Make the scones: Sift flour, baking powder, sugar, and salt into a large bowl. Cut in butter with a pastry blender or by rubbing between fingers until lumps are the size of peas. Stir in currants., Whisk milk and sour cream together in a measuring cup; gently stir into flour mixture until dough is moistened, being careful not to overwork the dough., With floured hands, pat dough into 2- to 3-inch diameter balls. Place onto the prepared baking sheet and flatten lightly. Scones should slightly touch each other., Make the egg wash: Whisk egg and milk together. Brush the tops of scones with egg wash and let them rest for about 10 minutes., Bake in the preheated oven until the tops are golden brown, 10 to 15 minutes.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C). Grease a baking sheet.\n2. Make the scones: Sift flour, baking powder, sugar, and salt into a large bowl. Cut in butter with a pastry blender or by rubbing between fingers until lumps are the size of peas. Stir in currants.\n3. Whisk milk and sour cream together in a measuring cup; gently stir into flour mixture until dough is moistened, being careful not to overwork the dough.\n4. With floured hands, pat dough into 2- to 3-inch diameter balls. Place onto the prepared baking sheet and flatten lightly. Scones should slightly touch each other.\n5. Make the egg wash: Whisk egg and milk together. Brush the tops of scones with egg wash and let them rest for about 10 minutes.\n6. Bake in the preheated oven until the tops are golden brown, 10 to 15 minutes.","whole_recipe":"Recipe Name: World's Best Scones! From Scotland to the Savoy to the U.S., \nIngredients: 1.75 cups all-purpose flour, 4 teaspoons baking powder, 0.25 cup white sugar, 0.125 teaspoon salt, 5 tablespoons unsalted butter, 0.5 cup dried currants, 0.5 cup milk, 0.25 cup sour cream, 1 egg, 1 tablespoon milk, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C). Grease a baking sheet.\n2. Make the scones: Sift flour, baking powder, sugar, and salt into a large bowl. Cut in butter with a pastry blender or by rubbing between fingers until lumps are the size of peas. Stir in currants.\n3. Whisk milk and sour cream together in a measuring cup; gently stir into flour mixture until dough is moistened, being careful not to overwork the dough.\n4. With floured hands, pat dough into 2- to 3-inch diameter balls. Place onto the prepared baking sheet and flatten lightly. Scones should slightly touch each other.\n5. Make the egg wash: Whisk egg and milk together. Brush the tops of scones with egg wash and let them rest for about 10 minutes.\n6. Bake in the preheated oven until the tops are golden brown, 10 to 15 minutes., "}
{"recipe_name":"Brown Sugar Banana Bread","ingredients":"4 ripe bananas, cut into chunks, 1.25 cups light brown sugar, 0.5 cup butter, softened, 1 jumbo egg, 0.25 cup whole milk, 1 teaspoon cinnamon, 1 teaspoon vanilla extract, 2 cups all-purpose flour, 1 teaspoon baking powder, 0.5 teaspoon baking soda, 0.5 teaspoon kosher salt","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan., Place bananas into a large resealable plastic bag; seal the bag and smoosh bananas with your fingers until well mashed. Set aside., Mix together brown sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, 1 to 2 minutes. Cut a corner from the plastic bag; squeeze mashed bananas into brown sugar mixture in the bowl. Add egg, milk, cinnamon, and vanilla; beat on medium speed until well combined. Mix in flour, baking powder, baking soda, and kosher salt on low speed just until smooth, about 1 minute. Spread into the prepared loaf pan., Bake in the preheated oven until lightly browned on top and a toothpick inserted into the center comes out clean, about 40 minutes.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\n2. Place bananas into a large resealable plastic bag; seal the bag and smoosh bananas with your fingers until well mashed. Set aside.\n3. Mix together brown sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, 1 to 2 minutes. Cut a corner from the plastic bag; squeeze mashed bananas into brown sugar mixture in the bowl. Add egg, milk, cinnamon, and vanilla; beat on medium speed until well combined. Mix in flour, baking powder, baking soda, and kosher salt on low speed just until smooth, about 1 minute. Spread into the prepared loaf pan.\n4. Bake in the preheated oven until lightly browned on top and a toothpick inserted into the center comes out clean, about 40 minutes.","whole_recipe":"Recipe Name: Brown Sugar Banana Bread, \nIngredients: 4 ripe bananas, cut into chunks, 1.25 cups light brown sugar, 0.5 cup butter, softened, 1 jumbo egg, 0.25 cup whole milk, 1 teaspoon cinnamon, 1 teaspoon vanilla extract, 2 cups all-purpose flour, 1 teaspoon baking powder, 0.5 teaspoon baking soda, 0.5 teaspoon kosher salt, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\n2. Place bananas into a large resealable plastic bag; seal the bag and smoosh bananas with your fingers until well mashed. Set aside.\n3. Mix together brown sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, 1 to 2 minutes. Cut a corner from the plastic bag; squeeze mashed bananas into brown sugar mixture in the bowl. Add egg, milk, cinnamon, and vanilla; beat on medium speed until well combined. Mix in flour, baking powder, baking soda, and kosher salt on low speed just until smooth, about 1 minute. Spread into the prepared loaf pan.\n4. Bake in the preheated oven until lightly browned on top and a toothpick inserted into the center comes out clean, about 40 minutes., "}
{"recipe_name":"Popovers","ingredients":"cooking spray, 2 large eggs, 1 cup all-purpose flour, 1 cup milk, 0.5 teaspoon salt","instructions":"Preheat the oven to 450 degrees F (230 degrees C). Grease and flour six 6-ounce custard cups., Beat eggs slightly in a medium bowl. Beat in flour, milk, and salt until just smooth; being careful not to overbeat., Fill custard cups 1\/2 full., Bake in the preheated oven for 20 minutes. Decrease the oven temperature to 350 degrees F (175 degrees C) and bake for 20 minutes more. Immediately remove from cups and serve piping hot.","step_instructions":"1. Preheat the oven to 450 degrees F (230 degrees C). Grease and flour six 6-ounce custard cups.\n2. Beat eggs slightly in a medium bowl. Beat in flour, milk, and salt until just smooth; being careful not to overbeat.\n3. Fill custard cups 1\/2 full.\n4. Bake in the preheated oven for 20 minutes. Decrease the oven temperature to 350 degrees F (175 degrees C) and bake for 20 minutes more. Immediately remove from cups and serve piping hot.","whole_recipe":"Recipe Name: Popovers, \nIngredients: cooking spray, 2 large eggs, 1 cup all-purpose flour, 1 cup milk, 0.5 teaspoon salt, \nCooking Instructions: 1. Preheat the oven to 450 degrees F (230 degrees C). Grease and flour six 6-ounce custard cups.\n2. Beat eggs slightly in a medium bowl. Beat in flour, milk, and salt until just smooth; being careful not to overbeat.\n3. Fill custard cups 1\/2 full.\n4. Bake in the preheated oven for 20 minutes. Decrease the oven temperature to 350 degrees F (175 degrees C) and bake for 20 minutes more. Immediately remove from cups and serve piping hot., "}
{"recipe_name":"Cinnamon Bread","ingredients":"2 cups all-purpose flour, 1 cup white sugar, 1 cup buttermilk, 2 large eggs, 0.25 cup vegetable oil, 2 teaspoons vanilla extract, 2 teaspoons baking powder, 1.5 teaspoons ground cinnamon, 1 teaspoon salt, 0.5 teaspoon baking soda, 2 tablespoons white sugar, 2 teaspoons margarine, 1 teaspoon ground cinnamon","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan., Make bread: Beat flour, sugar, buttermilk, eggs, oil, vanilla, baking powder, cinnamon, salt, and baking soda in a large mixing bowl until well combined, about 3 minutes. Pour batter into the prepared loaf pan; smooth the top., Make topping: Stir together sugar, margarine, and cinnamon in a small bowl until crumbly; sprinkle over batter. Use a paring knife to swirl batter for a marbled effect., Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Remove bread from the pan to a wire rack to cool completely.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\n2. Make bread: Beat flour, sugar, buttermilk, eggs, oil, vanilla, baking powder, cinnamon, salt, and baking soda in a large mixing bowl until well combined, about 3 minutes. Pour batter into the prepared loaf pan; smooth the top.\n3. Make topping: Stir together sugar, margarine, and cinnamon in a small bowl until crumbly; sprinkle over batter. Use a paring knife to swirl batter for a marbled effect.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Remove bread from the pan to a wire rack to cool completely.","whole_recipe":"Recipe Name: Cinnamon Bread, \nIngredients: 2 cups all-purpose flour, 1 cup white sugar, 1 cup buttermilk, 2 large eggs, 0.25 cup vegetable oil, 2 teaspoons vanilla extract, 2 teaspoons baking powder, 1.5 teaspoons ground cinnamon, 1 teaspoon salt, 0.5 teaspoon baking soda, 2 tablespoons white sugar, 2 teaspoons margarine, 1 teaspoon ground cinnamon, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\n2. Make bread: Beat flour, sugar, buttermilk, eggs, oil, vanilla, baking powder, cinnamon, salt, and baking soda in a large mixing bowl until well combined, about 3 minutes. Pour batter into the prepared loaf pan; smooth the top.\n3. Make topping: Stir together sugar, margarine, and cinnamon in a small bowl until crumbly; sprinkle over batter. Use a paring knife to swirl batter for a marbled effect.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Remove bread from the pan to a wire rack to cool completely., "}
{"recipe_name":"Easy Baking Powder Drop Biscuits","ingredients":"2 cups all-purpose flour, 1 tablespoon white sugar, 2.5 teaspoons baking powder, 0.5 teaspoon salt, 0.5 cup chilled butter, diced, 1.25 cups whole milk","instructions":"Preheat the oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet., Mix flour, sugar, baking powder, and salt together in a large bowl. Cut in cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Stir in milk, a little at a time, until dough is moistened. Drop dough by heaping spoonfuls onto the prepared baking sheet., Bake in the preheated oven until golden, 12 to 15 minutes.","step_instructions":"1. Preheat the oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet.\n2. Mix flour, sugar, baking powder, and salt together in a large bowl. Cut in cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Stir in milk, a little at a time, until dough is moistened. Drop dough by heaping spoonfuls onto the prepared baking sheet.\n3. Bake in the preheated oven until golden, 12 to 15 minutes.","whole_recipe":"Recipe Name: Easy Baking Powder Drop Biscuits, \nIngredients: 2 cups all-purpose flour, 1 tablespoon white sugar, 2.5 teaspoons baking powder, 0.5 teaspoon salt, 0.5 cup chilled butter, diced, 1.25 cups whole milk, \nCooking Instructions: 1. Preheat the oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet.\n2. Mix flour, sugar, baking powder, and salt together in a large bowl. Cut in cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Stir in milk, a little at a time, until dough is moistened. Drop dough by heaping spoonfuls onto the prepared baking sheet.\n3. Bake in the preheated oven until golden, 12 to 15 minutes., "}
{"recipe_name":"Sweet Cornbread Cake","ingredients":"3 cups all-purpose flour, 1.3333333730698 cups white sugar, 1 cup cornmeal, 2 tablespoons baking powder, 1 teaspoon salt, 2.5 cups whole milk, 4 eggs, beaten, 0.66666668653488 cup vegetable oil, 0.33333334326744 cup melted butter, 2 tablespoons honey","instructions":"Gather all ingredients., Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish., Stir flour, sugar, cornmeal, baking powder, and salt together in a mixing bowl. Pour in milk, beaten eggs, vegetable oil, melted butter, and honey; stir just to moisten., Pour batter into the prepared baking dish., Bake in the preheated oven until golden brown and a toothpick inserted in the center comes out clean, about 45 minutes., Enjoy!","step_instructions":"1. Gather all ingredients.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n3. Stir flour, sugar, cornmeal, baking powder, and salt together in a mixing bowl. Pour in milk, beaten eggs, vegetable oil, melted butter, and honey; stir just to moisten.\n4. Pour batter into the prepared baking dish.\n5. Bake in the preheated oven until golden brown and a toothpick inserted in the center comes out clean, about 45 minutes.\n6. Enjoy!","whole_recipe":"Recipe Name: Sweet Cornbread Cake, \nIngredients: 3 cups all-purpose flour, 1.3333333730698 cups white sugar, 1 cup cornmeal, 2 tablespoons baking powder, 1 teaspoon salt, 2.5 cups whole milk, 4 eggs, beaten, 0.66666668653488 cup vegetable oil, 0.33333334326744 cup melted butter, 2 tablespoons honey, \nCooking Instructions: 1. Gather all ingredients.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n3. Stir flour, sugar, cornmeal, baking powder, and salt together in a mixing bowl. Pour in milk, beaten eggs, vegetable oil, melted butter, and honey; stir just to moisten.\n4. Pour batter into the prepared baking dish.\n5. Bake in the preheated oven until golden brown and a toothpick inserted in the center comes out clean, about 45 minutes.\n6. Enjoy!, "}
{"recipe_name":"Strawberry Bread","ingredients":"2 cups fresh strawberries, 1 tablespoon white sugar, 3.125 cups all-purpose flour, 2 cups white sugar, 1 tablespoon ground cinnamon, 1 teaspoon salt, 1 teaspoon baking soda, 1.25 cups vegetable oil, 4 large eggs, beaten, 1.25 cups chopped pecans","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans., Slice strawberries and place in a medium-sized bowl. Sprinkle lightly with 1 tablespoon sugar and toss to coat., Combine flour, 2 cups sugar, cinnamon, salt, and baking soda in large bowl; mix well., Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans., Bake in the preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately)., Remove from the oven and let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans.\n2. Slice strawberries and place in a medium-sized bowl. Sprinkle lightly with 1 tablespoon sugar and toss to coat.\n3. Combine flour, 2 cups sugar, cinnamon, salt, and baking soda in large bowl; mix well.\n4. Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans.\n5. Bake in the preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately).\n6. Remove from the oven and let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing.","whole_recipe":"Recipe Name: Strawberry Bread, \nIngredients: 2 cups fresh strawberries, 1 tablespoon white sugar, 3.125 cups all-purpose flour, 2 cups white sugar, 1 tablespoon ground cinnamon, 1 teaspoon salt, 1 teaspoon baking soda, 1.25 cups vegetable oil, 4 large eggs, beaten, 1.25 cups chopped pecans, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans.\n2. Slice strawberries and place in a medium-sized bowl. Sprinkle lightly with 1 tablespoon sugar and toss to coat.\n3. Combine flour, 2 cups sugar, cinnamon, salt, and baking soda in large bowl; mix well.\n4. Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans.\n5. Bake in the preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately).\n6. Remove from the oven and let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing., "}
{"recipe_name":"Amazing Lemon Scones","ingredients":"3 cups all-purpose flour, 0.33333334326744 cup white sugar, 1.5 teaspoons baking powder, 1.5 teaspoons baking soda, 0.33333334326744 teaspoon salt, 0.75 cup cold butter, cut into pieces, 9 tablespoons milk, 3 tablespoons lemon juice, 2.5 teaspoons lemon zest, 1.5 teaspoons vinegar, 2 cups confectioners' sugar, 0.33333334326744 cup butter, melted, 2.5 tablespoons lemon juice, 0.5 teaspoon vanilla extract, 2 tablespoons water, or as needed","instructions":"Preheat the oven to 350 degrees F (175 degrees C)., Make the scones: Whisk flour, sugar, baking powder, baking soda, and salt together in a large bowl. Cut in cold butter with 2 knives or a pastry blender until mixture resembles coarse crumbs. Whisk milk, lemon juice, lemon zest, and vinegar in a small bowl; stir into flour mixture until dough is moistened., Turn dough out onto a lightly floured surface and knead briefly, 5 or 6 turns. Pat or roll dough out into a 1-inch-thick round. Cut into 10 wedge-shaped pieces; arrange 1 inch apart on a baking sheet., Bake in the preheated oven until bottom edges are golden brown, 12 to 15 minutes. Cool scones on a wire rack for 15 minutes., Meanwhile, make the glaze: Stir confectioners' sugar, melted butter, lemon juice, and vanilla together in a bowl until smooth. Stir water into sugar mixture, 1 tablespoon at a time, to make a glaze; drizzle glaze over warm scones.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Make the scones: Whisk flour, sugar, baking powder, baking soda, and salt together in a large bowl. Cut in cold butter with 2 knives or a pastry blender until mixture resembles coarse crumbs. Whisk milk, lemon juice, lemon zest, and vinegar in a small bowl; stir into flour mixture until dough is moistened.\n3. Turn dough out onto a lightly floured surface and knead briefly, 5 or 6 turns. Pat or roll dough out into a 1-inch-thick round. Cut into 10 wedge-shaped pieces; arrange 1 inch apart on a baking sheet.\n4. Bake in the preheated oven until bottom edges are golden brown, 12 to 15 minutes. Cool scones on a wire rack for 15 minutes.\n5. Meanwhile, make the glaze: Stir confectioners' sugar, melted butter, lemon juice, and vanilla together in a bowl until smooth. Stir water into sugar mixture, 1 tablespoon at a time, to make a glaze; drizzle glaze over warm scones.","whole_recipe":"Recipe Name: Amazing Lemon Scones, \nIngredients: 3 cups all-purpose flour, 0.33333334326744 cup white sugar, 1.5 teaspoons baking powder, 1.5 teaspoons baking soda, 0.33333334326744 teaspoon salt, 0.75 cup cold butter, cut into pieces, 9 tablespoons milk, 3 tablespoons lemon juice, 2.5 teaspoons lemon zest, 1.5 teaspoons vinegar, 2 cups confectioners' sugar, 0.33333334326744 cup butter, melted, 2.5 tablespoons lemon juice, 0.5 teaspoon vanilla extract, 2 tablespoons water, or as needed, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Make the scones: Whisk flour, sugar, baking powder, baking soda, and salt together in a large bowl. Cut in cold butter with 2 knives or a pastry blender until mixture resembles coarse crumbs. Whisk milk, lemon juice, lemon zest, and vinegar in a small bowl; stir into flour mixture until dough is moistened.\n3. Turn dough out onto a lightly floured surface and knead briefly, 5 or 6 turns. Pat or roll dough out into a 1-inch-thick round. Cut into 10 wedge-shaped pieces; arrange 1 inch apart on a baking sheet.\n4. Bake in the preheated oven until bottom edges are golden brown, 12 to 15 minutes. Cool scones on a wire rack for 15 minutes.\n5. Meanwhile, make the glaze: Stir confectioners' sugar, melted butter, lemon juice, and vanilla together in a bowl until smooth. Stir water into sugar mixture, 1 tablespoon at a time, to make a glaze; drizzle glaze over warm scones., "}
{"recipe_name":"Cranberry Orange Bread","ingredients":"2 cups flour, 0.75 cup white sugar, 1.5 teaspoons baking powder, 0.75 teaspoon salt, 0.5 teaspoon baking soda, 0.25 cup unsalted butter, cut into pieces and softened, 0.75 cup orange juice, 1 tablespoon grated orange zest, 1 large egg, beaten, 1 cup chopped cranberries, 0.5 cup chopped walnuts","instructions":"Gather all ingredients., Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 1\/2x4 1\/2-inch loaf pan., Combine flour, sugar, baking powder, salt, and baking soda in a bowl. Stir butter into flour mixture until combined. Add orange juice, orange zest, and egg; mix well., Fold in cranberries and walnuts. Spoon batter into the prepared pan., Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 75 minutes., Cool in the pan for 10 minutes before removing to cool completely on a wire rack.","step_instructions":"1. Gather all ingredients.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 1\/2x4 1\/2-inch loaf pan.\n3. Combine flour, sugar, baking powder, salt, and baking soda in a bowl. Stir butter into flour mixture until combined. Add orange juice, orange zest, and egg; mix well.\n4. Fold in cranberries and walnuts. Spoon batter into the prepared pan.\n5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 75 minutes.\n6. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.","whole_recipe":"Recipe Name: Cranberry Orange Bread, \nIngredients: 2 cups flour, 0.75 cup white sugar, 1.5 teaspoons baking powder, 0.75 teaspoon salt, 0.5 teaspoon baking soda, 0.25 cup unsalted butter, cut into pieces and softened, 0.75 cup orange juice, 1 tablespoon grated orange zest, 1 large egg, beaten, 1 cup chopped cranberries, 0.5 cup chopped walnuts, \nCooking Instructions: 1. Gather all ingredients.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 1\/2x4 1\/2-inch loaf pan.\n3. Combine flour, sugar, baking powder, salt, and baking soda in a bowl. Stir butter into flour mixture until combined. Add orange juice, orange zest, and egg; mix well.\n4. Fold in cranberries and walnuts. Spoon batter into the prepared pan.\n5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 75 minutes.\n6. Cool in the pan for 10 minutes before removing to cool completely on a wire rack., "}
{"recipe_name":"Cinnamon Swirl Bread","ingredients":"1.33300000429153 cups white sugar, divided, 2 teaspoons ground cinnamon, 2 cups all-purpose flour, 1 tablespoon baking powder, 0.5 teaspoon salt, 1 large egg, beaten, 1 cup milk, 0.33300000429153 cup vegetable oil","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan., Mix together 1\/3 cup sugar and 2 teaspoons cinnamon in a small bowl; set aside., Combine flour, remaining 1 cup sugar, baking powder, and salt together in a large bowl. Combine egg, milk, and oil in a separate bowl; add to flour mixture. Stir until just moistened., Pour 1\/2 of the batter into the prepared pan. Sprinkle with 1\/2 of the reserved cinnamon-sugar mixture. Repeat with remaining batter and cinnamon-sugar mixture. Draw a knife through batter to marble., Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, 45 to 50 minutes., Let cool in the pan for 10 minutes before removing to a wire rack to cool completely. Wrap in foil and let sit overnight before slicing.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\n2. Mix together 1\/3 cup sugar and 2 teaspoons cinnamon in a small bowl; set aside.\n3. Combine flour, remaining 1 cup sugar, baking powder, and salt together in a large bowl. Combine egg, milk, and oil in a separate bowl; add to flour mixture. Stir until just moistened.\n4. Pour 1\/2 of the batter into the prepared pan. Sprinkle with 1\/2 of the reserved cinnamon-sugar mixture. Repeat with remaining batter and cinnamon-sugar mixture. Draw a knife through batter to marble.\n5. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, 45 to 50 minutes.\n6. Let cool in the pan for 10 minutes before removing to a wire rack to cool completely. Wrap in foil and let sit overnight before slicing.","whole_recipe":"Recipe Name: Cinnamon Swirl Bread, \nIngredients: 1.33300000429153 cups white sugar, divided, 2 teaspoons ground cinnamon, 2 cups all-purpose flour, 1 tablespoon baking powder, 0.5 teaspoon salt, 1 large egg, beaten, 1 cup milk, 0.33300000429153 cup vegetable oil, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\n2. Mix together 1\/3 cup sugar and 2 teaspoons cinnamon in a small bowl; set aside.\n3. Combine flour, remaining 1 cup sugar, baking powder, and salt together in a large bowl. Combine egg, milk, and oil in a separate bowl; add to flour mixture. Stir until just moistened.\n4. Pour 1\/2 of the batter into the prepared pan. Sprinkle with 1\/2 of the reserved cinnamon-sugar mixture. Repeat with remaining batter and cinnamon-sugar mixture. Draw a knife through batter to marble.\n5. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, 45 to 50 minutes.\n6. Let cool in the pan for 10 minutes before removing to a wire rack to cool completely. Wrap in foil and let sit overnight before slicing., "}
{"recipe_name":"J.P.'s Big Daddy Biscuits","ingredients":"2 cups all-purpose flour, 1 tablespoon baking powder, 1 tablespoon white sugar, 1 teaspoon salt, 0.33333334326744 cup shortening, 1 cup milk","instructions":"Preheat the oven to 425 degrees F (220 degrees C)., Whisk together flour, baking powder, sugar, and salt in a large bowl. Cut in shortening until the mixture resembles a coarse meal., Gradually stir in milk until dough pulls away from the side of the bowl., Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet., Bake in the preheated oven until the edges begin to brown, 13 to 15 minutes., Enjoy!","step_instructions":"1. Preheat the oven to 425 degrees F (220 degrees C).\n2. Whisk together flour, baking powder, sugar, and salt in a large bowl. Cut in shortening until the mixture resembles a coarse meal.\n3. Gradually stir in milk until dough pulls away from the side of the bowl.\n4. Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.\n5. Bake in the preheated oven until the edges begin to brown, 13 to 15 minutes.\n6. Enjoy!","whole_recipe":"Recipe Name: J.P.'s Big Daddy Biscuits, \nIngredients: 2 cups all-purpose flour, 1 tablespoon baking powder, 1 tablespoon white sugar, 1 teaspoon salt, 0.33333334326744 cup shortening, 1 cup milk, \nCooking Instructions: 1. Preheat the oven to 425 degrees F (220 degrees C).\n2. Whisk together flour, baking powder, sugar, and salt in a large bowl. Cut in shortening until the mixture resembles a coarse meal.\n3. Gradually stir in milk until dough pulls away from the side of the bowl.\n4. Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.\n5. Bake in the preheated oven until the edges begin to brown, 13 to 15 minutes.\n6. Enjoy!, "}
{"recipe_name":"90-Second Keto Bread in a Mug","ingredients":"1 tablespoon butter, 0.33333334326744 cup blanched almond flour, 1 egg, 0.5 teaspoon baking powder, 1 pinch salt","instructions":"Microwave butter in a microwave-safe mug until melted, about 15 seconds. Swirl the mug to coat with butter., Add almond flour, egg, baking powder, and salt to the mug; whisk until smooth., Microwave on high until set, about 90 seconds. Let cool for 2 minutes before slicing.","step_instructions":"1. Microwave butter in a microwave-safe mug until melted, about 15 seconds. Swirl the mug to coat with butter.\n2. Add almond flour, egg, baking powder, and salt to the mug; whisk until smooth.\n3. Microwave on high until set, about 90 seconds. Let cool for 2 minutes before slicing.","whole_recipe":"Recipe Name: 90-Second Keto Bread in a Mug, \nIngredients: 1 tablespoon butter, 0.33333334326744 cup blanched almond flour, 1 egg, 0.5 teaspoon baking powder, 1 pinch salt, \nCooking Instructions: 1. Microwave butter in a microwave-safe mug until melted, about 15 seconds. Swirl the mug to coat with butter.\n2. Add almond flour, egg, baking powder, and salt to the mug; whisk until smooth.\n3. Microwave on high until set, about 90 seconds. Let cool for 2 minutes before slicing., "}
{"recipe_name":"Jamaican Fried Dumplings","ingredients":"4 cups all-purpose flour, 2 teaspoons baking powder, 1.5 teaspoons salt, 0.5 cup butter, cut into cubes and softened, 0.5 cup cold water, 1 cup vegetable oil for frying","instructions":"Mix flour, baking powder, and salt together in a large bowl. Rub in butter until the mixture is crumbly. Mix in water, 1 tablespoon at a time, to form a firm dough; knead briefly., Heat oil in a large heavy skillet over medium heat., Break off pieces of dough and shape them into biscuit-like patties. Place just enough of the dumplings into the hot oil so they are not crowded; fry until golden brown, about 3 minutes per side. Remove from the pan and drain on paper towels before serving.","step_instructions":"1. Mix flour, baking powder, and salt together in a large bowl. Rub in butter until the mixture is crumbly. Mix in water, 1 tablespoon at a time, to form a firm dough; knead briefly.\n2. Heat oil in a large heavy skillet over medium heat.\n3. Break off pieces of dough and shape them into biscuit-like patties. Place just enough of the dumplings into the hot oil so they are not crowded; fry until golden brown, about 3 minutes per side. Remove from the pan and drain on paper towels before serving.","whole_recipe":"Recipe Name: Jamaican Fried Dumplings, \nIngredients: 4 cups all-purpose flour, 2 teaspoons baking powder, 1.5 teaspoons salt, 0.5 cup butter, cut into cubes and softened, 0.5 cup cold water, 1 cup vegetable oil for frying, \nCooking Instructions: 1. Mix flour, baking powder, and salt together in a large bowl. Rub in butter until the mixture is crumbly. Mix in water, 1 tablespoon at a time, to form a firm dough; knead briefly.\n2. Heat oil in a large heavy skillet over medium heat.\n3. Break off pieces of dough and shape them into biscuit-like patties. Place just enough of the dumplings into the hot oil so they are not crowded; fry until golden brown, about 3 minutes per side. Remove from the pan and drain on paper towels before serving., "}
{"recipe_name":"Blueberry Loaf","ingredients":"1.5 cups all-purpose flour, 0.75 cup white sugar, 2 teaspoons baking powder, 0.125 teaspoon salt, 0.5 cup milk, 0.25 cup vegetable oil, 1 egg, 0.5 teaspoon vanilla extract, 1.5 cups blueberries","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a loaf pan., Mix flour, sugar, baking powder, and salt in a large bowl. Stir milk, oil, egg, and vanilla extract into flour mixture until just blended; gently fold blueberries into batter and pour into prepared loaf pan., Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool briefly on a wire rack before inverting carefully onto a serving plate or cooling rack. Let cool completely.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease a loaf pan.\n2. Mix flour, sugar, baking powder, and salt in a large bowl. Stir milk, oil, egg, and vanilla extract into flour mixture until just blended; gently fold blueberries into batter and pour into prepared loaf pan.\n3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool briefly on a wire rack before inverting carefully onto a serving plate or cooling rack. Let cool completely.","whole_recipe":"Recipe Name: Blueberry Loaf, \nIngredients: 1.5 cups all-purpose flour, 0.75 cup white sugar, 2 teaspoons baking powder, 0.125 teaspoon salt, 0.5 cup milk, 0.25 cup vegetable oil, 1 egg, 0.5 teaspoon vanilla extract, 1.5 cups blueberries, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease a loaf pan.\n2. Mix flour, sugar, baking powder, and salt in a large bowl. Stir milk, oil, egg, and vanilla extract into flour mixture until just blended; gently fold blueberries into batter and pour into prepared loaf pan.\n3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool briefly on a wire rack before inverting carefully onto a serving plate or cooling rack. Let cool completely., "}
{"recipe_name":"Hot Water Cornbread","ingredients":"1 cup cornmeal, 1 teaspoon salt, 1 teaspoon white sugar, 0.75 cup boiling water, 1 tablespoon bacon grease, 1 cup bacon grease, or as needed","instructions":"Combine cornmeal, salt, and sugar in a medium bowl. Add boiling water and 1 tablespoon bacon grease; stir until bacon grease melts melts., Pour bacon grease to a depth of 1\/2-inch in a large skillet; heat to 375 degrees F (190 degrees C)., Shape cornmeal mixture into 12 flattened balls using a heaping tablespoon as a measuring guide., Fry, turning once, in hot oil until crisp and golden brown, about 5 minutes. Drain on paper towels and serve warm.","step_instructions":"1. Combine cornmeal, salt, and sugar in a medium bowl. Add boiling water and 1 tablespoon bacon grease; stir until bacon grease melts melts.\n2. Pour bacon grease to a depth of 1\/2-inch in a large skillet; heat to 375 degrees F (190 degrees C).\n3. Shape cornmeal mixture into 12 flattened balls using a heaping tablespoon as a measuring guide.\n4. Fry, turning once, in hot oil until crisp and golden brown, about 5 minutes. Drain on paper towels and serve warm.","whole_recipe":"Recipe Name: Hot Water Cornbread, \nIngredients: 1 cup cornmeal, 1 teaspoon salt, 1 teaspoon white sugar, 0.75 cup boiling water, 1 tablespoon bacon grease, 1 cup bacon grease, or as needed, \nCooking Instructions: 1. Combine cornmeal, salt, and sugar in a medium bowl. Add boiling water and 1 tablespoon bacon grease; stir until bacon grease melts melts.\n2. Pour bacon grease to a depth of 1\/2-inch in a large skillet; heat to 375 degrees F (190 degrees C).\n3. Shape cornmeal mixture into 12 flattened balls using a heaping tablespoon as a measuring guide.\n4. Fry, turning once, in hot oil until crisp and golden brown, about 5 minutes. Drain on paper towels and serve warm., "}
{"recipe_name":"Banana Sour Cream Bread","ingredients":"3.25 cups white sugar, divided, 3 teaspoons ground cinnamon, divided, 0.75 cup butter, 6 very ripe bananas, mashed, 1 (16 ounce) container sour cream, 3 eggs, 2 teaspoons vanilla extract, 4.5 cups all-purpose flour, 3 teaspoons baking soda, 0.5 teaspoon salt, 1 cup chopped walnuts","instructions":"Preheat the oven to 300 degrees F (150 degrees C). Grease four 7x3-inch loaf pans., Mix 1\/4 cup sugar and 1 teaspoon cinnamon together in a small bowl until well combined; dust the greased pans lightly with sugar mixture., Beat remaining 3 cups sugar and butter together in a large bowl with an electric mixer until smooth. Add mashed bananas, sour cream, eggs, vanilla, and remaining 2 teaspoons cinnamon; continue to beat until well-blended. Add flour, baking soda, and salt; mix until just combined. Stir in walnuts and divide batter evenly into the prepared pans., Bake in the preheated oven until a toothpick inserted in center comes out clean, about 1 hour.","step_instructions":"1. Preheat the oven to 300 degrees F (150 degrees C). Grease four 7x3-inch loaf pans.\n2. Mix 1\/4 cup sugar and 1 teaspoon cinnamon together in a small bowl until well combined; dust the greased pans lightly with sugar mixture.\n3. Beat remaining 3 cups sugar and butter together in a large bowl with an electric mixer until smooth. Add mashed bananas, sour cream, eggs, vanilla, and remaining 2 teaspoons cinnamon; continue to beat until well-blended. Add flour, baking soda, and salt; mix until just combined. Stir in walnuts and divide batter evenly into the prepared pans.\n4. Bake in the preheated oven until a toothpick inserted in center comes out clean, about 1 hour.","whole_recipe":"Recipe Name: Banana Sour Cream Bread, \nIngredients: 3.25 cups white sugar, divided, 3 teaspoons ground cinnamon, divided, 0.75 cup butter, 6 very ripe bananas, mashed, 1 (16 ounce) container sour cream, 3 eggs, 2 teaspoons vanilla extract, 4.5 cups all-purpose flour, 3 teaspoons baking soda, 0.5 teaspoon salt, 1 cup chopped walnuts, \nCooking Instructions: 1. Preheat the oven to 300 degrees F (150 degrees C). Grease four 7x3-inch loaf pans.\n2. Mix 1\/4 cup sugar and 1 teaspoon cinnamon together in a small bowl until well combined; dust the greased pans lightly with sugar mixture.\n3. Beat remaining 3 cups sugar and butter together in a large bowl with an electric mixer until smooth. Add mashed bananas, sour cream, eggs, vanilla, and remaining 2 teaspoons cinnamon; continue to beat until well-blended. Add flour, baking soda, and salt; mix until just combined. Stir in walnuts and divide batter evenly into the prepared pans.\n4. Bake in the preheated oven until a toothpick inserted in center comes out clean, about 1 hour., "}
{"recipe_name":"Cinnamon Toast","ingredients":"2 slices white bread, 2 teaspoons butter or margarine, 2 tablespoons white sugar, 1 teaspoon ground cinnamon","instructions":"Toast bread slices in a toaster to desired darkness., Spread butter or margarine onto one side of each slice., Stir together sugar and cinnamon in a small bowl., Sprinkle cinnamon-sugar mixture generously over hot, buttered toast.","step_instructions":"1. Toast bread slices in a toaster to desired darkness.\n2. Spread butter or margarine onto one side of each slice.\n3. Stir together sugar and cinnamon in a small bowl.\n4. Sprinkle cinnamon-sugar mixture generously over hot, buttered toast.","whole_recipe":"Recipe Name: Cinnamon Toast, \nIngredients: 2 slices white bread, 2 teaspoons butter or margarine, 2 tablespoons white sugar, 1 teaspoon ground cinnamon, \nCooking Instructions: 1. Toast bread slices in a toaster to desired darkness.\n2. Spread butter or margarine onto one side of each slice.\n3. Stir together sugar and cinnamon in a small bowl.\n4. Sprinkle cinnamon-sugar mixture generously over hot, buttered toast., "}
{"recipe_name":"Irish Soda Bread Muffins","ingredients":"3 cups all-purpose flour, 1 cup raisins, 0.5 cup white sugar, 2 tablespoons white sugar, 1 tablespoon caraway seeds, 1 tablespoon baking powder, 1 teaspoon salt, 0.25 teaspoon baking soda, 1.75 cups buttermilk, 1 egg, 0.25 cup butter, melted","instructions":"Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners., Mix flour, raisins, 1\/2 cup plus 2 tablespoons sugar, caraway seeds, baking powder, salt, and baking soda in a large bowl., Whisk buttermilk and egg together in a small bowl. Stir into flour mixture. Fold butter into the batter., Spoon batter into the prepared muffin tin., Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes.","step_instructions":"1. Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.\n2. Mix flour, raisins, 1\/2 cup plus 2 tablespoons sugar, caraway seeds, baking powder, salt, and baking soda in a large bowl.\n3. Whisk buttermilk and egg together in a small bowl. Stir into flour mixture. Fold butter into the batter.\n4. Spoon batter into the prepared muffin tin.\n5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes.","whole_recipe":"Recipe Name: Irish Soda Bread Muffins, \nIngredients: 3 cups all-purpose flour, 1 cup raisins, 0.5 cup white sugar, 2 tablespoons white sugar, 1 tablespoon caraway seeds, 1 tablespoon baking powder, 1 teaspoon salt, 0.25 teaspoon baking soda, 1.75 cups buttermilk, 1 egg, 0.25 cup butter, melted, \nCooking Instructions: 1. Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.\n2. Mix flour, raisins, 1\/2 cup plus 2 tablespoons sugar, caraway seeds, baking powder, salt, and baking soda in a large bowl.\n3. Whisk buttermilk and egg together in a small bowl. Stir into flour mixture. Fold butter into the batter.\n4. Spoon batter into the prepared muffin tin.\n5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes., "}
{"recipe_name":"Quick Cinnamon Rolls","ingredients":"0.25 cup butter, divided, 2 cups all-purpose flour, or more as needed, 2 tablespoons white sugar, 2 teaspoons baking powder, 1 teaspoon salt, 3 tablespoons butter, softened, 0.75 cup milk, 1 egg, 0.5 cup white sugar, 0.5 cup brown sugar, 1 tablespoon ground cinnamon, 1 cup confectioners' sugar, 4 ounces cream cheese, softened, 0.25 cup butter, softened, 0.5 teaspoon vanilla extract","instructions":"Preheat the oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons of the melted butter., To make the dough: Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands., Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms., Turn dough out onto a well-floured work surface and roll dough into a 1\/4-inch thick rectangle. Brush surface of dough with remaining 2 tablespoons melted butter., To make the filling: Whisk 1\/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1\/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough., Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish., Bake in the preheated oven until rolls are set, 20 to 25 minutes., To make the frosting: Beat confectioners' sugar, cream cheese, 1\/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth., Top hot cinnamon rolls with cream cheese frosting.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons of the melted butter.\n2. To make the dough: Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands.\n3. Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms.\n4. Turn dough out onto a well-floured work surface and roll dough into a 1\/4-inch thick rectangle. Brush surface of dough with remaining 2 tablespoons melted butter.\n5. To make the filling: Whisk 1\/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1\/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough.\n6. Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish.\n7. Bake in the preheated oven until rolls are set, 20 to 25 minutes.\n8. To make the frosting: Beat confectioners' sugar, cream cheese, 1\/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth.\n9. Top hot cinnamon rolls with cream cheese frosting.","whole_recipe":"Recipe Name: Quick Cinnamon Rolls, \nIngredients: 0.25 cup butter, divided, 2 cups all-purpose flour, or more as needed, 2 tablespoons white sugar, 2 teaspoons baking powder, 1 teaspoon salt, 3 tablespoons butter, softened, 0.75 cup milk, 1 egg, 0.5 cup white sugar, 0.5 cup brown sugar, 1 tablespoon ground cinnamon, 1 cup confectioners' sugar, 4 ounces cream cheese, softened, 0.25 cup butter, softened, 0.5 teaspoon vanilla extract, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons of the melted butter.\n2. To make the dough: Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands.\n3. Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms.\n4. Turn dough out onto a well-floured work surface and roll dough into a 1\/4-inch thick rectangle. Brush surface of dough with remaining 2 tablespoons melted butter.\n5. To make the filling: Whisk 1\/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1\/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough.\n6. Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish.\n7. Bake in the preheated oven until rolls are set, 20 to 25 minutes.\n8. To make the frosting: Beat confectioners' sugar, cream cheese, 1\/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth.\n9. Top hot cinnamon rolls with cream cheese frosting., "}
{"recipe_name":"Basic Biscuits","ingredients":"2 cups all-purpose flour, 1 tablespoon baking powder, 0.5 teaspoon salt, 0.5 cup shortening, 0.75 cup cold milk","instructions":"Gather all ingredients and preheat oven to 450 degrees F (230 degrees C)., In a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs., Pour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl., Turn dough out onto a lightly floured surface and knead dough briefly, 5 to 7 times., Roll dough out into a 1\/2 inch thick sheet and cut out biscuits with a floured cookie cutter. Press together unused dough and repeat rolling and cutting procedure., Place biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes., Enjoy!","step_instructions":"1. Gather all ingredients and preheat oven to 450 degrees F (230 degrees C).\n2. In a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.\n3. Pour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.\n4. Turn dough out onto a lightly floured surface and knead dough briefly, 5 to 7 times.\n5. Roll dough out into a 1\/2 inch thick sheet and cut out biscuits with a floured cookie cutter. Press together unused dough and repeat rolling and cutting procedure.\n6. Place biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes.\n7. Enjoy!","whole_recipe":"Recipe Name: Basic Biscuits, \nIngredients: 2 cups all-purpose flour, 1 tablespoon baking powder, 0.5 teaspoon salt, 0.5 cup shortening, 0.75 cup cold milk, \nCooking Instructions: 1. Gather all ingredients and preheat oven to 450 degrees F (230 degrees C).\n2. In a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.\n3. Pour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.\n4. Turn dough out onto a lightly floured surface and knead dough briefly, 5 to 7 times.\n5. Roll dough out into a 1\/2 inch thick sheet and cut out biscuits with a floured cookie cutter. Press together unused dough and repeat rolling and cutting procedure.\n6. Place biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes.\n7. Enjoy!, "}
{"recipe_name":"Irish Soda Bread IV","ingredients":"4 cups all-purpose flour, 0.66666668653488 cup white sugar, 0.5 cup margarine, 5 teaspoons baking powder, 2 eggs, 1 teaspoon baking soda, 0.5 teaspoon salt, 2 tablespoons caraway seed, 2.5 cups raisins, 2 cups buttermilk, 3 tablespoons milk, 3 tablespoons sour cream","instructions":"Combine flour, sugar, baking powder, baking soda, and salt in a large bowl. Use fingers or a pastry cutter to press in butter or margarine, like a pie crust. When mixture looks fine and crumbly, add raisins and caraway seeds. Mix together and then add eggs, buttermilk, and sour cream. If mixture is not moist, add milk. Pour into two greased and lightly floured loaf pans or a frying pan., Bake at 375 degrees F (190 degrees C) for 45 to 60 minutes, or until a toothpick inserted in the bread comes out clean.","step_instructions":"1. Combine flour, sugar, baking powder, baking soda, and salt in a large bowl. Use fingers or a pastry cutter to press in butter or margarine, like a pie crust. When mixture looks fine and crumbly, add raisins and caraway seeds. Mix together and then add eggs, buttermilk, and sour cream. If mixture is not moist, add milk. Pour into two greased and lightly floured loaf pans or a frying pan.\n2. Bake at 375 degrees F (190 degrees C) for 45 to 60 minutes, or until a toothpick inserted in the bread comes out clean.","whole_recipe":"Recipe Name: Irish Soda Bread IV, \nIngredients: 4 cups all-purpose flour, 0.66666668653488 cup white sugar, 0.5 cup margarine, 5 teaspoons baking powder, 2 eggs, 1 teaspoon baking soda, 0.5 teaspoon salt, 2 tablespoons caraway seed, 2.5 cups raisins, 2 cups buttermilk, 3 tablespoons milk, 3 tablespoons sour cream, \nCooking Instructions: 1. Combine flour, sugar, baking powder, baking soda, and salt in a large bowl. Use fingers or a pastry cutter to press in butter or margarine, like a pie crust. When mixture looks fine and crumbly, add raisins and caraway seeds. Mix together and then add eggs, buttermilk, and sour cream. If mixture is not moist, add milk. Pour into two greased and lightly floured loaf pans or a frying pan.\n2. Bake at 375 degrees F (190 degrees C) for 45 to 60 minutes, or until a toothpick inserted in the bread comes out clean., "}
{"recipe_name":"Banana Bread - Quick Bread for Machines","ingredients":"2 bananas, peeled and halved lengthwise, 2 cups all-purpose flour, 0.75 cup white sugar, 2 large eggs, 3 tablespoons vegetable oil, 1 teaspoon baking powder, 0.5 teaspoon baking soda","instructions":"Place bananas, flour, sugar, eggs, oil, baking powder, and baking soda in the pan of the bread machine., Select Dough setting; press Start. Mix dough until well combined and bananas are mashed, 3 to 5 minutes. Use a rubber spatula to push dough from the sides of the bread pan if necessary. Press Stop, then smooth out the top of the loaf with a rubber spatula., Select Bake setting; press Start. Bake in the bread machine until a toothpick inserted into the center comes out clean, about 50 minutes. If there is batter on the toothpick, reset the machine on Bake and continue baking for 10 to 15 minutes., Remove the pan from the machine. Allow bread to remain in the pan for 10 minutes before transferring it to a wire rack to cool completely.","step_instructions":"1. Place bananas, flour, sugar, eggs, oil, baking powder, and baking soda in the pan of the bread machine.\n2. Select Dough setting; press Start. Mix dough until well combined and bananas are mashed, 3 to 5 minutes. Use a rubber spatula to push dough from the sides of the bread pan if necessary. Press Stop, then smooth out the top of the loaf with a rubber spatula.\n3. Select Bake setting; press Start. Bake in the bread machine until a toothpick inserted into the center comes out clean, about 50 minutes. If there is batter on the toothpick, reset the machine on Bake and continue baking for 10 to 15 minutes.\n4. Remove the pan from the machine. Allow bread to remain in the pan for 10 minutes before transferring it to a wire rack to cool completely.","whole_recipe":"Recipe Name: Banana Bread - Quick Bread for Machines, \nIngredients: 2 bananas, peeled and halved lengthwise, 2 cups all-purpose flour, 0.75 cup white sugar, 2 large eggs, 3 tablespoons vegetable oil, 1 teaspoon baking powder, 0.5 teaspoon baking soda, \nCooking Instructions: 1. Place bananas, flour, sugar, eggs, oil, baking powder, and baking soda in the pan of the bread machine.\n2. Select Dough setting; press Start. Mix dough until well combined and bananas are mashed, 3 to 5 minutes. Use a rubber spatula to push dough from the sides of the bread pan if necessary. Press Stop, then smooth out the top of the loaf with a rubber spatula.\n3. Select Bake setting; press Start. Bake in the bread machine until a toothpick inserted into the center comes out clean, about 50 minutes. If there is batter on the toothpick, reset the machine on Bake and continue baking for 10 to 15 minutes.\n4. Remove the pan from the machine. Allow bread to remain in the pan for 10 minutes before transferring it to a wire rack to cool completely., "}
{"recipe_name":"Brennan's Irish Soda Bread","ingredients":"1 cup milk, 2 tablespoons distilled white vinegar, 2 cups all-purpose flour, 1 tablespoon white sugar, 0.5 teaspoon baking soda, 0.5 teaspoon salt","instructions":"Stir milk and vinegar together in a small bowl; allow to stand until curdled, about 10 minutes., Meanwhile, preheat the oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet., Whisk flour, sugar, baking soda, and salt together in a bowl; gradually stir in soured milk until dough just comes together. Turn dough out onto a well-floured surface; knead lightly and shape into a round., Transfer dough to the prepared baking sheet. Cut an \"X\" into the top of the dough to release steam and help the bread keep its round shape while baking., Bake in the preheated oven until golden brown and the bottom of the loaf sounds hollow when tapped, about 45 minutes.","step_instructions":"1. Stir milk and vinegar together in a small bowl; allow to stand until curdled, about 10 minutes.\n2. Meanwhile, preheat the oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\n3. Whisk flour, sugar, baking soda, and salt together in a bowl; gradually stir in soured milk until dough just comes together. Turn dough out onto a well-floured surface; knead lightly and shape into a round.\n4. Transfer dough to the prepared baking sheet. Cut an \"X\" into the top of the dough to release steam and help the bread keep its round shape while baking.\n5. Bake in the preheated oven until golden brown and the bottom of the loaf sounds hollow when tapped, about 45 minutes.","whole_recipe":"Recipe Name: Brennan's Irish Soda Bread, \nIngredients: 1 cup milk, 2 tablespoons distilled white vinegar, 2 cups all-purpose flour, 1 tablespoon white sugar, 0.5 teaspoon baking soda, 0.5 teaspoon salt, \nCooking Instructions: 1. Stir milk and vinegar together in a small bowl; allow to stand until curdled, about 10 minutes.\n2. Meanwhile, preheat the oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\n3. Whisk flour, sugar, baking soda, and salt together in a bowl; gradually stir in soured milk until dough just comes together. Turn dough out onto a well-floured surface; knead lightly and shape into a round.\n4. Transfer dough to the prepared baking sheet. Cut an \"X\" into the top of the dough to release steam and help the bread keep its round shape while baking.\n5. Bake in the preheated oven until golden brown and the bottom of the loaf sounds hollow when tapped, about 45 minutes., "}
{"recipe_name":"Simple Scones","ingredients":"2 cups all-purpose flour, 0.33333334326744 cup sugar, 1 teaspoon baking powder, 0.5 teaspoon salt, 0.25 teaspoon baking soda, 8 tablespoons unsalted butter, frozen, 0.5 cup raisins (or dried currants), 0.5 cup sour cream, 1 large egg, 1 teaspoon white sugar","instructions":"Preheat the oven to 400 degrees F (200 degrees C); adjust the oven rack to the lower-middle position. Line a baking tray with parchment paper., Mix flour, 1\/3 cup sugar, baking powder, salt, and baking soda in a medium bowl. Grate butter into flour mixture on the large holes of a box grater. Use your fingers to work in butter until mixture resembles coarse crumbs, then toss in raisins., Whisk sour cream and egg together in a small bowl until combined., Stir sour cream mixture into flour mixture using a fork until large dough clumps form. Use your hands to shape dough into a ball. (Dough may seem dry at first but will come together as you work it.), Place dough on a lightly floured surface and pat into a 7- to 8-inch circle, about 3\/4-inch thick. Sprinkle with remaining 1 teaspoon of sugar. Use a sharp knife to cut into 8 equal triangles; place on the prepared baking tray, about 1-inch apart., Bake scones in the preheated oven until golden, about 15 to 17 minutes. Cool for 5 minutes; serve warm or at room temperature.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C); adjust the oven rack to the lower-middle position. Line a baking tray with parchment paper.\n2. Mix flour, 1\/3 cup sugar, baking powder, salt, and baking soda in a medium bowl. Grate butter into flour mixture on the large holes of a box grater. Use your fingers to work in butter until mixture resembles coarse crumbs, then toss in raisins.\n3. Whisk sour cream and egg together in a small bowl until combined.\n4. Stir sour cream mixture into flour mixture using a fork until large dough clumps form. Use your hands to shape dough into a ball. (Dough may seem dry at first but will come together as you work it.)\n5. Place dough on a lightly floured surface and pat into a 7- to 8-inch circle, about 3\/4-inch thick. Sprinkle with remaining 1 teaspoon of sugar. Use a sharp knife to cut into 8 equal triangles; place on the prepared baking tray, about 1-inch apart.\n6. Bake scones in the preheated oven until golden, about 15 to 17 minutes. Cool for 5 minutes; serve warm or at room temperature.","whole_recipe":"Recipe Name: Simple Scones, \nIngredients: 2 cups all-purpose flour, 0.33333334326744 cup sugar, 1 teaspoon baking powder, 0.5 teaspoon salt, 0.25 teaspoon baking soda, 8 tablespoons unsalted butter, frozen, 0.5 cup raisins (or dried currants), 0.5 cup sour cream, 1 large egg, 1 teaspoon white sugar, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C); adjust the oven rack to the lower-middle position. Line a baking tray with parchment paper.\n2. Mix flour, 1\/3 cup sugar, baking powder, salt, and baking soda in a medium bowl. Grate butter into flour mixture on the large holes of a box grater. Use your fingers to work in butter until mixture resembles coarse crumbs, then toss in raisins.\n3. Whisk sour cream and egg together in a small bowl until combined.\n4. Stir sour cream mixture into flour mixture using a fork until large dough clumps form. Use your hands to shape dough into a ball. (Dough may seem dry at first but will come together as you work it.)\n5. Place dough on a lightly floured surface and pat into a 7- to 8-inch circle, about 3\/4-inch thick. Sprinkle with remaining 1 teaspoon of sugar. Use a sharp knife to cut into 8 equal triangles; place on the prepared baking tray, about 1-inch apart.\n6. Bake scones in the preheated oven until golden, about 15 to 17 minutes. Cool for 5 minutes; serve warm or at room temperature., "}
{"recipe_name":"Oatmeal Soda Bread","ingredients":"3.5 cups all-purpose flour, 0.5 cup quick cooking oats, 1 teaspoon salt, 1 teaspoon baking powder, 1 teaspoon baking soda, 1 (8 ounce) container low-fat sour cream, 0.75 cup skim milk, 2 tablespoons honey, 1 tablespoon white sugar, 0.25 cup butter, melted, 2 tablespoons butter, melted","instructions":"Preheat oven to 375 degrees F (190 degrees C)., In a large bowl, mix together flour, 1\/2 cup oats, salt, baking powder, and baking soda., In another bowl, mix together sour cream, milk, honey, and sugar. Add to the flour mixture, and mix just until well blended. Stir in melted butter or margarine., Turn dough onto a lightly sprayed baking sheet. Shape into a round, lightly mounded circle, about 8 inches diameter. Brush the top of the loaf with melted butter or margarine, and sprinkle with remaining 1 tablespoon oats. With a knife, score the top of the loaf into quarters., Bake for about 40 minutes, or until browned. Cool completely before slicing.","step_instructions":"1. Preheat oven to 375 degrees F (190 degrees C).\n2. In a large bowl, mix together flour, 1\/2 cup oats, salt, baking powder, and baking soda.\n3. In another bowl, mix together sour cream, milk, honey, and sugar. Add to the flour mixture, and mix just until well blended. Stir in melted butter or margarine.\n4. Turn dough onto a lightly sprayed baking sheet. Shape into a round, lightly mounded circle, about 8 inches diameter. Brush the top of the loaf with melted butter or margarine, and sprinkle with remaining 1 tablespoon oats. With a knife, score the top of the loaf into quarters.\n5. Bake for about 40 minutes, or until browned. Cool completely before slicing.","whole_recipe":"Recipe Name: Oatmeal Soda Bread, \nIngredients: 3.5 cups all-purpose flour, 0.5 cup quick cooking oats, 1 teaspoon salt, 1 teaspoon baking powder, 1 teaspoon baking soda, 1 (8 ounce) container low-fat sour cream, 0.75 cup skim milk, 2 tablespoons honey, 1 tablespoon white sugar, 0.25 cup butter, melted, 2 tablespoons butter, melted, \nCooking Instructions: 1. Preheat oven to 375 degrees F (190 degrees C).\n2. In a large bowl, mix together flour, 1\/2 cup oats, salt, baking powder, and baking soda.\n3. In another bowl, mix together sour cream, milk, honey, and sugar. Add to the flour mixture, and mix just until well blended. Stir in melted butter or margarine.\n4. Turn dough onto a lightly sprayed baking sheet. Shape into a round, lightly mounded circle, about 8 inches diameter. Brush the top of the loaf with melted butter or margarine, and sprinkle with remaining 1 tablespoon oats. With a knife, score the top of the loaf into quarters.\n5. Bake for about 40 minutes, or until browned. Cool completely before slicing., "}
{"recipe_name":"Irresistible Irish Soda Bread","ingredients":"3 cups all-purpose flour, 1 tablespoon baking powder, 0.33333334326744 cup white sugar, 1 teaspoon salt, 1 teaspoon baking soda, 1 egg, lightly beaten, 2 cups buttermilk, 0.25 cup butter, melted","instructions":"Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan., Combine flour, baking powder, sugar, salt, and baking soda in a large bowl. Blend egg and buttermilk together; add all at once to the flour mixture and mix just until moistened. Stir in butter. Pour into prepared pan., Bake in the preheated oven until the top is golden brown, about 65 to 70 minutes. A toothpick inserted into the bread should come out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor.","step_instructions":"1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.\n2. Combine flour, baking powder, sugar, salt, and baking soda in a large bowl. Blend egg and buttermilk together; add all at once to the flour mixture and mix just until moistened. Stir in butter. Pour into prepared pan.\n3. Bake in the preheated oven until the top is golden brown, about 65 to 70 minutes. A toothpick inserted into the bread should come out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor.","whole_recipe":"Recipe Name: Irresistible Irish Soda Bread, \nIngredients: 3 cups all-purpose flour, 1 tablespoon baking powder, 0.33333334326744 cup white sugar, 1 teaspoon salt, 1 teaspoon baking soda, 1 egg, lightly beaten, 2 cups buttermilk, 0.25 cup butter, melted, \nCooking Instructions: 1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.\n2. Combine flour, baking powder, sugar, salt, and baking soda in a large bowl. Blend egg and buttermilk together; add all at once to the flour mixture and mix just until moistened. Stir in butter. Pour into prepared pan.\n3. Bake in the preheated oven until the top is golden brown, about 65 to 70 minutes. A toothpick inserted into the bread should come out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor., "}
{"recipe_name":"Irish Soda Bread","ingredients":"4 cups all-purpose flour, 1 cup white sugar, 2 teaspoons baking powder, 1 teaspoon baking soda, 0.5 teaspoon salt, 1 pint sour cream, 1 cup raisins, 3 eggs","instructions":"Preheat the oven to 325 degrees F (165 degrees C). Grease two 8x4-inch loaf pans., Mix flour, sugar, baking powder, baking soda, and salt. Add sour cream, raisins, and eggs; mix until just combined. Distribute batter evenly between the prepared pans., Bake loaves in the preheated oven for 1 hour.","step_instructions":"1. Preheat the oven to 325 degrees F (165 degrees C). Grease two 8x4-inch loaf pans.\n2. Mix flour, sugar, baking powder, baking soda, and salt. Add sour cream, raisins, and eggs; mix until just combined. Distribute batter evenly between the prepared pans.\n3. Bake loaves in the preheated oven for 1 hour.","whole_recipe":"Recipe Name: Irish Soda Bread, \nIngredients: 4 cups all-purpose flour, 1 cup white sugar, 2 teaspoons baking powder, 1 teaspoon baking soda, 0.5 teaspoon salt, 1 pint sour cream, 1 cup raisins, 3 eggs, \nCooking Instructions: 1. Preheat the oven to 325 degrees F (165 degrees C). Grease two 8x4-inch loaf pans.\n2. Mix flour, sugar, baking powder, baking soda, and salt. Add sour cream, raisins, and eggs; mix until just combined. Distribute batter evenly between the prepared pans.\n3. Bake loaves in the preheated oven for 1 hour., "}
{"recipe_name":"Real Traditional Irish Soda Bread","ingredients":"2 cups all-purpose flour, 1 pinch salt, 1 teaspoon baking soda, 1 cup buttermilk","instructions":"Heat a heavy skillet, griddle, or cast-iron frying pan over medium-low heat., Stir the flour and salt together in a bowl, and sift in the baking soda. Make a well in the center of the flour mixture, and pour in the buttermilk. Stir the mixture quickly together into a dough, and turn out onto a floured work surface. Knead the dough a few times, just until it comes together. Gently form the dough into a flattened, round cake about 1\/2 inch thick, and cut the round into quarters with a floured knife., Sprinkle a little bit of flour into the bottom of the hot skillet, and cook the wedges 6 to 8 minutes per side, until golden brown.","step_instructions":"1. Heat a heavy skillet, griddle, or cast-iron frying pan over medium-low heat.\n2. Stir the flour and salt together in a bowl, and sift in the baking soda. Make a well in the center of the flour mixture, and pour in the buttermilk. Stir the mixture quickly together into a dough, and turn out onto a floured work surface. Knead the dough a few times, just until it comes together. Gently form the dough into a flattened, round cake about 1\/2 inch thick, and cut the round into quarters with a floured knife.\n3. Sprinkle a little bit of flour into the bottom of the hot skillet, and cook the wedges 6 to 8 minutes per side, until golden brown.","whole_recipe":"Recipe Name: Real Traditional Irish Soda Bread, \nIngredients: 2 cups all-purpose flour, 1 pinch salt, 1 teaspoon baking soda, 1 cup buttermilk, \nCooking Instructions: 1. Heat a heavy skillet, griddle, or cast-iron frying pan over medium-low heat.\n2. Stir the flour and salt together in a bowl, and sift in the baking soda. Make a well in the center of the flour mixture, and pour in the buttermilk. Stir the mixture quickly together into a dough, and turn out onto a floured work surface. Knead the dough a few times, just until it comes together. Gently form the dough into a flattened, round cake about 1\/2 inch thick, and cut the round into quarters with a floured knife.\n3. Sprinkle a little bit of flour into the bottom of the hot skillet, and cook the wedges 6 to 8 minutes per side, until golden brown., "}
{"recipe_name":"Bread Machine Irish Soda Bread","ingredients":"1.5 cups warm water (110 degrees F\/45 degrees C), 2 tablespoons margarine, 2 tablespoons white sugar, 1 teaspoon salt, 4.25 cups bread flour, 2 tablespoons dry milk powder, 3 teaspoons caraway seed, 2 teaspoons active dry yeast, 0.66666668653488 cup raisins","instructions":"Place warm water, margarine, sugar, salt, bread flour, milk powder, caraway seed, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Fruit or Basic cycle, adding raisins when indicated. Remove loaf from the machine after the cycle is done, about 2 hours 55 minutes.","step_instructions":"1. Place warm water, margarine, sugar, salt, bread flour, milk powder, caraway seed, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Fruit or Basic cycle, adding raisins when indicated. Remove loaf from the machine after the cycle is done, about 2 hours 55 minutes.","whole_recipe":"Recipe Name: Bread Machine Irish Soda Bread, \nIngredients: 1.5 cups warm water (110 degrees F\/45 degrees C), 2 tablespoons margarine, 2 tablespoons white sugar, 1 teaspoon salt, 4.25 cups bread flour, 2 tablespoons dry milk powder, 3 teaspoons caraway seed, 2 teaspoons active dry yeast, 0.66666668653488 cup raisins, \nCooking Instructions: 1. Place warm water, margarine, sugar, salt, bread flour, milk powder, caraway seed, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Fruit or Basic cycle, adding raisins when indicated. Remove loaf from the machine after the cycle is done, about 2 hours 55 minutes., "}
{"recipe_name":"Irish Soda Bread from County Cork","ingredients":"3 cups self-rising flour, 0.75 cup white sugar, 0.25 cup butter, 2 cups raisins, 1 egg, 1 cup milk, 1 tablespoon milk","instructions":"Preheat an oven to 375 degrees F (190 degrees C). Grease and flour a 9-inch round baking dish., In a large bowl, cut together the self-rising flour, sugar, and butter with a pastry cutter until the mixture resembles coarse crumbs. Stir in the raisins. In a separate bowl, whisk together egg with 1 cup of milk. Lightly mix the milk mixture into the flour mixture until it holds together. Place dough in prepared baking dish, and brush top with 1 tablespoon of milk for a nice golden brown crust., Place the bread into the preheated oven. Reduce heat to 350 degrees F (175 degrees C), and bake for 1 hour. Let cool before serving.","step_instructions":"1. Preheat an oven to 375 degrees F (190 degrees C). Grease and flour a 9-inch round baking dish.\n2. In a large bowl, cut together the self-rising flour, sugar, and butter with a pastry cutter until the mixture resembles coarse crumbs. Stir in the raisins. In a separate bowl, whisk together egg with 1 cup of milk. Lightly mix the milk mixture into the flour mixture until it holds together. Place dough in prepared baking dish, and brush top with 1 tablespoon of milk for a nice golden brown crust.\n3. Place the bread into the preheated oven. Reduce heat to 350 degrees F (175 degrees C), and bake for 1 hour. Let cool before serving.","whole_recipe":"Recipe Name: Irish Soda Bread from County Cork, \nIngredients: 3 cups self-rising flour, 0.75 cup white sugar, 0.25 cup butter, 2 cups raisins, 1 egg, 1 cup milk, 1 tablespoon milk, \nCooking Instructions: 1. Preheat an oven to 375 degrees F (190 degrees C). Grease and flour a 9-inch round baking dish.\n2. In a large bowl, cut together the self-rising flour, sugar, and butter with a pastry cutter until the mixture resembles coarse crumbs. Stir in the raisins. In a separate bowl, whisk together egg with 1 cup of milk. Lightly mix the milk mixture into the flour mixture until it holds together. Place dough in prepared baking dish, and brush top with 1 tablespoon of milk for a nice golden brown crust.\n3. Place the bread into the preheated oven. Reduce heat to 350 degrees F (175 degrees C), and bake for 1 hour. Let cool before serving., "}
{"recipe_name":"Gluten-Free Irish Soda Bread","ingredients":"1.5 cups white rice flour, 0.5 cup tapioca flour, 0.5 cup white sugar, 1 teaspoon baking soda, 1 teaspoon baking powder, 1 teaspoon salt, 1 egg, 1 cup buttermilk","instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch round cake pan., Combine the rice flour, tapioca flour, sugar, baking soda, baking powder, and salt in a large bowl. In a separate bowl, whisk together egg and buttermilk . Make a well in the center of the dry ingredients and pour in the wet. Stir just until the dry ingredients are moistened. Pour into the cake pan., Bake for 65 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool on a wire rack, for 10 minutes before removing from the pan. Wrap bread in plastic wrap or aluminum foil and let stand overnight for the best flavor.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch round cake pan.\n2. Combine the rice flour, tapioca flour, sugar, baking soda, baking powder, and salt in a large bowl. In a separate bowl, whisk together egg and buttermilk . Make a well in the center of the dry ingredients and pour in the wet. Stir just until the dry ingredients are moistened. Pour into the cake pan.\n3. Bake for 65 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool on a wire rack, for 10 minutes before removing from the pan. Wrap bread in plastic wrap or aluminum foil and let stand overnight for the best flavor.","whole_recipe":"Recipe Name: Gluten-Free Irish Soda Bread, \nIngredients: 1.5 cups white rice flour, 0.5 cup tapioca flour, 0.5 cup white sugar, 1 teaspoon baking soda, 1 teaspoon baking powder, 1 teaspoon salt, 1 egg, 1 cup buttermilk, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch round cake pan.\n2. Combine the rice flour, tapioca flour, sugar, baking soda, baking powder, and salt in a large bowl. In a separate bowl, whisk together egg and buttermilk . Make a well in the center of the dry ingredients and pour in the wet. Stir just until the dry ingredients are moistened. Pour into the cake pan.\n3. Bake for 65 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool on a wire rack, for 10 minutes before removing from the pan. Wrap bread in plastic wrap or aluminum foil and let stand overnight for the best flavor., "}
{"recipe_name":"Grandma McAndrews' Irish Soda Bread","ingredients":"4 cups all-purpose flour, 0.25 cup white sugar, 1 teaspoon baking soda, 2 teaspoons baking powder, 1 teaspoon salt, 2 eggs, 1.25 cups buttermilk, 0.25 cup corn oil, 1 cup raisins","instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper., In a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife., Place the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper.\n2. In a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife.\n3. Place the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes.","whole_recipe":"Recipe Name: Grandma McAndrews' Irish Soda Bread, \nIngredients: 4 cups all-purpose flour, 0.25 cup white sugar, 1 teaspoon baking soda, 2 teaspoons baking powder, 1 teaspoon salt, 2 eggs, 1.25 cups buttermilk, 0.25 cup corn oil, 1 cup raisins, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper.\n2. In a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife.\n3. Place the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes., "}
{"recipe_name":"Individual Hash Brown Breakfast Casseroles","ingredients":"4 cups frozen shredded hash brown potatoes, thawed, 4 tablespoons salted butter, melted, 0.25 teaspoon garlic powder, or to taste, 0.25 teaspoon onion powder, or to taste, 0.5 pound mild Italian sausage (such as Johnsonville®), 0.5 (8 ounce) package fresh mushrooms, chopped, 0.5 medium bell pepper, diced, 8 large eggs, 0.25 cup milk, 0.5 cup shredded Cheddar cheese, 1 tablespoon chopped fresh spinach, 1 pinch herbes de Provence, or to taste, salt and ground black pepper to taste","instructions":"Preheat the oven to 350 degrees F (175 degrees C)., Mix hash browns, butter, garlic powder, and onion powder together in a bowl until well combined. Divide mixture evenly and press into the bottom and up the sides of a 12-cup muffin tin., Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until no longer pink, about 5 minutes. Add mushrooms and bell pepper; saute until softened, 5 to 7 minutes., Whisk eggs and milk together in a large bowl. Mix in sausage mixture, Cheddar cheese, and spinach. Season with herbes de Provence, salt, and pepper. Pour evenly into the muffin cups., Bake in the preheated oven until egg no longer jiggles when the tin is gently shaken, 25 to 30 minutes. Allow to cool slightly before serving.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Mix hash browns, butter, garlic powder, and onion powder together in a bowl until well combined. Divide mixture evenly and press into the bottom and up the sides of a 12-cup muffin tin.\n3. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until no longer pink, about 5 minutes. Add mushrooms and bell pepper; saute until softened, 5 to 7 minutes.\n4. Whisk eggs and milk together in a large bowl. Mix in sausage mixture, Cheddar cheese, and spinach. Season with herbes de Provence, salt, and pepper. Pour evenly into the muffin cups.\n5. Bake in the preheated oven until egg no longer jiggles when the tin is gently shaken, 25 to 30 minutes. Allow to cool slightly before serving.","whole_recipe":"Recipe Name: Individual Hash Brown Breakfast Casseroles, \nIngredients: 4 cups frozen shredded hash brown potatoes, thawed, 4 tablespoons salted butter, melted, 0.25 teaspoon garlic powder, or to taste, 0.25 teaspoon onion powder, or to taste, 0.5 pound mild Italian sausage (such as Johnsonville®), 0.5 (8 ounce) package fresh mushrooms, chopped, 0.5 medium bell pepper, diced, 8 large eggs, 0.25 cup milk, 0.5 cup shredded Cheddar cheese, 1 tablespoon chopped fresh spinach, 1 pinch herbes de Provence, or to taste, salt and ground black pepper to taste, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Mix hash browns, butter, garlic powder, and onion powder together in a bowl until well combined. Divide mixture evenly and press into the bottom and up the sides of a 12-cup muffin tin.\n3. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until no longer pink, about 5 minutes. Add mushrooms and bell pepper; saute until softened, 5 to 7 minutes.\n4. Whisk eggs and milk together in a large bowl. Mix in sausage mixture, Cheddar cheese, and spinach. Season with herbes de Provence, salt, and pepper. Pour evenly into the muffin cups.\n5. Bake in the preheated oven until egg no longer jiggles when the tin is gently shaken, 25 to 30 minutes. Allow to cool slightly before serving., "}
{"recipe_name":"The World's Best Irish Soda Bread","ingredients":"1 tablespoon cornmeal, or as needed, 1.5 cups unbleached all-purpose flour, 1.5 cups white whole wheat flour, 1 cup old-fashioned rolled oats, 0.33333334326744 cup brown sugar, 1 teaspoon baking soda, 1 teaspoon salt, 0.25 cup butter, cut into pieces, 1.25 cups buttermilk, 1 teaspoon unbleached all-purpose flour for dusting","instructions":"Preheat oven to 350 degrees F (175 degrees C). Sprinkle cornmeal onto a baking sheet or spray with cooking spray., Combine 1 1\/2 cups all-purpose flour, whole wheat flour, oats, brown sugar, baking soda, and salt together in a large bowl. Cut butter into flour mixture using a pastry blender or your fingers until mixture resembles coarse crumbs., Stir buttermilk into flour mixture using a fork just until dough is blended; knead 5 times in the bowl. Turn dough onto a floured surface; knead dough using floured hands 8 to 10 times; shape into a 6- to 8-inch loaf., Place loaf on the prepared baking sheet and sprinkle about 1 teaspoon flour over loaf. Cut a long 'x' over the top of the loaf using a serrated knife., Bake in the preheated oven until bread is golden, sounds hollow when top is tapped, and internal temperature is 190 degrees F (88 degrees C), 45 to 50 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Sprinkle cornmeal onto a baking sheet or spray with cooking spray.\n2. Combine 1 1\/2 cups all-purpose flour, whole wheat flour, oats, brown sugar, baking soda, and salt together in a large bowl. Cut butter into flour mixture using a pastry blender or your fingers until mixture resembles coarse crumbs.\n3. Stir buttermilk into flour mixture using a fork just until dough is blended; knead 5 times in the bowl. Turn dough onto a floured surface; knead dough using floured hands 8 to 10 times; shape into a 6- to 8-inch loaf.\n4. Place loaf on the prepared baking sheet and sprinkle about 1 teaspoon flour over loaf. Cut a long 'x' over the top of the loaf using a serrated knife.\n5. Bake in the preheated oven until bread is golden, sounds hollow when top is tapped, and internal temperature is 190 degrees F (88 degrees C), 45 to 50 minutes.","whole_recipe":"Recipe Name: The World's Best Irish Soda Bread, \nIngredients: 1 tablespoon cornmeal, or as needed, 1.5 cups unbleached all-purpose flour, 1.5 cups white whole wheat flour, 1 cup old-fashioned rolled oats, 0.33333334326744 cup brown sugar, 1 teaspoon baking soda, 1 teaspoon salt, 0.25 cup butter, cut into pieces, 1.25 cups buttermilk, 1 teaspoon unbleached all-purpose flour for dusting, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Sprinkle cornmeal onto a baking sheet or spray with cooking spray.\n2. Combine 1 1\/2 cups all-purpose flour, whole wheat flour, oats, brown sugar, baking soda, and salt together in a large bowl. Cut butter into flour mixture using a pastry blender or your fingers until mixture resembles coarse crumbs.\n3. Stir buttermilk into flour mixture using a fork just until dough is blended; knead 5 times in the bowl. Turn dough onto a floured surface; knead dough using floured hands 8 to 10 times; shape into a 6- to 8-inch loaf.\n4. Place loaf on the prepared baking sheet and sprinkle about 1 teaspoon flour over loaf. Cut a long 'x' over the top of the loaf using a serrated knife.\n5. Bake in the preheated oven until bread is golden, sounds hollow when top is tapped, and internal temperature is 190 degrees F (88 degrees C), 45 to 50 minutes., "}
{"recipe_name":"Irish Barmbrack","ingredients":"2.5 cups chopped dried mixed fruit, 1.5 cups hot black tea, 2.5 cups flour, 1 teaspoon ground cinnamon, 0.5 teaspoon ground nutmeg, 0.5 teaspoon baking soda, 1 egg, 1.5 cups sugar, 0.25 cup lemon marmalade, 1 teaspoon grated orange zest","instructions":"Soak dried fruit in hot tea for at least 2 hours to overnight., Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch Bundt pan. Stir flour, cinnamon, nutmeg, and baking soda together; set aside., Lightly beat egg in a large bowl; mix in sugar, marmalade, orange zest, and tea-soaked fruit until well combined. Gently fold in the flour mixture until just combined, then pour into the prepared pan., Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan for 2 hours before removing to a wire rack to cool to room temperature. Press the objects of choice into the cake through the bottom before serving.","step_instructions":"1. Soak dried fruit in hot tea for at least 2 hours to overnight.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch Bundt pan. Stir flour, cinnamon, nutmeg, and baking soda together; set aside.\n3. Lightly beat egg in a large bowl; mix in sugar, marmalade, orange zest, and tea-soaked fruit until well combined. Gently fold in the flour mixture until just combined, then pour into the prepared pan.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan for 2 hours before removing to a wire rack to cool to room temperature. Press the objects of choice into the cake through the bottom before serving.","whole_recipe":"Recipe Name: Irish Barmbrack, \nIngredients: 2.5 cups chopped dried mixed fruit, 1.5 cups hot black tea, 2.5 cups flour, 1 teaspoon ground cinnamon, 0.5 teaspoon ground nutmeg, 0.5 teaspoon baking soda, 1 egg, 1.5 cups sugar, 0.25 cup lemon marmalade, 1 teaspoon grated orange zest, \nCooking Instructions: 1. Soak dried fruit in hot tea for at least 2 hours to overnight.\n2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch Bundt pan. Stir flour, cinnamon, nutmeg, and baking soda together; set aside.\n3. Lightly beat egg in a large bowl; mix in sugar, marmalade, orange zest, and tea-soaked fruit until well combined. Gently fold in the flour mixture until just combined, then pour into the prepared pan.\n4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan for 2 hours before removing to a wire rack to cool to room temperature. Press the objects of choice into the cake through the bottom before serving., "}
{"recipe_name":"Irish Soda Bread in a Skillet","ingredients":"1 cup milk, 1 teaspoon vinegar, 2 cups all-purpose flour, 0.5 teaspoon salt, 0.5 teaspoon baking soda","instructions":"Preheat the oven to 400 degrees F (200 degrees C). In a cup or small bowl, stir together the milk and vinegar. Let stand 10 minutes, or until curdled., In a medium bowl, stir together the flour, salt, and baking soda. Stir in the curdled milk mixture until smooth. Scrape the dough out of the bowl onto a floured surface, and shape into a disc. Place the disc into a cast iron skillet., Bake for 15 minutes in the preheated oven, or until the crust feels firm to the touch.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C). In a cup or small bowl, stir together the milk and vinegar. Let stand 10 minutes, or until curdled.\n2. In a medium bowl, stir together the flour, salt, and baking soda. Stir in the curdled milk mixture until smooth. Scrape the dough out of the bowl onto a floured surface, and shape into a disc. Place the disc into a cast iron skillet.\n3. Bake for 15 minutes in the preheated oven, or until the crust feels firm to the touch.","whole_recipe":"Recipe Name: Irish Soda Bread in a Skillet, \nIngredients: 1 cup milk, 1 teaspoon vinegar, 2 cups all-purpose flour, 0.5 teaspoon salt, 0.5 teaspoon baking soda, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C). In a cup or small bowl, stir together the milk and vinegar. Let stand 10 minutes, or until curdled.\n2. In a medium bowl, stir together the flour, salt, and baking soda. Stir in the curdled milk mixture until smooth. Scrape the dough out of the bowl onto a floured surface, and shape into a disc. Place the disc into a cast iron skillet.\n3. Bake for 15 minutes in the preheated oven, or until the crust feels firm to the touch., "}
{"recipe_name":"Vegetarian Breakfast Casserole with Hash Browns","ingredients":"cooking spray, 4 cups frozen hash brown potatoes, thawed, salt and ground black pepper to taste, 1 tablespoon olive oil, 1 medium yellow onion, chopped, 0.25 teaspoon dried thyme, 0.25 teaspoon salt, 0.125 teaspoon ground black pepper, 4 ounces vegetarian sausage, 1 medium bell pepper, chopped, 1 cup chopped mushrooms, 4 large eggs, 2 large egg whites, 1.5 cups shredded Cheddar cheese, 0.25 teaspoon hot sauce, 1 medium tomato, sliced, 1 teaspoon chopped fresh parsley","instructions":"Preheat the oven to 400 degrees F (200 degrees C). Grease a 9 1\/2-inch square baking dish with cooking spray., Press hash browns into the bottom and up the sides of the prepared dish. Spray with cooking spray and sprinkle with salt and pepper., Bake in the preheated oven until lightly browned and crisp all over, 35 to 45 minutes. Note that the top edges will brown very quickly and become very dark; you can cut that away it it becomes too dark., When the hash browns are baking, heat olive oil in a large skillet over medium heat. Add onion and cook until soft and translucent, 5 to 10 minutes. Add thyme, 1\/4 teaspoon salt, and 1\/8 teaspoon pepper; cook for 1 minute. Add sausage; cook and stir until crumbly and brown, 5 to 7 minutes. Add bell pepper and mushrooms; cook until mushrooms are tender, about 10 minutes. Drain any excess liquid from the skillet., Remove hash browns from the oven. Scoop veggie mixture on top., Combine 4 eggs and 2 egg whites in a bowl with Cheddar cheese and hot sauce. Mix until eggs just come together without being frothy. Pour over veggie mixture and spread evenly., Return to the oven and bake until eggs are just set, 10 to 12 minutes., Remove from the oven and spread sliced tomato over top. Lightly season with salt and pepper and sprinkle with parsley. Return to the oven for 1 minute., Slide a spatula around the edges and slice into 8 pieces. Serve hot.","step_instructions":"1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 9 1\/2-inch square baking dish with cooking spray.\n2. Press hash browns into the bottom and up the sides of the prepared dish. Spray with cooking spray and sprinkle with salt and pepper.\n3. Bake in the preheated oven until lightly browned and crisp all over, 35 to 45 minutes. Note that the top edges will brown very quickly and become very dark; you can cut that away it it becomes too dark.\n4. When the hash browns are baking, heat olive oil in a large skillet over medium heat. Add onion and cook until soft and translucent, 5 to 10 minutes. Add thyme, 1\/4 teaspoon salt, and 1\/8 teaspoon pepper; cook for 1 minute. Add sausage; cook and stir until crumbly and brown, 5 to 7 minutes. Add bell pepper and mushrooms; cook until mushrooms are tender, about 10 minutes. Drain any excess liquid from the skillet.\n5. Remove hash browns from the oven. Scoop veggie mixture on top.\n6. Combine 4 eggs and 2 egg whites in a bowl with Cheddar cheese and hot sauce. Mix until eggs just come together without being frothy. Pour over veggie mixture and spread evenly.\n7. Return to the oven and bake until eggs are just set, 10 to 12 minutes.\n8. Remove from the oven and spread sliced tomato over top. Lightly season with salt and pepper and sprinkle with parsley. Return to the oven for 1 minute.\n9. Slide a spatula around the edges and slice into 8 pieces. Serve hot.","whole_recipe":"Recipe Name: Vegetarian Breakfast Casserole with Hash Browns, \nIngredients: cooking spray, 4 cups frozen hash brown potatoes, thawed, salt and ground black pepper to taste, 1 tablespoon olive oil, 1 medium yellow onion, chopped, 0.25 teaspoon dried thyme, 0.25 teaspoon salt, 0.125 teaspoon ground black pepper, 4 ounces vegetarian sausage, 1 medium bell pepper, chopped, 1 cup chopped mushrooms, 4 large eggs, 2 large egg whites, 1.5 cups shredded Cheddar cheese, 0.25 teaspoon hot sauce, 1 medium tomato, sliced, 1 teaspoon chopped fresh parsley, \nCooking Instructions: 1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 9 1\/2-inch square baking dish with cooking spray.\n2. Press hash browns into the bottom and up the sides of the prepared dish. Spray with cooking spray and sprinkle with salt and pepper.\n3. Bake in the preheated oven until lightly browned and crisp all over, 35 to 45 minutes. Note that the top edges will brown very quickly and become very dark; you can cut that away it it becomes too dark.\n4. When the hash browns are baking, heat olive oil in a large skillet over medium heat. Add onion and cook until soft and translucent, 5 to 10 minutes. Add thyme, 1\/4 teaspoon salt, and 1\/8 teaspoon pepper; cook for 1 minute. Add sausage; cook and stir until crumbly and brown, 5 to 7 minutes. Add bell pepper and mushrooms; cook until mushrooms are tender, about 10 minutes. Drain any excess liquid from the skillet.\n5. Remove hash browns from the oven. Scoop veggie mixture on top.\n6. Combine 4 eggs and 2 egg whites in a bowl with Cheddar cheese and hot sauce. Mix until eggs just come together without being frothy. Pour over veggie mixture and spread evenly.\n7. Return to the oven and bake until eggs are just set, 10 to 12 minutes.\n8. Remove from the oven and spread sliced tomato over top. Lightly season with salt and pepper and sprinkle with parsley. Return to the oven for 1 minute.\n9. Slide a spatula around the edges and slice into 8 pieces. Serve hot., "}
{"recipe_name":"\"Thousand Layer\" Chocolate Brioche","ingredients":"0.75 cup warm whole milk, 1 package active dry yeast, 4.5 cups all-purpose flour, 3 large eggs, beaten, 0.33 cup white granulated sugar, 1 teaspoon fine salt, 6 tablespoons unsalted butter, very soft, 4 tablespoons unsalted butter for laminating dough, 0.5 cup dark chocolate chunks, 1 large whole egg for brushing, coarse sea salt, white granulated sugar","instructions":"Combine warm milk and dry active yeast in the bowl of your stand mixer; let stand for 10 minutes. Add flour, eggs, sugar, and salt. Use the dough hook to knead the mixture until the flour almost disappears, about 1 minute. Add the soft room temperature butter, and continue kneading the dough until a very smooth ball of dough forms, 4 to 5 minutes., Set dough into a lightly buttered bowl, cover, and let rise in a warm spot until doubled in size, 2 to 3 hours., Punch down the dough and divide in 2 pieces. Form each half into a smooth ball and transfer each one into a plastic bag. Refrigerate bags overnight for best results or the dough can be used immediately. Each half of the dough will make 4 brioche., When ready to make, roll and stretch dough into a 14 x 10 inch rectangle. Spread 4 tablespoons of soft room temperature butter over two thirds of the dough, stopping 1\/2 inch from the edge., Fold unbuttered third up over the top, and then the opposite end to complete the trifold. Gently press and seal the edges together. Fold in thirds again to form a square. Wrap and place in the freezer until cold and slightly firm, about 15 minutes., Roll the dough out into a rectangle about 1\/4 inch thick, or thin enough to fold, and repeat the two folding in thirds step. Wrap and place in the freezer again until cold and slightly firm, 15 more minutes. A little bit of water can be used to help the dough stick if needed., Roll dough out into a rectangle again, just like in the previous step. Fold into thirds, but keep as a rectangle (do not make the second fold). Wrap and place in the freezer until cold and slightly firm, about 15 minutes., Roll dough into a 12 x 6 inch rectangle and place in the freezer until cold and slightly firm, about 15 minutes., Trim off about 1\/8 inch of dough from the sides and cut into 4 rectangles that are about 6 x 3 inches., Start with 1 piece (keeping the others in the fridge so they stay cool) and make two cuts starting 1\/2 inch from top, all the way to the bottom to create 3 strips of dough. Braid together, and seal at bottom. Flip over and add about 1 tablespoon of dark chocolate chunks along the center of the braided dough, or more to taste. Roll up from the smaller end to create a knot. Place seam side down in buttered muffin tin., After all braids are done, cover, and let rise in a warm spot until doubled in size, about 1 hour., Preheat the oven to 400 degrees F (200 degrees C)., Brush brioche with egg wash, and sprinkle very lightly with some coarse salt. Then sprinkle very generously with the granulated sugar., Bake on the center rack of the preheated oven until nicely browned, 20 to 25 minutes. If brioches are getting too dark, tent with aluminum foil after 15 minutes., Let cool in the pan for about 5 minutes and then transfer onto a rack to cool completely before serving.","step_instructions":"1. Combine warm milk and dry active yeast in the bowl of your stand mixer; let stand for 10 minutes. Add flour, eggs, sugar, and salt. Use the dough hook to knead the mixture until the flour almost disappears, about 1 minute. Add the soft room temperature butter, and continue kneading the dough until a very smooth ball of dough forms, 4 to 5 minutes.\n2. Set dough into a lightly buttered bowl, cover, and let rise in a warm spot until doubled in size, 2 to 3 hours.\n3. Punch down the dough and divide in 2 pieces. Form each half into a smooth ball and transfer each one into a plastic bag. Refrigerate bags overnight for best results or the dough can be used immediately. Each half of the dough will make 4 brioche.\n4. When ready to make, roll and stretch dough into a 14 x 10 inch rectangle. Spread 4 tablespoons of soft room temperature butter over two thirds of the dough, stopping 1\/2 inch from the edge.\n5. Fold unbuttered third up over the top, and then the opposite end to complete the trifold. Gently press and seal the edges together. Fold in thirds again to form a square. Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\n6. Roll the dough out into a rectangle about 1\/4 inch thick, or thin enough to fold, and repeat the two folding in thirds step. Wrap and place in the freezer again until cold and slightly firm, 15 more minutes. A little bit of water can be used to help the dough stick if needed.\n7. Roll dough out into a rectangle again, just like in the previous step. Fold into thirds, but keep as a rectangle (do not make the second fold). Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\n8. Roll dough into a 12 x 6 inch rectangle and place in the freezer until cold and slightly firm, about 15 minutes.\n9. Trim off about 1\/8 inch of dough from the sides and cut into 4 rectangles that are about 6 x 3 inches.\n10. Start with 1 piece (keeping the others in the fridge so they stay cool) and make two cuts starting 1\/2 inch from top, all the way to the bottom to create 3 strips of dough. Braid together, and seal at bottom. Flip over and add about 1 tablespoon of dark chocolate chunks along the center of the braided dough, or more to taste. Roll up from the smaller end to create a knot. Place seam side down in buttered muffin tin.\n11. After all braids are done, cover, and let rise in a warm spot until doubled in size, about 1 hour.\n12. Preheat the oven to 400 degrees F (200 degrees C).\n13. Brush brioche with egg wash, and sprinkle very lightly with some coarse salt. Then sprinkle very generously with the granulated sugar.\n14. Bake on the center rack of the preheated oven until nicely browned, 20 to 25 minutes. If brioches are getting too dark, tent with aluminum foil after 15 minutes.\n15. Let cool in the pan for about 5 minutes and then transfer onto a rack to cool completely before serving.","whole_recipe":"Recipe Name: \"Thousand Layer\" Chocolate Brioche, \nIngredients: 0.75 cup warm whole milk, 1 package active dry yeast, 4.5 cups all-purpose flour, 3 large eggs, beaten, 0.33 cup white granulated sugar, 1 teaspoon fine salt, 6 tablespoons unsalted butter, very soft, 4 tablespoons unsalted butter for laminating dough, 0.5 cup dark chocolate chunks, 1 large whole egg for brushing, coarse sea salt, white granulated sugar, \nCooking Instructions: 1. Combine warm milk and dry active yeast in the bowl of your stand mixer; let stand for 10 minutes. Add flour, eggs, sugar, and salt. Use the dough hook to knead the mixture until the flour almost disappears, about 1 minute. Add the soft room temperature butter, and continue kneading the dough until a very smooth ball of dough forms, 4 to 5 minutes.\n2. Set dough into a lightly buttered bowl, cover, and let rise in a warm spot until doubled in size, 2 to 3 hours.\n3. Punch down the dough and divide in 2 pieces. Form each half into a smooth ball and transfer each one into a plastic bag. Refrigerate bags overnight for best results or the dough can be used immediately. Each half of the dough will make 4 brioche.\n4. When ready to make, roll and stretch dough into a 14 x 10 inch rectangle. Spread 4 tablespoons of soft room temperature butter over two thirds of the dough, stopping 1\/2 inch from the edge.\n5. Fold unbuttered third up over the top, and then the opposite end to complete the trifold. Gently press and seal the edges together. Fold in thirds again to form a square. Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\n6. Roll the dough out into a rectangle about 1\/4 inch thick, or thin enough to fold, and repeat the two folding in thirds step. Wrap and place in the freezer again until cold and slightly firm, 15 more minutes. A little bit of water can be used to help the dough stick if needed.\n7. Roll dough out into a rectangle again, just like in the previous step. Fold into thirds, but keep as a rectangle (do not make the second fold). Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\n8. Roll dough into a 12 x 6 inch rectangle and place in the freezer until cold and slightly firm, about 15 minutes.\n9. Trim off about 1\/8 inch of dough from the sides and cut into 4 rectangles that are about 6 x 3 inches.\n10. Start with 1 piece (keeping the others in the fridge so they stay cool) and make two cuts starting 1\/2 inch from top, all the way to the bottom to create 3 strips of dough. Braid together, and seal at bottom. Flip over and add about 1 tablespoon of dark chocolate chunks along the center of the braided dough, or more to taste. Roll up from the smaller end to create a knot. Place seam side down in buttered muffin tin.\n11. After all braids are done, cover, and let rise in a warm spot until doubled in size, about 1 hour.\n12. Preheat the oven to 400 degrees F (200 degrees C).\n13. Brush brioche with egg wash, and sprinkle very lightly with some coarse salt. Then sprinkle very generously with the granulated sugar.\n14. Bake on the center rack of the preheated oven until nicely browned, 20 to 25 minutes. If brioches are getting too dark, tent with aluminum foil after 15 minutes.\n15. Let cool in the pan for about 5 minutes and then transfer onto a rack to cool completely before serving., "}
{"recipe_name":"Flavorful Tater Tot Casserole","ingredients":"cooking spray, 1 (16 ounce) package pork sausage (such as Owens® Original), 1 small onion, chopped, 1.5 teaspoons minced garlic, 1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®), 1 (12 ounce) package frozen chopped broccoli, thawed, 2 cups shredded Mexican cheese blend, 1 (10.75 ounce) can cream of celery soup, 1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®), 1 pinch ground black and red pepper blend (such as McCormick® Hot Shot®), or to taste","instructions":"Preheat oven to 350 degrees F (175 degrees C). Spray a 2-quart baking dish with cooking spray., Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add onion and garlic; cook and stir until onion is softened, 5 to 10 minutes., Mix tomatoes with green chile peppers, broccoli, Mexican cheese blend, and cream of celery soup into sausage mixture; spread into the prepared baking dish. Arrange potato nuggets over sausage mixture; season with pepper., Bake in the preheated oven until cheese is bubbling and potato nuggets are slightly brown, about 45 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Spray a 2-quart baking dish with cooking spray.\n2. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add onion and garlic; cook and stir until onion is softened, 5 to 10 minutes.\n3. Mix tomatoes with green chile peppers, broccoli, Mexican cheese blend, and cream of celery soup into sausage mixture; spread into the prepared baking dish. Arrange potato nuggets over sausage mixture; season with pepper.\n4. Bake in the preheated oven until cheese is bubbling and potato nuggets are slightly brown, about 45 minutes.","whole_recipe":"Recipe Name: Flavorful Tater Tot Casserole, \nIngredients: cooking spray, 1 (16 ounce) package pork sausage (such as Owens® Original), 1 small onion, chopped, 1.5 teaspoons minced garlic, 1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®), 1 (12 ounce) package frozen chopped broccoli, thawed, 2 cups shredded Mexican cheese blend, 1 (10.75 ounce) can cream of celery soup, 1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®), 1 pinch ground black and red pepper blend (such as McCormick® Hot Shot®), or to taste, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Spray a 2-quart baking dish with cooking spray.\n2. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add onion and garlic; cook and stir until onion is softened, 5 to 10 minutes.\n3. Mix tomatoes with green chile peppers, broccoli, Mexican cheese blend, and cream of celery soup into sausage mixture; spread into the prepared baking dish. Arrange potato nuggets over sausage mixture; season with pepper.\n4. Bake in the preheated oven until cheese is bubbling and potato nuggets are slightly brown, about 45 minutes., "}
{"recipe_name":"Hearty One Pan Breakfast","ingredients":"3 potatoes, peeled, 6 ounces bacon, chopped, 0.5 cup chopped onion, 0.5 cup chopped green bell pepper, 1 teaspoon chopped garlic, 1 cup chopped fresh tomatoes, salt and pepper to taste, 6 ounces Cheddar cheese, shredded, 8 eggs","instructions":"Bring a pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop., Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Add the onions, peppers, garlic, tomatoes, and potatoes. Season with salt and pepper and cook until vegetables are soft, about 5 minutes., Sprinkle vegetable mixture with cheese. Crack eggs into the pan a couple of inches apart. Cover pan and allow eggs to cook to desired firmness. Remove pan from heat and serve.","step_instructions":"1. Bring a pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\n2. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Add the onions, peppers, garlic, tomatoes, and potatoes. Season with salt and pepper and cook until vegetables are soft, about 5 minutes.\n3. Sprinkle vegetable mixture with cheese. Crack eggs into the pan a couple of inches apart. Cover pan and allow eggs to cook to desired firmness. Remove pan from heat and serve.","whole_recipe":"Recipe Name: Hearty One Pan Breakfast, \nIngredients: 3 potatoes, peeled, 6 ounces bacon, chopped, 0.5 cup chopped onion, 0.5 cup chopped green bell pepper, 1 teaspoon chopped garlic, 1 cup chopped fresh tomatoes, salt and pepper to taste, 6 ounces Cheddar cheese, shredded, 8 eggs, \nCooking Instructions: 1. Bring a pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\n2. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Add the onions, peppers, garlic, tomatoes, and potatoes. Season with salt and pepper and cook until vegetables are soft, about 5 minutes.\n3. Sprinkle vegetable mixture with cheese. Crack eggs into the pan a couple of inches apart. Cover pan and allow eggs to cook to desired firmness. Remove pan from heat and serve., "}
{"recipe_name":"New Mexican Breakfast Casserole","ingredients":"2 tablespoons vegetable oil, or more as needed, 1 (26 ounce) package frozen hash browns, 1 onion, chopped, 8 slices bacon, 2 cups shredded Cheddar cheese, 1 (8 ounce) can roasted green chile peppers, chopped, 8 eggs, 12 (8 inch) flour tortillas","instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan., Heat oil in a large skillet over medium heat. Add hash browns and onion; cook and stir until hash browns are crispy, about 10 minutes., Place bacon in a separate skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into smaller pieces., Layer hash brown-onion mixture, bacon pieces, 1 1\/2 cup Cheddar cheese, and green chile peppers in the bottom of the prepared baking pan. Crack eggs, one at a time, on top. Sprinkle remaining 1\/2 cup Cheddar cheese over eggs., Bake in the preheated oven until eggs are firm and cheese starts to brown, 20 to 30 minutes. Serve with flour tortillas.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.\n2. Heat oil in a large skillet over medium heat. Add hash browns and onion; cook and stir until hash browns are crispy, about 10 minutes.\n3. Place bacon in a separate skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into smaller pieces.\n4. Layer hash brown-onion mixture, bacon pieces, 1 1\/2 cup Cheddar cheese, and green chile peppers in the bottom of the prepared baking pan. Crack eggs, one at a time, on top. Sprinkle remaining 1\/2 cup Cheddar cheese over eggs.\n5. Bake in the preheated oven until eggs are firm and cheese starts to brown, 20 to 30 minutes. Serve with flour tortillas.","whole_recipe":"Recipe Name: New Mexican Breakfast Casserole, \nIngredients: 2 tablespoons vegetable oil, or more as needed, 1 (26 ounce) package frozen hash browns, 1 onion, chopped, 8 slices bacon, 2 cups shredded Cheddar cheese, 1 (8 ounce) can roasted green chile peppers, chopped, 8 eggs, 12 (8 inch) flour tortillas, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking pan.\n2. Heat oil in a large skillet over medium heat. Add hash browns and onion; cook and stir until hash browns are crispy, about 10 minutes.\n3. Place bacon in a separate skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into smaller pieces.\n4. Layer hash brown-onion mixture, bacon pieces, 1 1\/2 cup Cheddar cheese, and green chile peppers in the bottom of the prepared baking pan. Crack eggs, one at a time, on top. Sprinkle remaining 1\/2 cup Cheddar cheese over eggs.\n5. Bake in the preheated oven until eggs are firm and cheese starts to brown, 20 to 30 minutes. Serve with flour tortillas., "}
{"recipe_name":"Eggs in a Basket","ingredients":"cooking spray, 3 large potatoes, peeled and grated, 0.25 cup butter, melted, kosher salt and ground black pepper to taste, 6 eggs, 0.75 cup shredded provolone cheese, 6 slices prosciutto, 2 teaspoons maple syrup","instructions":"Preheat oven to 350 degrees F (175 degrees C). Grease a large 6-cup muffin tin with cooking spray., Mix potatoes, melted butter, salt, and pepper together in a large bowl., Divide potato mixture among muffin cups. Press to create a thin crust over the bottom and up the sides of each cup., Bake in the preheated oven until edges are a light golden brown and potatoes are tender, about 30 minutes. Crack an egg gently into each cup. Continue cooking until egg whites are set and yolk is runny, about 6 minutes. Remove from the oven; cover eggs with provolone cheese., Set oven rack about 6 inches from the heat source and preheat the oven's broiler., Toss prosciutto with maple syrup and pepper in a small bowl. Spread out on a small baking sheet lined with aluminum foil., Place muffin tin and baking sheet under the preheated broiler. Broil until cheese is melted and prosciutto is crisp, about 1 minute., Transfer egg baskets to a serving plate. Chop prosciutto and sprinkle on top.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C). Grease a large 6-cup muffin tin with cooking spray.\n2. Mix potatoes, melted butter, salt, and pepper together in a large bowl.\n3. Divide potato mixture among muffin cups. Press to create a thin crust over the bottom and up the sides of each cup.\n4. Bake in the preheated oven until edges are a light golden brown and potatoes are tender, about 30 minutes. Crack an egg gently into each cup. Continue cooking until egg whites are set and yolk is runny, about 6 minutes. Remove from the oven; cover eggs with provolone cheese.\n5. Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\n6. Toss prosciutto with maple syrup and pepper in a small bowl. Spread out on a small baking sheet lined with aluminum foil.\n7. Place muffin tin and baking sheet under the preheated broiler. Broil until cheese is melted and prosciutto is crisp, about 1 minute.\n8. Transfer egg baskets to a serving plate. Chop prosciutto and sprinkle on top.","whole_recipe":"Recipe Name: Eggs in a Basket, \nIngredients: cooking spray, 3 large potatoes, peeled and grated, 0.25 cup butter, melted, kosher salt and ground black pepper to taste, 6 eggs, 0.75 cup shredded provolone cheese, 6 slices prosciutto, 2 teaspoons maple syrup, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C). Grease a large 6-cup muffin tin with cooking spray.\n2. Mix potatoes, melted butter, salt, and pepper together in a large bowl.\n3. Divide potato mixture among muffin cups. Press to create a thin crust over the bottom and up the sides of each cup.\n4. Bake in the preheated oven until edges are a light golden brown and potatoes are tender, about 30 minutes. Crack an egg gently into each cup. Continue cooking until egg whites are set and yolk is runny, about 6 minutes. Remove from the oven; cover eggs with provolone cheese.\n5. Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\n6. Toss prosciutto with maple syrup and pepper in a small bowl. Spread out on a small baking sheet lined with aluminum foil.\n7. Place muffin tin and baking sheet under the preheated broiler. Broil until cheese is melted and prosciutto is crisp, about 1 minute.\n8. Transfer egg baskets to a serving plate. Chop prosciutto and sprinkle on top., "}
{"recipe_name":"Sausage, Potato, and Egg Casserole","ingredients":"cooking spray, 5 medium potatoes, peeled and cubed, 1.5 pounds breakfast sausage, 6 ounces chorizo sausage, 1.5 large green bell peppers, chopped, 1 large onion, chopped, 2 (4 ounce) cans sliced mushrooms, drained, 20 large eggs, 0.5 cup milk, 1 cup shredded Cheddar cheese","instructions":"Preheat the oven to 375 degrees F (190 degrees C). Grease an 11x13-inch baking dish with cooking spray., Place cubed potatoes in a large microwave-safe bowl and partially cover with a lid. Microwave on high for 4 minutes. Remove from the microwave and spread on the bottom of the prepared baking dish., Heat a large skillet over medium-high heat. Cook and stir breakfast and chorizo sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Add bell peppers, onion, and mushrooms. Saute until bell peppers and onion are softened, about 5 minutes. Spread mixture over the potatoes., Beat eggs in a bowl and add milk. Pour beaten eggs over everything in the baking dish and move around a bit with a spoon to evenly disperse. Sprinkle Cheddar cheese over top until well covered. Cover with aluminum foil., Bake in the preheated oven for 30 minutes. Remove foil and bake until egg is set, about 1 more hour. If cheese starts to brown too much, cover again with foil for the rest of the baking time.","step_instructions":"1. Preheat the oven to 375 degrees F (190 degrees C). Grease an 11x13-inch baking dish with cooking spray.\n2. Place cubed potatoes in a large microwave-safe bowl and partially cover with a lid. Microwave on high for 4 minutes. Remove from the microwave and spread on the bottom of the prepared baking dish.\n3. Heat a large skillet over medium-high heat. Cook and stir breakfast and chorizo sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Add bell peppers, onion, and mushrooms. Saute until bell peppers and onion are softened, about 5 minutes. Spread mixture over the potatoes.\n4. Beat eggs in a bowl and add milk. Pour beaten eggs over everything in the baking dish and move around a bit with a spoon to evenly disperse. Sprinkle Cheddar cheese over top until well covered. Cover with aluminum foil.\n5. Bake in the preheated oven for 30 minutes. Remove foil and bake until egg is set, about 1 more hour. If cheese starts to brown too much, cover again with foil for the rest of the baking time.","whole_recipe":"Recipe Name: Sausage, Potato, and Egg Casserole, \nIngredients: cooking spray, 5 medium potatoes, peeled and cubed, 1.5 pounds breakfast sausage, 6 ounces chorizo sausage, 1.5 large green bell peppers, chopped, 1 large onion, chopped, 2 (4 ounce) cans sliced mushrooms, drained, 20 large eggs, 0.5 cup milk, 1 cup shredded Cheddar cheese, \nCooking Instructions: 1. Preheat the oven to 375 degrees F (190 degrees C). Grease an 11x13-inch baking dish with cooking spray.\n2. Place cubed potatoes in a large microwave-safe bowl and partially cover with a lid. Microwave on high for 4 minutes. Remove from the microwave and spread on the bottom of the prepared baking dish.\n3. Heat a large skillet over medium-high heat. Cook and stir breakfast and chorizo sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Add bell peppers, onion, and mushrooms. Saute until bell peppers and onion are softened, about 5 minutes. Spread mixture over the potatoes.\n4. Beat eggs in a bowl and add milk. Pour beaten eggs over everything in the baking dish and move around a bit with a spoon to evenly disperse. Sprinkle Cheddar cheese over top until well covered. Cover with aluminum foil.\n5. Bake in the preheated oven for 30 minutes. Remove foil and bake until egg is set, about 1 more hour. If cheese starts to brown too much, cover again with foil for the rest of the baking time., "}
{"recipe_name":"Creamy Potato Breakfast Casserole","ingredients":"3 pounds potatoes, diced, 2 tablespoons butter, melted, 2 cups chicken stock, 2 (8 ounce) packages cream cheese, cubed, 4 ounces mozzarella cheese, finely chopped, 1 small onion, finely chopped, 0.66666668653488 cup sour cream, 0.33333334326744 cup powdered milk, 2 tablespoons finely chopped fresh chives, 1 teaspoon finely chopped fresh tarragon, 1 teaspoon sea salt, 0.5 teaspoon finely chopped fresh sage, 0.25 teaspoon ground black pepper, 6 eggs, beaten","instructions":"Preheat oven to 350 degrees F (175 degrees C)., Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain., Combine potatoes and butter in a large bowl; stir to coat. Add chicken stock, cream cheese, mozzarella cheese, onion, sour cream, powdered milk, chives, tarragon, sea salt, sage, and black pepper; stir well. Fold in egg until well incorporated. Pour into a 9x13-inch casserole dish., Bake in the preheated oven until browned and eggs are set, 30 to 40 minutes.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C).\n2. Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\n3. Combine potatoes and butter in a large bowl; stir to coat. Add chicken stock, cream cheese, mozzarella cheese, onion, sour cream, powdered milk, chives, tarragon, sea salt, sage, and black pepper; stir well. Fold in egg until well incorporated. Pour into a 9x13-inch casserole dish.\n4. Bake in the preheated oven until browned and eggs are set, 30 to 40 minutes.","whole_recipe":"Recipe Name: Creamy Potato Breakfast Casserole, \nIngredients: 3 pounds potatoes, diced, 2 tablespoons butter, melted, 2 cups chicken stock, 2 (8 ounce) packages cream cheese, cubed, 4 ounces mozzarella cheese, finely chopped, 1 small onion, finely chopped, 0.66666668653488 cup sour cream, 0.33333334326744 cup powdered milk, 2 tablespoons finely chopped fresh chives, 1 teaspoon finely chopped fresh tarragon, 1 teaspoon sea salt, 0.5 teaspoon finely chopped fresh sage, 0.25 teaspoon ground black pepper, 6 eggs, beaten, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C).\n2. Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\n3. Combine potatoes and butter in a large bowl; stir to coat. Add chicken stock, cream cheese, mozzarella cheese, onion, sour cream, powdered milk, chives, tarragon, sea salt, sage, and black pepper; stir well. Fold in egg until well incorporated. Pour into a 9x13-inch casserole dish.\n4. Bake in the preheated oven until browned and eggs are set, 30 to 40 minutes., "}
{"recipe_name":"Mexican-Style Breakfast Casserole","ingredients":"cooking spray, 1 medium onion, chopped, 5 cups shredded hash brown potatoes, 3 cups diced ham, 2 cups shredded taco-flavored cheese, 1 (7 ounce) can diced green chile peppers, 8 large eggs, 1 cup milk, 1 cup sour cream, 1 teaspoon taco seasoning mix, or more to taste, 1 cup shredded Mexican blend cheese","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch pan with cooking spray., Spray a small pan with cooking spray and heat over medium heat; stir in onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes., Transfer onions to a large bowl and mix in hash browns, ham, taco-flavored cheese, and chile peppers. Layer in the bottom of the prepared pan., Whisk eggs, milk, sour cream, and taco seasoning together in a bowl. Pour on top of the hash brown layer., Bake in the preheated oven until a knife inserted into the center comes out clean, 45 to 60 minutes; check every 5 minutes toward the end., Remove from the oven and spread Mexican cheese on top. Return to the oven and bake until cheese is melted, about 3 minutes. Let casserole stand for 5 minutes to set before serving.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch pan with cooking spray.\n2. Spray a small pan with cooking spray and heat over medium heat; stir in onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes.\n3. Transfer onions to a large bowl and mix in hash browns, ham, taco-flavored cheese, and chile peppers. Layer in the bottom of the prepared pan.\n4. Whisk eggs, milk, sour cream, and taco seasoning together in a bowl. Pour on top of the hash brown layer.\n5. Bake in the preheated oven until a knife inserted into the center comes out clean, 45 to 60 minutes; check every 5 minutes toward the end.\n6. Remove from the oven and spread Mexican cheese on top. Return to the oven and bake until cheese is melted, about 3 minutes. Let casserole stand for 5 minutes to set before serving.","whole_recipe":"Recipe Name: Mexican-Style Breakfast Casserole, \nIngredients: cooking spray, 1 medium onion, chopped, 5 cups shredded hash brown potatoes, 3 cups diced ham, 2 cups shredded taco-flavored cheese, 1 (7 ounce) can diced green chile peppers, 8 large eggs, 1 cup milk, 1 cup sour cream, 1 teaspoon taco seasoning mix, or more to taste, 1 cup shredded Mexican blend cheese, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch pan with cooking spray.\n2. Spray a small pan with cooking spray and heat over medium heat; stir in onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes.\n3. Transfer onions to a large bowl and mix in hash browns, ham, taco-flavored cheese, and chile peppers. Layer in the bottom of the prepared pan.\n4. Whisk eggs, milk, sour cream, and taco seasoning together in a bowl. Pour on top of the hash brown layer.\n5. Bake in the preheated oven until a knife inserted into the center comes out clean, 45 to 60 minutes; check every 5 minutes toward the end.\n6. Remove from the oven and spread Mexican cheese on top. Return to the oven and bake until cheese is melted, about 3 minutes. Let casserole stand for 5 minutes to set before serving., "}
{"recipe_name":"Vegetarian Mexican Breakfast Casserole","ingredients":"1 (20 ounce) package refrigerated prepared diced potatoes (such as Simply Potatoes® Steakhouse Seasoned Diced Potatoes), 2 tablespoons butter, melted, 1 (8 ounce) package cream cheese, cubed, 1 cup milk, 9 eggs, beaten, 0.75 cup chopped tomato, 0.5 cup chopped red onion, 1 bunch cilantro, chopped, 0.5 tablespoon garlic salt, 1 teaspoon ground black pepper, 1 teaspoon dried marjoram, 2 cups shredded sharp Cheddar cheese","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan., Toss potatoes with butter in a microwave-safe bowl. Microwave on high power for 8 minutes., Place cream cheese into the bottom of a large bowl. Pour hot potatoes on top and mix gently until only a few lumps are left., Heat milk in a microwave-safe container in a microwave until warm, 30 to 45 seconds. Stir gently into potato mixture until well combined. Add eggs and stir well. Stir in tomato, onion, cilantro, garlic salt, pepper, and marjoram. Fold in Cheddar cheese gently. Pour into the prepared pan., Bake in the preheated oven until set and golden, about 45 minutes.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\n2. Toss potatoes with butter in a microwave-safe bowl. Microwave on high power for 8 minutes.\n3. Place cream cheese into the bottom of a large bowl. Pour hot potatoes on top and mix gently until only a few lumps are left.\n4. Heat milk in a microwave-safe container in a microwave until warm, 30 to 45 seconds. Stir gently into potato mixture until well combined. Add eggs and stir well. Stir in tomato, onion, cilantro, garlic salt, pepper, and marjoram. Fold in Cheddar cheese gently. Pour into the prepared pan.\n5. Bake in the preheated oven until set and golden, about 45 minutes.","whole_recipe":"Recipe Name: Vegetarian Mexican Breakfast Casserole, \nIngredients: 1 (20 ounce) package refrigerated prepared diced potatoes (such as Simply Potatoes® Steakhouse Seasoned Diced Potatoes), 2 tablespoons butter, melted, 1 (8 ounce) package cream cheese, cubed, 1 cup milk, 9 eggs, beaten, 0.75 cup chopped tomato, 0.5 cup chopped red onion, 1 bunch cilantro, chopped, 0.5 tablespoon garlic salt, 1 teaspoon ground black pepper, 1 teaspoon dried marjoram, 2 cups shredded sharp Cheddar cheese, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\n2. Toss potatoes with butter in a microwave-safe bowl. Microwave on high power for 8 minutes.\n3. Place cream cheese into the bottom of a large bowl. Pour hot potatoes on top and mix gently until only a few lumps are left.\n4. Heat milk in a microwave-safe container in a microwave until warm, 30 to 45 seconds. Stir gently into potato mixture until well combined. Add eggs and stir well. Stir in tomato, onion, cilantro, garlic salt, pepper, and marjoram. Fold in Cheddar cheese gently. Pour into the prepared pan.\n5. Bake in the preheated oven until set and golden, about 45 minutes., "}
{"recipe_name":"Papa Tom's Cheesy Hash Browns","ingredients":"1 (2 pound) package frozen hash brown potatoes, thawed, 1 (16 ounce) container sour cream, 12 ounces shredded sharp Cheddar cheese, 1 (10.75 ounce) can cream of celery soup, 1 onion, chopped, 0.5 cup butter, melted, divided, 0.25 teaspoon ground white pepper, 0.125 teaspoon cayenne pepper, 1 cup crushed corn flakes, 1 cup crushed cheese-flavored crackers (such as Cheez-It®)","instructions":"Preheat oven to 350 degrees F (175 degrees C)., Mix potatoes, sour cream, Cheddar cheese, cream of celery soup, onion, 1\/4 cup butter, white pepper, and cayenne pepper together in a bowl; spread into a 9x13-inch baking dish. Sprinkle corn flakes and cheese-flavored crackers over potato mixture and drizzle remaining butter over the top., Bake in the preheated oven until bubbling and cooked through, about 1 hour.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C).\n2. Mix potatoes, sour cream, Cheddar cheese, cream of celery soup, onion, 1\/4 cup butter, white pepper, and cayenne pepper together in a bowl; spread into a 9x13-inch baking dish. Sprinkle corn flakes and cheese-flavored crackers over potato mixture and drizzle remaining butter over the top.\n3. Bake in the preheated oven until bubbling and cooked through, about 1 hour.","whole_recipe":"Recipe Name: Papa Tom's Cheesy Hash Browns, \nIngredients: 1 (2 pound) package frozen hash brown potatoes, thawed, 1 (16 ounce) container sour cream, 12 ounces shredded sharp Cheddar cheese, 1 (10.75 ounce) can cream of celery soup, 1 onion, chopped, 0.5 cup butter, melted, divided, 0.25 teaspoon ground white pepper, 0.125 teaspoon cayenne pepper, 1 cup crushed corn flakes, 1 cup crushed cheese-flavored crackers (such as Cheez-It®), \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C).\n2. Mix potatoes, sour cream, Cheddar cheese, cream of celery soup, onion, 1\/4 cup butter, white pepper, and cayenne pepper together in a bowl; spread into a 9x13-inch baking dish. Sprinkle corn flakes and cheese-flavored crackers over potato mixture and drizzle remaining butter over the top.\n3. Bake in the preheated oven until bubbling and cooked through, about 1 hour., "}
{"recipe_name":"Quick Microwave Frittata Casserole","ingredients":"2 cups frozen hash brown potatoes, 0.5 cup shredded carrot, 0.25 cup chopped onion, 2 tablespoons chopped fresh parsley, 2 tablespoons butter, 1 to taste salt and pepper to taste, 8 eggs, 0.5 cup milk, 0.25 teaspoon dry mustard, 1 dash hot pepper sauce, 1 cup cubed cooked ham, 0.5 cup shredded Cheddar cheese","instructions":"In a non-metallic 2 quart casserole dish, stir together potatoes, carrot, onion, parsley and butter. Cover and microwave on High for 5 minutes, stirring once or twice. Season with salt and pepper., In a medium bowl, beat together, eggs, milk, mustard and hot pepper sauce. Stir in cubed ham. Pour egg mixture into casserole, stir to combine., Cover dish and microwave on high for 3 minutes. Draw cooked egg toward middle of dish and microwave on medium for 10 to 12 minutes. If you do not have a turntable rotate dish 2 to 3 times. Sprinkle cheese on top, cover and microwave for 30 to 60 seconds until cheese is melted. Let stand 5 minutes before serving.","step_instructions":"1. In a non-metallic 2 quart casserole dish, stir together potatoes, carrot, onion, parsley and butter. Cover and microwave on High for 5 minutes, stirring once or twice. Season with salt and pepper.\n2. In a medium bowl, beat together, eggs, milk, mustard and hot pepper sauce. Stir in cubed ham. Pour egg mixture into casserole, stir to combine.\n3. Cover dish and microwave on high for 3 minutes. Draw cooked egg toward middle of dish and microwave on medium for 10 to 12 minutes. If you do not have a turntable rotate dish 2 to 3 times. Sprinkle cheese on top, cover and microwave for 30 to 60 seconds until cheese is melted. Let stand 5 minutes before serving.","whole_recipe":"Recipe Name: Quick Microwave Frittata Casserole, \nIngredients: 2 cups frozen hash brown potatoes, 0.5 cup shredded carrot, 0.25 cup chopped onion, 2 tablespoons chopped fresh parsley, 2 tablespoons butter, 1 to taste salt and pepper to taste, 8 eggs, 0.5 cup milk, 0.25 teaspoon dry mustard, 1 dash hot pepper sauce, 1 cup cubed cooked ham, 0.5 cup shredded Cheddar cheese, \nCooking Instructions: 1. In a non-metallic 2 quart casserole dish, stir together potatoes, carrot, onion, parsley and butter. Cover and microwave on High for 5 minutes, stirring once or twice. Season with salt and pepper.\n2. In a medium bowl, beat together, eggs, milk, mustard and hot pepper sauce. Stir in cubed ham. Pour egg mixture into casserole, stir to combine.\n3. Cover dish and microwave on high for 3 minutes. Draw cooked egg toward middle of dish and microwave on medium for 10 to 12 minutes. If you do not have a turntable rotate dish 2 to 3 times. Sprinkle cheese on top, cover and microwave for 30 to 60 seconds until cheese is melted. Let stand 5 minutes before serving., "}
{"recipe_name":"Cheesy Sausage and Potato Breakfast Casserole","ingredients":"1.5 pounds potatoes, peeled, cooking spray, 1 (16 ounce) package pork breakfast sausage, 1 sweet onion, chopped, 7 eggs, 1 (8 ounce) package Cheddar cheese, grated, divided, 0.5 cup milk, salt and ground black pepper to taste","instructions":"Preheat an oven to 450 degrees F (230 degrees C). Prick potatoes several times with a fork and place onto a baking sheet., Bake in the preheated oven until potatoes are soft, 50 minutes to 1 hour. Remove potatoes from oven and let cool until safe to handle, at least 15 minutes., Reduce oven temperature to 350 degrees F (175 degrees C). Spray a casserole dish or 9x13-inch pan with cooking spray., Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Transfer sausage to a bowl. Saute onion in the same skillet until translucent, about 5 minutes. Transfer onion to the bowl with the cooked sausage., Mix eggs, half the Cheddar cheese, milk, salt, and pepper into the bowl with the sausage mixture., Grate potatoes and add to the bowl of sausage mixture. Pour mixture into the prepared dish; place remaining Cheddar cheese on top., Bake in the preheated oven until casserole is heated through and cheese is melted and bubbly, about 35 minutes.","step_instructions":"1. Preheat an oven to 450 degrees F (230 degrees C). Prick potatoes several times with a fork and place onto a baking sheet.\n2. Bake in the preheated oven until potatoes are soft, 50 minutes to 1 hour. Remove potatoes from oven and let cool until safe to handle, at least 15 minutes.\n3. Reduce oven temperature to 350 degrees F (175 degrees C). Spray a casserole dish or 9x13-inch pan with cooking spray.\n4. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Transfer sausage to a bowl. Saute onion in the same skillet until translucent, about 5 minutes. Transfer onion to the bowl with the cooked sausage.\n5. Mix eggs, half the Cheddar cheese, milk, salt, and pepper into the bowl with the sausage mixture.\n6. Grate potatoes and add to the bowl of sausage mixture. Pour mixture into the prepared dish; place remaining Cheddar cheese on top.\n7. Bake in the preheated oven until casserole is heated through and cheese is melted and bubbly, about 35 minutes.","whole_recipe":"Recipe Name: Cheesy Sausage and Potato Breakfast Casserole, \nIngredients: 1.5 pounds potatoes, peeled, cooking spray, 1 (16 ounce) package pork breakfast sausage, 1 sweet onion, chopped, 7 eggs, 1 (8 ounce) package Cheddar cheese, grated, divided, 0.5 cup milk, salt and ground black pepper to taste, \nCooking Instructions: 1. Preheat an oven to 450 degrees F (230 degrees C). Prick potatoes several times with a fork and place onto a baking sheet.\n2. Bake in the preheated oven until potatoes are soft, 50 minutes to 1 hour. Remove potatoes from oven and let cool until safe to handle, at least 15 minutes.\n3. Reduce oven temperature to 350 degrees F (175 degrees C). Spray a casserole dish or 9x13-inch pan with cooking spray.\n4. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Transfer sausage to a bowl. Saute onion in the same skillet until translucent, about 5 minutes. Transfer onion to the bowl with the cooked sausage.\n5. Mix eggs, half the Cheddar cheese, milk, salt, and pepper into the bowl with the sausage mixture.\n6. Grate potatoes and add to the bowl of sausage mixture. Pour mixture into the prepared dish; place remaining Cheddar cheese on top.\n7. Bake in the preheated oven until casserole is heated through and cheese is melted and bubbly, about 35 minutes., "}
{"recipe_name":"Asiago Hash Browns","ingredients":"1 (30 ounce) package frozen hash brown potatoes, thawed, 1.5 cups grated Asiago cheese, 1 medium onion, chopped, 1 (8 ounce) container sour cream, 8 fluid ounces heavy cream, 0.5 cup butter, melted, paprika to taste, salt and pepper to taste","instructions":"Preheat oven to 350 degrees F (175 degrees C)., In a medium casserole dish, mix the hash browns, Asiago cheese, onion, sour cream, heavy cream, and butter., Bake 1 hour in the preheated oven, or until hash browns are fully cooked and the top is lightly browned. Season with paprika, salt, and pepper.","step_instructions":"1. Preheat oven to 350 degrees F (175 degrees C).\n2. In a medium casserole dish, mix the hash browns, Asiago cheese, onion, sour cream, heavy cream, and butter.\n3. Bake 1 hour in the preheated oven, or until hash browns are fully cooked and the top is lightly browned. Season with paprika, salt, and pepper.","whole_recipe":"Recipe Name: Asiago Hash Browns, \nIngredients: 1 (30 ounce) package frozen hash brown potatoes, thawed, 1.5 cups grated Asiago cheese, 1 medium onion, chopped, 1 (8 ounce) container sour cream, 8 fluid ounces heavy cream, 0.5 cup butter, melted, paprika to taste, salt and pepper to taste, \nCooking Instructions: 1. Preheat oven to 350 degrees F (175 degrees C).\n2. In a medium casserole dish, mix the hash browns, Asiago cheese, onion, sour cream, heavy cream, and butter.\n3. Bake 1 hour in the preheated oven, or until hash browns are fully cooked and the top is lightly browned. Season with paprika, salt, and pepper., "}
{"recipe_name":"Manda's Breakfast Casserole","ingredients":"10 slices bacon, 5 red potatoes, diced, 1 red bell pepper, diced, 1 orange bell pepper, diced, 0.5 red onion, diced, 1 jalapeno pepper, diced, 1 cup shredded Cheddar cheese, divided, 6 eggs, 0.75 cup skim milk, 1 tablespoon garlic powder, 1 tablespoon ground black pepper, 0.5 teaspoon salt, 0.25 teaspoon paprika","instructions":"Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels, then crumble into pieces., Preheat the oven to 425 degrees F (220 degrees C). Grease the bottom and sides of a 9x13-inch casserole dish., Layer potatoes, bell peppers, onion, and jalapeño in the prepared casserole dish. Sprinkle 1\/2 cup Cheddar cheese on top. Scatter bacon pieces over Cheddar., Whisk eggs, milk, garlic powder, black pepper, salt, and paprika together in a large bowl. Pour over layers in the casserole dish., Bake in the preheated oven until set, about 35 minutes. Remove from the oven and top with remaining 1\/2 cup Cheddar. Continue baking until cheese is melted and golden, about 10 more minutes.","step_instructions":"1. Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels, then crumble into pieces.\n2. Preheat the oven to 425 degrees F (220 degrees C). Grease the bottom and sides of a 9x13-inch casserole dish.\n3. Layer potatoes, bell peppers, onion, and jalapeño in the prepared casserole dish. Sprinkle 1\/2 cup Cheddar cheese on top. Scatter bacon pieces over Cheddar.\n4. Whisk eggs, milk, garlic powder, black pepper, salt, and paprika together in a large bowl. Pour over layers in the casserole dish.\n5. Bake in the preheated oven until set, about 35 minutes. Remove from the oven and top with remaining 1\/2 cup Cheddar. Continue baking until cheese is melted and golden, about 10 more minutes.","whole_recipe":"Recipe Name: Manda's Breakfast Casserole, \nIngredients: 10 slices bacon, 5 red potatoes, diced, 1 red bell pepper, diced, 1 orange bell pepper, diced, 0.5 red onion, diced, 1 jalapeno pepper, diced, 1 cup shredded Cheddar cheese, divided, 6 eggs, 0.75 cup skim milk, 1 tablespoon garlic powder, 1 tablespoon ground black pepper, 0.5 teaspoon salt, 0.25 teaspoon paprika, \nCooking Instructions: 1. Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels, then crumble into pieces.\n2. Preheat the oven to 425 degrees F (220 degrees C). Grease the bottom and sides of a 9x13-inch casserole dish.\n3. Layer potatoes, bell peppers, onion, and jalapeño in the prepared casserole dish. Sprinkle 1\/2 cup Cheddar cheese on top. Scatter bacon pieces over Cheddar.\n4. Whisk eggs, milk, garlic powder, black pepper, salt, and paprika together in a large bowl. Pour over layers in the casserole dish.\n5. Bake in the preheated oven until set, about 35 minutes. Remove from the oven and top with remaining 1\/2 cup Cheddar. Continue baking until cheese is melted and golden, about 10 more minutes., "}
{"recipe_name":"Christmas Morning Breakfast Casserole","ingredients":"1 (5.5 ounce) box Idahoan® Steakhouse Cheesy Hashbrowns, 0.5 cup buttermilk, 1 cup sliced bacon, diced, 1 small onion, diced, 3 eggs, beaten, 0.5 cup Swiss cheese, shredded","instructions":"Preheat oven to 450 degrees F., Prepare Idahoan Steakhouse Cheesy Hashbrown Potatoes, following packaging directions, replacing the 1\/2 cup milk with 1\/2 cup buttermilk., In a medium size skillet, cook bacon and onion until bacon is crisp. Drain and set aside to cool slightly., Stir in eggs, Swiss cheese, and bacon-onion mixture., Bake uncovered for 25 minutes., Sprinkle crunchy onion topping on top of potatoes. Let stand 5 minutes then serve.","step_instructions":"1. Preheat oven to 450 degrees F.\n2. Prepare Idahoan Steakhouse Cheesy Hashbrown Potatoes, following packaging directions, replacing the 1\/2 cup milk with 1\/2 cup buttermilk.\n3. In a medium size skillet, cook bacon and onion until bacon is crisp. Drain and set aside to cool slightly.\n4. Stir in eggs, Swiss cheese, and bacon-onion mixture.\n5. Bake uncovered for 25 minutes.\n6. Sprinkle crunchy onion topping on top of potatoes. Let stand 5 minutes then serve.","whole_recipe":"Recipe Name: Christmas Morning Breakfast Casserole, \nIngredients: 1 (5.5 ounce) box Idahoan® Steakhouse Cheesy Hashbrowns, 0.5 cup buttermilk, 1 cup sliced bacon, diced, 1 small onion, diced, 3 eggs, beaten, 0.5 cup Swiss cheese, shredded, \nCooking Instructions: 1. Preheat oven to 450 degrees F.\n2. Prepare Idahoan Steakhouse Cheesy Hashbrown Potatoes, following packaging directions, replacing the 1\/2 cup milk with 1\/2 cup buttermilk.\n3. In a medium size skillet, cook bacon and onion until bacon is crisp. Drain and set aside to cool slightly.\n4. Stir in eggs, Swiss cheese, and bacon-onion mixture.\n5. Bake uncovered for 25 minutes.\n6. Sprinkle crunchy onion topping on top of potatoes. Let stand 5 minutes then serve., "}
{"recipe_name":"Potato Casserole (Funeral Potatoes)","ingredients":"6 tablespoons margarine, divided, 1 small onion, chopped, 1 (30 ounce) package frozen shredded hash brown potatoes, thawed, ground black pepper to taste, 2 cups shredded sharp Cheddar cheese, 1 (10.5 ounce) can condensed cream of chicken soup, 1 (10.5 ounce) can condensed cream of celery soup, 1 (8 ounce) container sour cream, 0.5 pound diced ham, 2 cups cornflakes, 2 tablespoons margarine","instructions":"Preheat the oven to 350 degrees F (175 degrees C)., Melt 4 tablespoons margarine in a Dutch oven over medium heat. Add onion and saute until translucent, about 5 minutes. Stir in remaining 2 tablespoons margarine until melted. Remove from the heat., Stir in hash brown potatoes and pepper until evenly distributed. Add Cheddar cheese, condensed soups, sour cream, and ham; stir until well mixed. Spread into a large pan., Toss cornflakes with melted margarine until coated. Sprinkle on top of the potato casserole., Bake in the preheated oven until golden brown, 45 to 60 minutes.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Melt 4 tablespoons margarine in a Dutch oven over medium heat. Add onion and saute until translucent, about 5 minutes. Stir in remaining 2 tablespoons margarine until melted. Remove from the heat.\n3. Stir in hash brown potatoes and pepper until evenly distributed. Add Cheddar cheese, condensed soups, sour cream, and ham; stir until well mixed. Spread into a large pan.\n4. Toss cornflakes with melted margarine until coated. Sprinkle on top of the potato casserole.\n5. Bake in the preheated oven until golden brown, 45 to 60 minutes.","whole_recipe":"Recipe Name: Potato Casserole (Funeral Potatoes), \nIngredients: 6 tablespoons margarine, divided, 1 small onion, chopped, 1 (30 ounce) package frozen shredded hash brown potatoes, thawed, ground black pepper to taste, 2 cups shredded sharp Cheddar cheese, 1 (10.5 ounce) can condensed cream of chicken soup, 1 (10.5 ounce) can condensed cream of celery soup, 1 (8 ounce) container sour cream, 0.5 pound diced ham, 2 cups cornflakes, 2 tablespoons margarine, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Melt 4 tablespoons margarine in a Dutch oven over medium heat. Add onion and saute until translucent, about 5 minutes. Stir in remaining 2 tablespoons margarine until melted. Remove from the heat.\n3. Stir in hash brown potatoes and pepper until evenly distributed. Add Cheddar cheese, condensed soups, sour cream, and ham; stir until well mixed. Spread into a large pan.\n4. Toss cornflakes with melted margarine until coated. Sprinkle on top of the potato casserole.\n5. Bake in the preheated oven until golden brown, 45 to 60 minutes., "}
{"recipe_name":"Easy Cheesy Hash Browns","ingredients":"2 (10.5 ounce) cans cream of celery soup, 2 cups sour cream, 2 cups shredded Cheddar cheese, 1 (8 ounce) package cream cheese, softened, 1 (2 pound) package frozen hash brown potatoes, thawed, 2 cups crushed corn flakes, 0.5 cup butter, melted","instructions":"Preheat the oven to 350 degrees F (175 degrees C)., Stir cream of celery soup, sour cream, Cheddar cheese, and cream cheese in a large bowl until thoroughly combined. Gently fold hash brown potatoes into soup mixture., Stir cornflakes with melted butter in a separate bowl. Spread potato mixture in an even layer into a 9x13-inch baking dish; sprinkle buttered cornflakes over the top., Bake in the preheated oven until casserole is bubbling and topping has browned, about 1 hour.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Stir cream of celery soup, sour cream, Cheddar cheese, and cream cheese in a large bowl until thoroughly combined. Gently fold hash brown potatoes into soup mixture.\n3. Stir cornflakes with melted butter in a separate bowl. Spread potato mixture in an even layer into a 9x13-inch baking dish; sprinkle buttered cornflakes over the top.\n4. Bake in the preheated oven until casserole is bubbling and topping has browned, about 1 hour.","whole_recipe":"Recipe Name: Easy Cheesy Hash Browns, \nIngredients: 2 (10.5 ounce) cans cream of celery soup, 2 cups sour cream, 2 cups shredded Cheddar cheese, 1 (8 ounce) package cream cheese, softened, 1 (2 pound) package frozen hash brown potatoes, thawed, 2 cups crushed corn flakes, 0.5 cup butter, melted, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C).\n2. Stir cream of celery soup, sour cream, Cheddar cheese, and cream cheese in a large bowl until thoroughly combined. Gently fold hash brown potatoes into soup mixture.\n3. Stir cornflakes with melted butter in a separate bowl. Spread potato mixture in an even layer into a 9x13-inch baking dish; sprinkle buttered cornflakes over the top.\n4. Bake in the preheated oven until casserole is bubbling and topping has browned, about 1 hour., "}
{"recipe_name":"Breakfast Casserole with Hash Browns","ingredients":"9 large eggs, 0.5 cup sour cream, 0.25 cup milk, 1.5 tablespoons salt, 1.5 tablespoons ground black pepper, 9 cups frozen hash brown potatoes, thawed, 3 cups diced ham, 3 cups shredded Cheddar cheese, 6 green onions, chopped, 1 red bell pepper, diced, 1 green bell pepper, diced","instructions":"Mix eggs, sour cream, milk, salt, and pepper together in a bowl and set aside., Mix hash browns, ham, Cheddar cheese, green onions, and bell peppers together in another bowl. Transfer to a 9x13-inch baking pan and mix in egg mixture well; it may appear watery but hash browns will absorb most of it by morning. Cover with plastic wrap and refrigerate, 8 hours to overnight., Preheat the oven to 400 degrees F (200 degrees C)., Bake in the preheated oven until top is browned and eggs are set, about 55 minutes.","step_instructions":"1. Mix eggs, sour cream, milk, salt, and pepper together in a bowl and set aside.\n2. Mix hash browns, ham, Cheddar cheese, green onions, and bell peppers together in another bowl. Transfer to a 9x13-inch baking pan and mix in egg mixture well; it may appear watery but hash browns will absorb most of it by morning. Cover with plastic wrap and refrigerate, 8 hours to overnight.\n3. Preheat the oven to 400 degrees F (200 degrees C).\n4. Bake in the preheated oven until top is browned and eggs are set, about 55 minutes.","whole_recipe":"Recipe Name: Breakfast Casserole with Hash Browns, \nIngredients: 9 large eggs, 0.5 cup sour cream, 0.25 cup milk, 1.5 tablespoons salt, 1.5 tablespoons ground black pepper, 9 cups frozen hash brown potatoes, thawed, 3 cups diced ham, 3 cups shredded Cheddar cheese, 6 green onions, chopped, 1 red bell pepper, diced, 1 green bell pepper, diced, \nCooking Instructions: 1. Mix eggs, sour cream, milk, salt, and pepper together in a bowl and set aside.\n2. Mix hash browns, ham, Cheddar cheese, green onions, and bell peppers together in another bowl. Transfer to a 9x13-inch baking pan and mix in egg mixture well; it may appear watery but hash browns will absorb most of it by morning. Cover with plastic wrap and refrigerate, 8 hours to overnight.\n3. Preheat the oven to 400 degrees F (200 degrees C).\n4. Bake in the preheated oven until top is browned and eggs are set, about 55 minutes., "}
{"recipe_name":"Potato, Sausage and Egg Breakfast Casserole","ingredients":"1 serving PAM® Original No-Stick Cooking Spray, 1 (16 ounce) container Egg Beaters® Original, 0.5 cup fat free milk, 0.25 teaspoon garlic salt, 4 frozen Banquet® Brown 'N Serve™ Turkey Sausage links, sliced, 2 cups refrigerated shredded hash brown potatoes, 0.5 cup chopped red bell pepper, 0.5 cup shredded sharp Cheddar cheese","instructions":"Preheat oven to 350 degrees F. Spray 8x8-inch glass baking dish with cooking spray; set aside., Combine Egg Beaters®, milk and garlic salt in large bowl. Add sausage, potatoes, bell pepper and cheese; stir to combine. Place mixture in dish., Bake 45 minutes or until knife inserted in center comes out clean. Cool slightly before serving.","step_instructions":"1. Preheat oven to 350 degrees F. Spray 8x8-inch glass baking dish with cooking spray; set aside.\n2. Combine Egg Beaters®, milk and garlic salt in large bowl. Add sausage, potatoes, bell pepper and cheese; stir to combine. Place mixture in dish.\n3. Bake 45 minutes or until knife inserted in center comes out clean. Cool slightly before serving.","whole_recipe":"Recipe Name: Potato, Sausage and Egg Breakfast Casserole, \nIngredients: 1 serving PAM® Original No-Stick Cooking Spray, 1 (16 ounce) container Egg Beaters® Original, 0.5 cup fat free milk, 0.25 teaspoon garlic salt, 4 frozen Banquet® Brown 'N Serve™ Turkey Sausage links, sliced, 2 cups refrigerated shredded hash brown potatoes, 0.5 cup chopped red bell pepper, 0.5 cup shredded sharp Cheddar cheese, \nCooking Instructions: 1. Preheat oven to 350 degrees F. Spray 8x8-inch glass baking dish with cooking spray; set aside.\n2. Combine Egg Beaters®, milk and garlic salt in large bowl. Add sausage, potatoes, bell pepper and cheese; stir to combine. Place mixture in dish.\n3. Bake 45 minutes or until knife inserted in center comes out clean. Cool slightly before serving., "}
{"recipe_name":"Loaded Overnight Breakfast Casserole","ingredients":"0.5 pound bulk pork sausage, 2 (12 ounce) packages frozen pre-cooked hash brown patties, thawed, 0.5 pound diced fully cooked ham, 2 cups shredded Monterey Jack cheese, 2 teaspoons dry mustard, 1.5 teaspoons onion powder, 12 large eggs, 1.5 cups evaporated milk, 0.5 cup half-and-half, 0.5 teaspoon kosher salt, 0.5 teaspoon ground black pepper, 0.5 cup shredded sharp Cheddar cheese, or more to taste","instructions":"Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Remove from heat and let cool slightly, about 5 minutes. Transfer to a large bowl., Add hash browns, ham, Monterey Jack cheese, dry mustard, and onion powder to sausage; mix to combine. Pour loosely into a greased 9x13-inch baking pan. Whisk eggs, evaporated milk, half-and-half, salt, and pepper together in a large bowl. Pour evenly over the hash brown mixture, cover with aluminum foil, and refrigerate, 8 hours to overnight., Pull from the refrigerator 30 minutes prior to cooking. Add Cheddar cheese and recover., Preheat the oven to 350 degrees F (175 degrees C)., Cook in the preheated oven for 45 minutes. Remove foil and continue to cook, uncovered, until cheese is bubbly, 15 to 20 minutes more. Let stand for 10 minutes to firm up before serving.","step_instructions":"1. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Remove from heat and let cool slightly, about 5 minutes. Transfer to a large bowl.\n2. Add hash browns, ham, Monterey Jack cheese, dry mustard, and onion powder to sausage; mix to combine. Pour loosely into a greased 9x13-inch baking pan. Whisk eggs, evaporated milk, half-and-half, salt, and pepper together in a large bowl. Pour evenly over the hash brown mixture, cover with aluminum foil, and refrigerate, 8 hours to overnight.\n3. Pull from the refrigerator 30 minutes prior to cooking. Add Cheddar cheese and recover.\n4. Preheat the oven to 350 degrees F (175 degrees C).\n5. Cook in the preheated oven for 45 minutes. Remove foil and continue to cook, uncovered, until cheese is bubbly, 15 to 20 minutes more. Let stand for 10 minutes to firm up before serving.","whole_recipe":"Recipe Name: Loaded Overnight Breakfast Casserole, \nIngredients: 0.5 pound bulk pork sausage, 2 (12 ounce) packages frozen pre-cooked hash brown patties, thawed, 0.5 pound diced fully cooked ham, 2 cups shredded Monterey Jack cheese, 2 teaspoons dry mustard, 1.5 teaspoons onion powder, 12 large eggs, 1.5 cups evaporated milk, 0.5 cup half-and-half, 0.5 teaspoon kosher salt, 0.5 teaspoon ground black pepper, 0.5 cup shredded sharp Cheddar cheese, or more to taste, \nCooking Instructions: 1. Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Remove from heat and let cool slightly, about 5 minutes. Transfer to a large bowl.\n2. Add hash browns, ham, Monterey Jack cheese, dry mustard, and onion powder to sausage; mix to combine. Pour loosely into a greased 9x13-inch baking pan. Whisk eggs, evaporated milk, half-and-half, salt, and pepper together in a large bowl. Pour evenly over the hash brown mixture, cover with aluminum foil, and refrigerate, 8 hours to overnight.\n3. Pull from the refrigerator 30 minutes prior to cooking. Add Cheddar cheese and recover.\n4. Preheat the oven to 350 degrees F (175 degrees C).\n5. Cook in the preheated oven for 45 minutes. Remove foil and continue to cook, uncovered, until cheese is bubbly, 15 to 20 minutes more. Let stand for 10 minutes to firm up before serving., "}
{"recipe_name":"Overnight Slow Cooker Breakfast Casserole","ingredients":"12 large eggs, 1 cup heavy cream (or half-and-half), 1 teaspoon onion powder, 1 teaspoon salt, 0.5 teaspoon black pepper, 0.25 teaspoon crushed red pepper flakes, 1 (20 ounce) package refrigerated hash brown potatoes, 4 ounces shredded Parmesan cheese, divided, 8 ounces shredded mozzarella cheese, divided, 1 (5 ounce) package Jones Dairy Farm All Natural Golden Brown® Mild Sausage Links, sliced into coins, 0.5 cup chopped sun-dried tomatoes, divided, 0.5 cup chopped fresh basil, divided","instructions":"Spray slow cooker with non-stick cooking spray., In medium bowl combine eggs and cream; whisk until well combined. Sprinkle onion powder, salt and both peppers over egg mixture while whisking. Whisk until completely combined. Set aside., In slow cooker, combine hash browns and about 1\/2 of each of Parmesan cheese, mozzarella cheese, sausage, sun-dried tomatoes and basil. Using fingers, gently toss until combined. Pour egg mixture over top; if necessary use spatula to smooth out top., Set aside about 1\/2 of remaining mozzarella cheese (approximately 2 ounces). Sprinkle remaining ingredients over top of casserole. Cover slow cooker and cook for 6-8 hours on low or until center is cooked through. A thermometer inserted into center should read 160 degrees F., Sprinkle casserole with remaining cheese, serve and enjoy!","step_instructions":"1. Spray slow cooker with non-stick cooking spray.\n2. In medium bowl combine eggs and cream; whisk until well combined. Sprinkle onion powder, salt and both peppers over egg mixture while whisking. Whisk until completely combined. Set aside.\n3. In slow cooker, combine hash browns and about 1\/2 of each of Parmesan cheese, mozzarella cheese, sausage, sun-dried tomatoes and basil. Using fingers, gently toss until combined. Pour egg mixture over top; if necessary use spatula to smooth out top.\n4. Set aside about 1\/2 of remaining mozzarella cheese (approximately 2 ounces). Sprinkle remaining ingredients over top of casserole. Cover slow cooker and cook for 6-8 hours on low or until center is cooked through. A thermometer inserted into center should read 160 degrees F.\n5. Sprinkle casserole with remaining cheese, serve and enjoy!","whole_recipe":"Recipe Name: Overnight Slow Cooker Breakfast Casserole, \nIngredients: 12 large eggs, 1 cup heavy cream (or half-and-half), 1 teaspoon onion powder, 1 teaspoon salt, 0.5 teaspoon black pepper, 0.25 teaspoon crushed red pepper flakes, 1 (20 ounce) package refrigerated hash brown potatoes, 4 ounces shredded Parmesan cheese, divided, 8 ounces shredded mozzarella cheese, divided, 1 (5 ounce) package Jones Dairy Farm All Natural Golden Brown® Mild Sausage Links, sliced into coins, 0.5 cup chopped sun-dried tomatoes, divided, 0.5 cup chopped fresh basil, divided, \nCooking Instructions: 1. Spray slow cooker with non-stick cooking spray.\n2. In medium bowl combine eggs and cream; whisk until well combined. Sprinkle onion powder, salt and both peppers over egg mixture while whisking. Whisk until completely combined. Set aside.\n3. In slow cooker, combine hash browns and about 1\/2 of each of Parmesan cheese, mozzarella cheese, sausage, sun-dried tomatoes and basil. Using fingers, gently toss until combined. Pour egg mixture over top; if necessary use spatula to smooth out top.\n4. Set aside about 1\/2 of remaining mozzarella cheese (approximately 2 ounces). Sprinkle remaining ingredients over top of casserole. Cover slow cooker and cook for 6-8 hours on low or until center is cooked through. A thermometer inserted into center should read 160 degrees F.\n5. Sprinkle casserole with remaining cheese, serve and enjoy!, "}
{"recipe_name":"Father's Day Casserole","ingredients":"1 (16 ounce) package bulk pork sausage, 3 cups frozen hash brown potatoes, thawed, 1 (16 ounce) can refrigerated buttermilk biscuit dough (such as Pillsbury Grands!®), 1.5 cups shredded Mexican cheese blend, 5 eggs, 0.25 cup milk, or as needed","instructions":"Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish., Heat a large skillet over medium-high heat. Add sausage; cook and stir until crumbly, evenly browned, and no longer pink, about 5 minutes. Drain and discard any excess grease. Stir in hash brown potatoes; cook and stir until potatoes are browned, about 5 more minutes., Line the bottom of the prepared baking dish with a layer of buttermilk biscuits, splitting the biscuits in half to completely cover the dish. Spread sausage and hash brown mixture evenly over top, then sprinkle with Mexican cheese. Whisk together eggs and milk in a bowl, and pour over cheese., Bake in the preheated oven until eggs are set, about 25 minutes.","step_instructions":"1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n2. Heat a large skillet over medium-high heat. Add sausage; cook and stir until crumbly, evenly browned, and no longer pink, about 5 minutes. Drain and discard any excess grease. Stir in hash brown potatoes; cook and stir until potatoes are browned, about 5 more minutes.\n3. Line the bottom of the prepared baking dish with a layer of buttermilk biscuits, splitting the biscuits in half to completely cover the dish. Spread sausage and hash brown mixture evenly over top, then sprinkle with Mexican cheese. Whisk together eggs and milk in a bowl, and pour over cheese.\n4. Bake in the preheated oven until eggs are set, about 25 minutes.","whole_recipe":"Recipe Name: Father's Day Casserole, \nIngredients: 1 (16 ounce) package bulk pork sausage, 3 cups frozen hash brown potatoes, thawed, 1 (16 ounce) can refrigerated buttermilk biscuit dough (such as Pillsbury Grands!®), 1.5 cups shredded Mexican cheese blend, 5 eggs, 0.25 cup milk, or as needed, \nCooking Instructions: 1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n2. Heat a large skillet over medium-high heat. Add sausage; cook and stir until crumbly, evenly browned, and no longer pink, about 5 minutes. Drain and discard any excess grease. Stir in hash brown potatoes; cook and stir until potatoes are browned, about 5 more minutes.\n3. Line the bottom of the prepared baking dish with a layer of buttermilk biscuits, splitting the biscuits in half to completely cover the dish. Spread sausage and hash brown mixture evenly over top, then sprinkle with Mexican cheese. Whisk together eggs and milk in a bowl, and pour over cheese.\n4. Bake in the preheated oven until eggs are set, about 25 minutes., "}
{"recipe_name":"Egg and Hash Brown Casserole","ingredients":"1 (20 ounce) package frozen O'Brien hashbrown potatoes, thawed, 0.33333334326744 cup vegetable oil, 1 (12 ounce) package bulk pork breakfast sausage, 6 eggs, beaten, 1 cup sliced fresh mushrooms, 0.75 cup shredded pepperjack cheese, 0.75 cup shredded Swiss cheese, 0.5 cup milk, 1 tablespoon chopped fresh parsley, 1 teaspoon garlic salt, 0.25 teaspoon ground black pepper, 4 thin slices tomato, 1.5 teaspoons chopped fresh parsley","instructions":"Preheat oven to 425 degrees F (220 degrees C)., Toss potatoes with vegetable oil in a bowl until potatoes are well coated. Press potatoes into a 10-inch pie pan to create a crust., Bake potatoes in the preheated oven until golden brown, about 30 minutes. Remove pan from oven and reduce heat to 350 degrees F (175 degrees C)., While potatoes are baking, heat a large skillet over medium-high heat and stir in sausage. Cook and stir until sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Combine sausage with eggs, mushrooms, pepper jack cheese, Swiss cheese, milk, 1 tablespoon parsley, garlic salt, and black pepper in a large bowl. Pour egg mixture into the prepared potato crust., Bake in the oven until eggs are set, about 25 minutes. Arrange tomato slices over eggs and sprinkle the remaining 1 1\/2 teaspoons parsley on top. Return to the oven and continue baking until tomatoes soften, about 5 minutes more.","step_instructions":"1. Preheat oven to 425 degrees F (220 degrees C).\n2. Toss potatoes with vegetable oil in a bowl until potatoes are well coated. Press potatoes into a 10-inch pie pan to create a crust.\n3. Bake potatoes in the preheated oven until golden brown, about 30 minutes. Remove pan from oven and reduce heat to 350 degrees F (175 degrees C).\n4. While potatoes are baking, heat a large skillet over medium-high heat and stir in sausage. Cook and stir until sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Combine sausage with eggs, mushrooms, pepper jack cheese, Swiss cheese, milk, 1 tablespoon parsley, garlic salt, and black pepper in a large bowl. Pour egg mixture into the prepared potato crust.\n5. Bake in the oven until eggs are set, about 25 minutes. Arrange tomato slices over eggs and sprinkle the remaining 1 1\/2 teaspoons parsley on top. Return to the oven and continue baking until tomatoes soften, about 5 minutes more.","whole_recipe":"Recipe Name: Egg and Hash Brown Casserole, \nIngredients: 1 (20 ounce) package frozen O'Brien hashbrown potatoes, thawed, 0.33333334326744 cup vegetable oil, 1 (12 ounce) package bulk pork breakfast sausage, 6 eggs, beaten, 1 cup sliced fresh mushrooms, 0.75 cup shredded pepperjack cheese, 0.75 cup shredded Swiss cheese, 0.5 cup milk, 1 tablespoon chopped fresh parsley, 1 teaspoon garlic salt, 0.25 teaspoon ground black pepper, 4 thin slices tomato, 1.5 teaspoons chopped fresh parsley, \nCooking Instructions: 1. Preheat oven to 425 degrees F (220 degrees C).\n2. Toss potatoes with vegetable oil in a bowl until potatoes are well coated. Press potatoes into a 10-inch pie pan to create a crust.\n3. Bake potatoes in the preheated oven until golden brown, about 30 minutes. Remove pan from oven and reduce heat to 350 degrees F (175 degrees C).\n4. While potatoes are baking, heat a large skillet over medium-high heat and stir in sausage. Cook and stir until sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Combine sausage with eggs, mushrooms, pepper jack cheese, Swiss cheese, milk, 1 tablespoon parsley, garlic salt, and black pepper in a large bowl. Pour egg mixture into the prepared potato crust.\n5. Bake in the oven until eggs are set, about 25 minutes. Arrange tomato slices over eggs and sprinkle the remaining 1 1\/2 teaspoons parsley on top. Return to the oven and continue baking until tomatoes soften, about 5 minutes more., "}
{"recipe_name":"Turkey Sausage Breakfast","ingredients":"1 pound ground turkey sausage, 4 eggs, lightly beaten, 4 green onions, finely chopped, 1 (16 ounce) package frozen hash brown potatoes, 0.5 cup milk, 1.5 cups shredded Cheddar cheese","instructions":"Place turkey sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside., Preheat the oven to 350 degrees F (175 degrees C)., In a large bowl, stir together eggs, green onions, hash browns, milk, Cheddar cheese, and cooked sausage. Pour mixture into a 9x13-inch baking pan., Bake in the preheated oven for 1 hour.","step_instructions":"1. Place turkey sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside.\n2. Preheat the oven to 350 degrees F (175 degrees C).\n3. In a large bowl, stir together eggs, green onions, hash browns, milk, Cheddar cheese, and cooked sausage. Pour mixture into a 9x13-inch baking pan.\n4. Bake in the preheated oven for 1 hour.","whole_recipe":"Recipe Name: Turkey Sausage Breakfast, \nIngredients: 1 pound ground turkey sausage, 4 eggs, lightly beaten, 4 green onions, finely chopped, 1 (16 ounce) package frozen hash brown potatoes, 0.5 cup milk, 1.5 cups shredded Cheddar cheese, \nCooking Instructions: 1. Place turkey sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside.\n2. Preheat the oven to 350 degrees F (175 degrees C).\n3. In a large bowl, stir together eggs, green onions, hash browns, milk, Cheddar cheese, and cooked sausage. Pour mixture into a 9x13-inch baking pan.\n4. Bake in the preheated oven for 1 hour., "}
